MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C39H0AGV2000A/mcu.h
typedef struct stc_canfd_ir_field
{
  __IO uint32_t RF0N       : 1;
  __IO uint32_t RF0W       : 1;
  __IO uint32_t RF0F       : 1;
  __IO uint32_t RF0L       : 1;
  __IO uint32_t RF1N       : 1;
  __IO uint32_t RF1W       : 1;
  __IO uint32_t RF1F       : 1;
  __IO uint32_t RF1L       : 1;
  __IO uint32_t HPM        : 1;
  __IO uint32_t TC         : 1;
  __IO uint32_t TCF        : 1;
  __IO uint32_t TFE        : 1;
  __IO uint32_t TEFN       : 1;
  __IO uint32_t TEFW       : 1;
  __IO uint32_t TEFF       : 1;
  __IO uint32_t TEFL       : 1;
  __IO uint32_t TSW        : 1;
  __IO uint32_t MRAF       : 1;
  __IO uint32_t TOO        : 1;
  __IO uint32_t DRX        : 1;
  __IO uint32_t BEC        : 1;
  __IO uint32_t BEU        : 1;
  __IO uint32_t ELO        : 1;
  __IO uint32_t EP         : 1;
  __IO uint32_t EW         : 1;
  __IO uint32_t BO         : 1;
  __IO uint32_t WDI        : 1;
  __IO uint32_t CRCE       : 1;
  __IO uint32_t BE         : 1;
  __IO uint32_t ACKE       : 1;
  __IO uint32_t FOE        : 1;
  __IO uint32_t STE        : 1;
} stc_canfd_ir_field_t;

typedef struct stc_canfd_ie_field
{
  __IO uint32_t RF0NE      : 1;
  __IO uint32_t RF0WE      : 1;
  __IO uint32_t RF0FE      : 1;
  __IO uint32_t RF0LE      : 1;
  __IO uint32_t RF1NE      : 1;
  __IO uint32_t RF1WE      : 1;
  __IO uint32_t RF1FE      : 1;
  __IO uint32_t RF1LE      : 1;
  __IO uint32_t HPME       : 1;
  __IO uint32_t TCE        : 1;
  __IO uint32_t TCFE       : 1;
  __IO uint32_t TFEE       : 1;
  __IO uint32_t TEFNE      : 1;
  __IO uint32_t TEFWE      : 1;
  __IO uint32_t TEFFE      : 1;
  __IO uint32_t TEFLE      : 1;
  __IO uint32_t TSWE       : 1;
  __IO uint32_t MRAFE      : 1;
  __IO uint32_t TOOE       : 1;
  __IO uint32_t DRXE       : 1;
  __IO uint32_t BECE       : 1;
  __IO uint32_t BEUE       : 1;
  __IO uint32_t ELOE       : 1;
  __IO uint32_t EPE        : 1;
  __IO uint32_t EWE        : 1;
  __IO uint32_t BOE        : 1;
  __IO uint32_t WDIE       : 1;
  __IO uint32_t CRCEE      : 1;
  __IO uint32_t BEE        : 1;
  __IO uint32_t ACKEE      : 1;
  __IO uint32_t FOEE       : 1;
  __IO uint32_t STEE       : 1;
} stc_canfd_ie_field_t;

typedef struct stc_canfd_ils_field
{
  __IO uint32_t RF0NL      : 1;
  __IO uint32_t RF0WL      : 1;
  __IO uint32_t RF0FL      : 1;
  __IO uint32_t RF0LL      : 1;
  __IO uint32_t RF1NL      : 1;
  __IO uint32_t RF1WL      : 1;
  __IO uint32_t RF1FL      : 1;
  __IO uint32_t RF1LL      : 1;
  __IO uint32_t HPML       : 1;
  __IO uint32_t TCL        : 1;
  __IO uint32_t TCFL       : 1;
  __IO uint32_t TFEL       : 1;
  __IO uint32_t TEFNL      : 1;
  __IO uint32_t TEFWL      : 1;
  __IO uint32_t TEFFL      : 1;
  __IO uint32_t TEFLL      : 1;
  __IO uint32_t TSWL       : 1;
  __IO uint32_t MRAFL      : 1;
  __IO uint32_t TOOL       : 1;
  __IO uint32_t DRXL       : 1;
  __IO uint32_t BECL       : 1;
  __IO uint32_t BEUL       : 1;
  __IO uint32_t ELOL       : 1;
  __IO uint32_t EPL        : 1;
  __IO uint32_t EWL        : 1;
  __IO uint32_t BOL        : 1;
  __IO uint32_t WDIL       : 1;
  __IO uint32_t CRCEL      : 1;
  __IO uint32_t BEL        : 1;
  __IO uint32_t ACKEL      : 1;
  __IO uint32_t FOEL       : 1;
  __IO uint32_t STEL       : 1;
} stc_canfd_ils_field_t;

typedef struct stc_canfd_ile_field
{
  __IO uint32_t EINT0      : 1;
  __IO uint32_t EINT1      : 1;
} stc_canfd_ile_field_t;

typedef struct stc_canfd_gfc_field
{
  __IO uint32_t RRFE       : 1;
  __IO uint32_t RRFS       : 1;
  __IO uint32_t ANFE       : 2;
  __IO uint32_t ANFS       : 2;
} stc_canfd_gfc_field_t;

typedef struct stc_canfd_sidfc_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t FLSSA      : 14;
  __IO uint32_t LSS        : 8;
} stc_canfd_sidfc_field_t;

typedef struct stc_canfd_xidfc_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t FLESA      : 14;
  __IO uint32_t LSE        : 7;
} stc_canfd_xidfc_field_t;

typedef struct stc_canfd_xidam_field
{
  __IO uint32_t EIDM       : 29;
} stc_canfd_xidam_field_t;

typedef struct stc_canfd_hpms_field
{
  __IO uint32_t BIDX       : 6;
  __IO uint32_t MSI        : 2;
  __IO uint32_t FIDX       : 7;
  __IO uint32_t FLST       : 1;
} stc_canfd_hpms_field_t;

typedef struct stc_canfd_ndat1_field
{
  __IO uint32_t ND0        : 1;
  __IO uint32_t ND1        : 1;
  __IO uint32_t ND2        : 1;
  __IO uint32_t ND3        : 1;
  __IO uint32_t ND4        : 1;
  __IO uint32_t ND5        : 1;
  __IO uint32_t ND6        : 1;
  __IO uint32_t ND7        : 1;
  __IO uint32_t ND8        : 1;
  __IO uint32_t ND9        : 1;
  __IO uint32_t ND10       : 1;
  __IO uint32_t ND11       : 1;
  __IO uint32_t ND12       : 1;
  __IO uint32_t ND13       : 1;
  __IO uint32_t ND14       : 1;
  __IO uint32_t ND15       : 1;
  __IO uint32_t ND16       : 1;
  __IO uint32_t ND17       : 1;
  __IO uint32_t ND18       : 1;
  __IO uint32_t ND19       : 1;
  __IO uint32_t ND20       : 1;
  __IO uint32_t ND21       : 1;
  __IO uint32_t ND22       : 1;
  __IO uint32_t ND23       : 1;
  __IO uint32_t ND24       : 1;
  __IO uint32_t ND25       : 1;
  __IO uint32_t ND26       : 1;
  __IO uint32_t ND27       : 1;
  __IO uint32_t ND28       : 1;
  __IO uint32_t ND29       : 1;
  __IO uint32_t ND30       : 1;
  __IO uint32_t ND31       : 1;
} stc_canfd_ndat1_field_t;

typedef struct stc_canfd_ndat2_field
{
  __IO uint32_t ND32       : 1;
  __IO uint32_t ND33       : 1;
  __IO uint32_t ND34       : 1;
  __IO uint32_t ND35       : 1;
  __IO uint32_t ND36       : 1;
  __IO uint32_t ND37       : 1;
  __IO uint32_t ND38       : 1;
  __IO uint32_t ND39       : 1;
  __IO uint32_t ND40       : 1;
  __IO uint32_t ND41       : 1;
  __IO uint32_t ND42       : 1;
  __IO uint32_t ND43       : 1;
  __IO uint32_t ND44       : 1;
  __IO uint32_t ND45       : 1;
  __IO uint32_t ND46       : 1;
  __IO uint32_t ND47       : 1;
  __IO uint32_t ND48       : 1;
  __IO uint32_t ND49       : 1;
  __IO uint32_t ND50       : 1;
  __IO uint32_t ND51       : 1;
  __IO uint32_t ND52       : 1;
  __IO uint32_t ND53       : 1;
  __IO uint32_t ND54       : 1;
  __IO uint32_t ND55       : 1;
  __IO uint32_t ND56       : 1;
  __IO uint32_t ND57       : 1;
  __IO uint32_t ND58       : 1;
  __IO uint32_t ND59       : 1;
  __IO uint32_t ND60       : 1;
  __IO uint32_t ND61       : 1;
  __IO uint32_t ND62       : 1;
  __IO uint32_t ND63       : 1;
} stc_canfd_ndat2_field_t;

typedef struct stc_canfd_rxf0c_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t F0SA       : 14;
  __IO uint32_t F0S        : 7;
       uint32_t RESERVED2  : 1;
  __IO uint32_t F0WM       : 7;
  __IO uint32_t F0OM       : 1;
} stc_canfd_rxf0c_field_t;

typedef struct stc_canfd_rxf0s_field
{
  __IO uint32_t F0FL       : 7;
       uint32_t RESERVED1  : 1;
  __IO uint32_t F0GI       : 6;
       uint32_t RESERVED2  : 2;
  __IO uint32_t F0PI       : 6;
       uint32_t RESERVED3  : 2;
  __IO uint32_t F0F        : 1;
  __IO uint32_t RF0L       : 1;
} stc_canfd_rxf0s_field_t;

