MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C39H0AGV2000A/mcu.h
typedef struct stc_canfd_txbcf_field
{
  __IO uint32_t CF0        : 1;
  __IO uint32_t CF1        : 1;
  __IO uint32_t CF2        : 1;
  __IO uint32_t CF3        : 1;
  __IO uint32_t CF4        : 1;
  __IO uint32_t CF5        : 1;
  __IO uint32_t CF6        : 1;
  __IO uint32_t CF7        : 1;
  __IO uint32_t CF8        : 1;
  __IO uint32_t CF9        : 1;
  __IO uint32_t CF10       : 1;
  __IO uint32_t CF11       : 1;
  __IO uint32_t CF12       : 1;
  __IO uint32_t CF13       : 1;
  __IO uint32_t CF14       : 1;
  __IO uint32_t CF15       : 1;
  __IO uint32_t CF16       : 1;
  __IO uint32_t CF17       : 1;
  __IO uint32_t CF18       : 1;
  __IO uint32_t CF19       : 1;
  __IO uint32_t CF20       : 1;
  __IO uint32_t CF21       : 1;
  __IO uint32_t CF22       : 1;
  __IO uint32_t CF23       : 1;
  __IO uint32_t CF24       : 1;
  __IO uint32_t CF25       : 1;
  __IO uint32_t CF26       : 1;
  __IO uint32_t CF27       : 1;
  __IO uint32_t CF28       : 1;
  __IO uint32_t CF29       : 1;
  __IO uint32_t CF30       : 1;
  __IO uint32_t CF31       : 1;
} stc_canfd_txbcf_field_t;

typedef struct stc_canfd_txbtie_field
{
  __IO uint32_t TIE0       : 1;
  __IO uint32_t TIE1       : 1;
  __IO uint32_t TIE2       : 1;
  __IO uint32_t TIE3       : 1;
  __IO uint32_t TIE4       : 1;
  __IO uint32_t TIE5       : 1;
  __IO uint32_t TIE6       : 1;
  __IO uint32_t TIE7       : 1;
  __IO uint32_t TIE8       : 1;
  __IO uint32_t TIE9       : 1;
  __IO uint32_t TIE10      : 1;
  __IO uint32_t TIE11      : 1;
  __IO uint32_t TIE12      : 1;
  __IO uint32_t TIE13      : 1;
  __IO uint32_t TIE14      : 1;
  __IO uint32_t TIE15      : 1;
  __IO uint32_t TIE16      : 1;
  __IO uint32_t TIE17      : 1;
  __IO uint32_t TIE18      : 1;
  __IO uint32_t TIE19      : 1;
  __IO uint32_t TIE20      : 1;
  __IO uint32_t TIE21      : 1;
  __IO uint32_t TIE22      : 1;
  __IO uint32_t TIE23      : 1;
  __IO uint32_t TIE24      : 1;
  __IO uint32_t TIE25      : 1;
  __IO uint32_t TIE26      : 1;
  __IO uint32_t TIE27      : 1;
  __IO uint32_t TIE28      : 1;
  __IO uint32_t TIE29      : 1;
  __IO uint32_t TIE30      : 1;
  __IO uint32_t TIE31      : 1;
} stc_canfd_txbtie_field_t;

typedef struct stc_canfd_txbcie_field
{
  __IO uint32_t CFIE0      : 1;
  __IO uint32_t CFIE1      : 1;
  __IO uint32_t CFIE2      : 1;
  __IO uint32_t CFIE3      : 1;
  __IO uint32_t CFIE4      : 1;
  __IO uint32_t CFIE5      : 1;
  __IO uint32_t CFIE6      : 1;
  __IO uint32_t CFIE7      : 1;
  __IO uint32_t CFIE8      : 1;
  __IO uint32_t CFIE9      : 1;
  __IO uint32_t CFIE10     : 1;
  __IO uint32_t CFIE11     : 1;
  __IO uint32_t CFIE12     : 1;
  __IO uint32_t CFIE13     : 1;
  __IO uint32_t CFIE14     : 1;
  __IO uint32_t CFIE15     : 1;
  __IO uint32_t CFIE16     : 1;
  __IO uint32_t CFIE17     : 1;
  __IO uint32_t CFIE18     : 1;
  __IO uint32_t CFIE19     : 1;
  __IO uint32_t CFIE20     : 1;
  __IO uint32_t CFIE21     : 1;
  __IO uint32_t CFIE22     : 1;
  __IO uint32_t CFIE23     : 1;
  __IO uint32_t CFIE24     : 1;
  __IO uint32_t CFIE25     : 1;
  __IO uint32_t CFIE26     : 1;
  __IO uint32_t CFIE27     : 1;
  __IO uint32_t CFIE28     : 1;
  __IO uint32_t CFIE29     : 1;
  __IO uint32_t CFIE30     : 1;
  __IO uint32_t CFIE31     : 1;
} stc_canfd_txbcie_field_t;

typedef struct stc_canfd_txefc_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t EFSA       : 14;
  __IO uint32_t EFS        : 6;
       uint32_t RESERVED2  : 2;
  __IO uint32_t EFWM       : 6;
} stc_canfd_txefc_field_t;

typedef struct stc_canfd_txfs_field
{
  __IO uint32_t EFFL       : 6;
       uint32_t RESERVED1  : 2;
  __IO uint32_t EFGI       : 5;
       uint32_t RESERVED2  : 3;
  __IO uint32_t EFPI       : 5;
       uint32_t RESERVED3  : 3;
  __IO uint32_t EFF        : 1;
  __IO uint32_t TEFL       : 1;
} stc_canfd_txfs_field_t;

typedef struct stc_canfd_txfa_field
{
  __IO uint32_t EFAI       : 5;
} stc_canfd_txfa_field_t;

typedef struct stc_canfd_fdecr_field
{
  __IO  uint8_t SEIE       : 1;
  __IO  uint8_t DEIE       : 1;
  __IO  uint8_t CEREN      : 1;
  __IO  uint8_t CEIV       : 1;
} stc_canfd_fdecr_field_t;

typedef struct stc_canfd_fdesr_field
{
  __IO  uint8_t SEI        : 1;
  __IO  uint8_t DEI        : 1;
} stc_canfd_fdesr_field_t;

typedef struct stc_canfd_fdsear_field
{
  __IO uint16_t SRA        : 16;
} stc_canfd_fdsear_field_t;

typedef struct stc_canfd_fdescr_field
{
  __IO  uint8_t SEIC       : 1;
  __IO  uint8_t DEIC       : 1;
} stc_canfd_fdescr_field_t;

typedef struct stc_canfd_fddear_field
{
  __IO uint16_t DRA        : 16;
} stc_canfd_fddear_field_t;

typedef struct stc_canfd_tscntr_field
{
  __IO uint16_t CCLR       : 1;
} stc_canfd_tscntr_field_t;

typedef struct stc_canfd_tsmdr_field
{
  __IO uint16_t CNTEN      : 1;
} stc_canfd_tsmdr_field_t;

typedef struct stc_canfd_tsdivr_field
{
  __IO uint32_t CDIV       : 16;
} stc_canfd_tsdivr_field_t;

typedef struct stc_canfd_tscdtr_field
{
  __IO uint16_t CNT        : 16;
} stc_canfd_tscdtr_field_t;

typedef struct stc_canfd_tscpclr_field
{
  __IO uint16_t CMP        : 16;
} stc_canfd_tscpclr_field_t;

/******************************************************************************
 * PCRC_MODULE
 ******************************************************************************/
/* PCRC_MODULE register bit fields */
typedef struct stc_pcrc_prgcrc_cfg_field
{
  __IO uint32_t CIRQCLR    : 1;
       uint32_t RESERVED0  : 7;
  __IO uint32_t FO         : 2;
  __IO uint32_t FI         : 2;
       uint32_t RESERVED1  : 4;
  __IO uint32_t TEST       : 6;
  __IO uint32_t SZ         : 2;
  __IO uint32_t CIRQ       : 1;
  __IO uint32_t CIEN       : 1;
  __IO uint32_t CDEN       : 1;
       uint32_t RESERVED2  : 1;
  __IO uint32_t LOCK       : 1;
} stc_pcrc_prgcrc_cfg_field_t;

/******************************************************************************
 * HSSPI_MODULE
 ******************************************************************************/
/* HSSPI_MODULE register bit fields */
typedef struct stc_hsspi_mctrl_field
{
  __IO uint32_t MEN        : 1;
  __IO uint32_t CSEN       : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t MES        : 1;
  __IO uint32_t SYNCON     : 1;
} stc_hsspi_mctrl_field_t;

typedef struct stc_hsspi_pcc0_field
{
  __IO uint32_t CPHA       : 1;
  __IO uint32_t CPOL       : 1;
  __IO uint32_t ACES       : 1;
  __IO uint32_t RTM        : 1;
  __IO uint32_t SSPOL      : 1;
  __IO uint32_t SS2CD      : 2;
  __IO uint32_t SDIR       : 1;
  __IO uint32_t SENDIAN    : 1;
  __IO uint32_t CDRS       : 7;
  __IO uint32_t SAFESYNC   : 1;
  __IO uint32_t WRDSEL     : 4;
  __IO uint32_t RDDSEL     : 2;
} stc_hsspi_pcc0_field_t;

typedef struct stc_hsspi_pcc1_field
{
  __IO uint32_t CPHA       : 1;
  __IO uint32_t CPOL       : 1;
  __IO uint32_t ACES       : 1;
  __IO uint32_t RTM        : 1;
  __IO uint32_t SSPOL      : 1;
  __IO uint32_t SS2CD      : 2;
  __IO uint32_t SDIR       : 1;
  __IO uint32_t SENDIAN    : 1;
  __IO uint32_t CDRS       : 7;
  __IO uint32_t SAFESYNC   : 1;
  __IO uint32_t WRDSEL     : 4;
  __IO uint32_t RDDSEL     : 2;
} stc_hsspi_pcc1_field_t;

typedef struct stc_hsspi_pcc2_field
{
  __IO uint32_t CPHA       : 1;
  __IO uint32_t CPOL       : 1;
  __IO uint32_t ACES       : 1;
  __IO uint32_t RTM        : 1;
  __IO uint32_t SSPOL      : 1;
  __IO uint32_t SS2CD      : 2;
  __IO uint32_t SDIR       : 1;
  __IO uint32_t SENDIAN    : 1;
  __IO uint32_t CDRS       : 7;
  __IO uint32_t SAFESYNC   : 1;
  __IO uint32_t WRDSEL     : 4;
  __IO uint32_t RDDSEL     : 2;
} stc_hsspi_pcc2_field_t;

typedef struct stc_hsspi_pcc3_field
{
  __IO uint32_t CPHA       : 1;
  __IO uint32_t CPOL       : 1;
  __IO uint32_t ACES       : 1;
  __IO uint32_t RTM        : 1;
  __IO uint32_t SSPOL      : 1;
  __IO uint32_t SS2CD      : 2;
  __IO uint32_t SDIR       : 1;
  __IO uint32_t SENDIAN    : 1;
  __IO uint32_t CDRS       : 7;
  __IO uint32_t SAFESYNC   : 1;
  __IO uint32_t WRDSEL     : 4;
  __IO uint32_t RDDSEL     : 2;
} stc_hsspi_pcc3_field_t;

typedef struct stc_hsspi_txf_field
{
  __IO uint32_t TFFS       : 1;
  __IO uint32_t TFES       : 1;
  __IO uint32_t TFOS       : 1;
  __IO uint32_t TFUS       : 1;
  __IO uint32_t TFLETS     : 1;
  __IO uint32_t TFMTS      : 1;
  __IO uint32_t TSSRS      : 1;
} stc_hsspi_txf_field_t;

