MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C39H0AGV2000A/mcu.h
/******************************************************************************
 * CRC_MODULE
 ******************************************************************************/
/* CRC registers */
typedef struct
{
  union {
    __IO  uint8_t CRCCR;
    stc_crc_crccr_field_t CRCCR_f;
  };
        uint8_t RESERVED0[3];
  __IO uint32_t CRCINIT;
  union {
    __IO uint32_t CRCIN;
    struct {
      union {
        __IO uint16_t CRCINL;
        struct {
          __IO  uint8_t CRCINLL;
          __IO  uint8_t CRCINLH;
        };
      };
      union {
        __IO uint16_t CRCINH;
        struct {
          __IO  uint8_t CRCINHL;
          __IO  uint8_t CRCINHH;
        };
      };
    };
  };
  __IO uint32_t CRCR;
}FM4_CRC_TypeDef;

/******************************************************************************
 * DSTC_MODULE
 ******************************************************************************/
/* DSTC registers */
typedef struct
{
  __IO uint32_t DESTP;
  union {
    __IO uint32_t HWDESP;
    stc_dstc_hwdesp_field_t HWDESP_f;
  };
  __IO uint8_t CMD;
  union {
    __IO uint8_t CFG;
    stc_dstc_cfg_field_t CFG_f;
  };
  union {
    __IO uint16_t SWTR;
    stc_dstc_swtr_field_t SWTR_f;
  };
  union {
    __IO uint32_t MONERS;
    stc_dstc_moners_field_t MONERS_f;
  };
  __IO uint32_t DREQENB0;
  __IO uint32_t DREQENB1;
  __IO uint32_t DREQENB2;
  __IO uint32_t DREQENB3;
  __IO uint32_t DREQENB4;
  __IO uint32_t DREQENB5;
  __IO uint32_t DREQENB6;
  __IO uint32_t DREQENB7;
  __IO uint32_t HWINT0;
  __IO uint32_t HWINT1;
  __IO uint32_t HWINT2;
  __IO uint32_t HWINT3;
  __IO uint32_t HWINT4;
  __IO uint32_t HWINT5;
  __IO uint32_t HWINT6;
  __IO uint32_t HWINT7;
  __IO uint32_t HWINTCLR0;
  __IO uint32_t HWINTCLR1;
  __IO uint32_t HWINTCLR2;
  __IO uint32_t HWINTCLR3;
  __IO uint32_t HWINTCLR4;
  __IO uint32_t HWINTCLR5;
  __IO uint32_t HWINTCLR6;
  __IO uint32_t HWINTCLR7;
  __IO uint32_t DQMSK0;
  __IO uint32_t DQMSK1;
  __IO uint32_t DQMSK2;
  __IO uint32_t DQMSK3;
  __IO uint32_t DQMSK4;
  __IO uint32_t DQMSK5;
  __IO uint32_t DQMSK6;
  __IO uint32_t DQMSK7;
  __IO uint32_t DQMSKCLR0;
  __IO uint32_t DQMSKCLR1;
  __IO uint32_t DQMSKCLR2;
  __IO uint32_t DQMSKCLR3;
  __IO uint32_t DQMSKCLR4;
  __IO uint32_t DQMSKCLR5;
  __IO uint32_t DQMSKCLR6;
  __IO uint32_t DQMSKCLR7;
}FM4_DSTC_TypeDef;

/******************************************************************************
 * WC_MODULE
 ******************************************************************************/
/* Watch counter registers */
typedef struct
{
  union {
    __IO  uint8_t WCRD;
    stc_wc_wcrd_field_t WCRD_f;
  };
  union {
    __IO  uint8_t WCRL;
    stc_wc_wcrl_field_t WCRL_f;
  };
  union {
    __IO  uint8_t WCCR;
    stc_wc_wccr_field_t WCCR_f;
  };
        uint8_t RESERVED0[13];
  union {
    __IO uint16_t CLK_SEL;
    stc_wc_clk_sel_field_t CLK_SEL_f;
  };
        uint8_t RESERVED1[2];
  union {
    __IO  uint8_t CLK_EN;
    stc_wc_clk_en_field_t CLK_EN_f;
  };
}FM4_WC_TypeDef;

/******************************************************************************
 * RTC_MODULE
 ******************************************************************************/
/* Real time clock registers */
typedef struct
{
  union {
    __IO  uint8_t WTCR10;
    stc_rtc_wtcr10_field_t WTCR10_f;
  };
        uint8_t RESERVED1[3];
  union {
    __IO  uint8_t WTCR11;
    stc_rtc_wtcr11_field_t WTCR11_f;
  };
        uint8_t RESERVED2[3];
  union {
    __IO  uint8_t WTCR12;
    stc_rtc_wtcr12_field_t WTCR12_f;
  };
        uint8_t RESERVED3[3];
  union {
    __IO  uint8_t WTCR13;
    stc_rtc_wtcr13_field_t WTCR13_f;
  };
        uint8_t RESERVED4[3];
  union {
    __IO  uint8_t WTCR20;
    stc_rtc_wtcr20_field_t WTCR20_f;
  };
        uint8_t RESERVED5[3];
  union {
    __IO  uint8_t WTCR21;
    stc_rtc_wtcr21_field_t WTCR21_f;
  };
        uint8_t RESERVED6[3];
  __IO  uint8_t WTCR22;
        uint8_t RESERVED7[3];
  union {
    __IO  uint8_t WTSR;
    stc_rtc_wtsr_field_t WTSR_f;
  };
        uint8_t RESERVED8[3];
  union {
    __IO  uint8_t WTMIR;
    stc_rtc_wtmir_field_t WTMIR_f;
  };
        uint8_t RESERVED9[3];
  union {
    __IO  uint8_t WTHR;
    stc_rtc_wthr_field_t WTHR_f;
  };
        uint8_t RESERVED10[3];
  union {
    __IO  uint8_t WTDR;
    stc_rtc_wtdr_field_t WTDR_f;
  };
        uint8_t RESERVED11[3];
  union {
    __IO  uint8_t WTDW;
    stc_rtc_wtdw_field_t WTDW_f;
  };
        uint8_t RESERVED12[3];
  union {
    __IO  uint8_t WTMOR;
    stc_rtc_wtmor_field_t WTMOR_f;
  };
        uint8_t RESERVED13[3];
  union {
    __IO  uint8_t WTYR;
    stc_rtc_wtyr_field_t WTYR_f;
  };
        uint8_t RESERVED14[3];
  union {
    __IO  uint8_t ALMIR;
    stc_rtc_almir_field_t ALMIR_f;
  };
        uint8_t RESERVED15[3];
  union {
    __IO  uint8_t ALHR;
    stc_rtc_alhr_field_t ALHR_f;
  };
        uint8_t RESERVED16[3];
  union {
    __IO  uint8_t ALDR;
    stc_rtc_aldr_field_t ALDR_f;
  };
        uint8_t RESERVED17[3];
  union {
    __IO  uint8_t ALMOR;
    stc_rtc_almor_field_t ALMOR_f;
  };
        uint8_t RESERVED18[3];
  union {
    __IO  uint8_t ALYR;
    stc_rtc_alyr_field_t ALYR_f;
  };
        uint8_t RESERVED19[3];
  union {
    __IO  uint8_t WTTR0;
    stc_rtc_wttr0_field_t WTTR0_f;
  };
        uint8_t RESERVED20[3];
  union {
    __IO  uint8_t WTTR1;
    stc_rtc_wttr1_field_t WTTR1_f;
  };
        uint8_t RESERVED21[3];
  union {
    __IO  uint8_t WTTR2;
    stc_rtc_wttr2_field_t WTTR2_f;
  };
        uint8_t RESERVED22[3];
  __IO  uint8_t WTCAL0;
        uint8_t RESERVED23[3];
  union {
    __IO  uint8_t WTCAL1;
    stc_rtc_wtcal1_field_t WTCAL1_f;
  };
        uint8_t RESERVED24[3];
  union {
    __IO  uint8_t WTCALEN;
    stc_rtc_wtcalen_field_t WTCALEN_f;
  };
        uint8_t RESERVED25[3];
  union {
    __IO  uint8_t WTDIV;
    stc_rtc_wtdiv_field_t WTDIV_f;
  };
        uint8_t RESERVED26[3];
  union {
    __IO  uint8_t WTDIVEN;
    stc_rtc_wtdiven_field_t WTDIVEN_f;
  };
        uint8_t RESERVED27[3];
  union {
    __IO  uint8_t WTCALPRD;
    stc_rtc_wtcalprd_field_t WTCALPRD_f;
  };
        uint8_t RESERVED28[3];
  union {
    __IO  uint8_t WTCOSEL;
    stc_rtc_wtcosel_field_t WTCOSEL_f;
  };
        uint8_t RESERVED29[3];
  union {
    __IO  uint8_t VB_CLKDIV;
    stc_rtc_vb_clkdiv_field_t VB_CLKDIV_f;
  };
        uint8_t RESERVED30[3];
  union {
    __IO  uint8_t WTOSCCNT;
    stc_rtc_wtosccnt_field_t WTOSCCNT_f;
  };
        uint8_t RESERVED31[3];
  __IO  uint8_t CCS;
        uint8_t RESERVED32[3];
  __IO  uint8_t CCB;
        uint8_t RESERVED33[3];
  /* Don't exist on peripheral manual */
  __IO  uint8_t TRIM;
        uint8_t RESERVED34[3];
  union {
    __IO  uint8_t BOOST;
    stc_rtc_boost_field_t BOOST_f;
  };
        uint8_t RESERVED35[3];
  union {
    __IO  uint8_t EWKUP;
    stc_rtc_ewkup_field_t EWKUP_f;
  };
        uint8_t RESERVED36[3];
  union {
    __IO  uint8_t VDET;
    stc_rtc_vdet_field_t VDET_f;
  };
        uint8_t RESERVED37[3];
  /* Don't exist on peripheral manual */
  __IO  uint8_t FDET;
        uint8_t RESERVED38[3];
  union {
    __IO  uint8_t HIBRST;
    stc_rtc_hibrst_field_t HIBRST_f;
  };
        uint8_t RESERVED39[3];
  union {
    __IO  uint8_t VBPFR;
    stc_rtc_vbpfr_field_t VBPFR_f;
  };
        uint8_t RESERVED40[3];
  union {
    __IO  uint8_t VBPCR;
    stc_rtc_vbpcr_field_t VBPCR_f;
  };
        uint8_t RESERVED41[3];
  union {
    __IO  uint8_t VBDDR;
    stc_rtc_vbddr_field_t VBDDR_f;
  };
        uint8_t RESERVED42[3];
  union {
    __IO  uint8_t VBDIR;
    stc_rtc_vbdir_field_t VBDIR_f;
  };
        uint8_t RESERVED43[3];
  union {
    __IO  uint8_t VBDOR;
    stc_rtc_vbdor_field_t VBDOR_f;
  };
        uint8_t RESERVED44[3];
  union {
    __IO  uint8_t VBPZR;
    stc_rtc_vbpzr_field_t VBPZR_f;
  };
        uint8_t RESERVED45[79];
  union {
    __IO uint32_t BREG00_03;
    struct {
      __IO uint16_t BREG00_01;
      __IO uint16_t BREG02_03;
    };
    struct {
      __IO  uint8_t BREG00;
      __IO  uint8_t BREG01;
      __IO  uint8_t BREG02;
      __IO  uint8_t BREG03;
    };
  };
  union {
    __IO uint32_t BREG04_07;
    struct {
      __IO uint16_t BREG04_05;
      __IO uint16_t BREG06_07;
    };
    struct {
      __IO  uint8_t BREG04;
      __IO  uint8_t BREG05;
      __IO  uint8_t BREG06;
      __IO  uint8_t BREG07;
    };
  };
  union {
    __IO uint32_t BREG08_0B;
    struct {
      __IO uint16_t BREG08_09;
      __IO uint16_t BREG0A_0B;
    };
    struct {
      __IO  uint8_t BREG08;
      __IO  uint8_t BREG09;
      __IO  uint8_t BREG0A;
      __IO  uint8_t BREG0B;
    };
  };
  union {
    __IO uint32_t BREG0C_0F;
    struct {
      __IO uint16_t BREG0C_0D;
      __IO uint16_t BREG0E_0F;
    };
    struct {
      __IO  uint8_t BREG0C;
      __IO  uint8_t BREG0D;
      __IO  uint8_t BREG0E;
      __IO  uint8_t BREG0F;
    };
  };
  union {
    __IO uint32_t BREG10_13;
    struct {
      __IO uint16_t BREG10_11;
      __IO uint16_t BREG12_13;
    };
    struct {
      __IO  uint8_t BREG10;
      __IO  uint8_t BREG11;
      __IO  uint8_t BREG12;
      __IO  uint8_t BREG13;
    };
  };
  union {
    __IO uint32_t BREG14_17;
    struct {
      __IO uint16_t BREG14_15;
      __IO uint16_t BREG16_17;
    };
    struct {
      __IO  uint8_t BREG14;
      __IO  uint8_t BREG15;
      __IO  uint8_t BREG16;
      __IO  uint8_t BREG17;
    };
  };
  union {
    __IO uint32_t BREG18_1B;
    struct {
      __IO uint16_t BREG18_19;
      __IO uint16_t BREG1A_1B;
    };
    struct {
      __IO  uint8_t BREG18;
      __IO  uint8_t BREG19;
      __IO  uint8_t BREG1A;
      __IO  uint8_t BREG1B;
    };
  };
  union {
    __IO uint32_t BREG1C_1F;
    struct {
      __IO uint16_t BREG1C_1D;
      __IO uint16_t BREG1E_1F;
    };
    struct {
      __IO  uint8_t BREG1C;
      __IO  uint8_t BREG1D;
      __IO  uint8_t BREG1E;
      __IO  uint8_t BREG1F;
    };
  };
  union {
    __IO uint32_t BREG20_23;
    struct {
      __IO uint16_t BREG20_21;
      __IO uint16_t BREG22_23;
    };
    struct {
      __IO  uint8_t BREG20;
      __IO  uint8_t BREG21;
      __IO  uint8_t BREG22;
      __IO  uint8_t BREG23;
    };
  };
  union {
    __IO uint32_t BREG24_27;
    struct {
      __IO uint16_t BREG24_25;
      __IO uint16_t BREG26_27;
    };
    struct {
      __IO  uint8_t BREG24;
      __IO  uint8_t BREG25;
      __IO  uint8_t BREG26;
      __IO  uint8_t BREG27;
    };
  };
  union {
    __IO uint32_t BREG28_2B;
    struct {
      __IO uint16_t BREG28_29;
      __IO uint16_t BREG2A_2B;
    };
    struct {
      __IO  uint8_t BREG28;
      __IO  uint8_t BREG29;
      __IO  uint8_t BREG2A;
      __IO  uint8_t BREG2B;
    };
  };
  union {
    __IO uint32_t BREG2C_2F;
    struct {
      __IO uint16_t BREG2C_2D;
      __IO uint16_t BREG2E_2F;
    };
    struct {
      __IO  uint8_t BREG2C;
      __IO  uint8_t BREG2D;
      __IO  uint8_t BREG2E;
      __IO  uint8_t BREG2F;
    };
  };
  union {
    __IO uint32_t BREG30_33;
    struct {
      __IO uint16_t BREG30_31;
      __IO uint16_t BREG32_33;
    };
    struct {
      __IO  uint8_t BREG30;
      __IO  uint8_t BREG31;
      __IO  uint8_t BREG32;
      __IO  uint8_t BREG33;
    };
  };
  union {
    __IO uint32_t BREG34_37;
    struct {
      __IO uint16_t BREG34_35;
      __IO uint16_t BREG36_37;
    };
    struct {
      __IO  uint8_t BREG34;
      __IO  uint8_t BREG35;
      __IO  uint8_t BREG36;
      __IO  uint8_t BREG37;
    };
  };
  union {
    __IO uint32_t BREG38_3B;
    struct {
      __IO uint16_t BREG38_39;
      __IO uint16_t BREG3A_3B;
    };
    struct {
      __IO  uint8_t BREG38;
      __IO  uint8_t BREG39;
      __IO  uint8_t BREG3A;
      __IO  uint8_t BREG3B;
    };
  };
  union {
    __IO uint32_t BREG3C_3F;
    struct {
      __IO uint16_t BREG3C_3D;
      __IO uint16_t BREG3E_3F;
    };
    struct {
      __IO  uint8_t BREG3C;
      __IO  uint8_t BREG3D;
      __IO  uint8_t BREG3E;
      __IO  uint8_t BREG3F;
    };
  };
  union {
    __IO uint32_t BREG40_43;
    struct {
      __IO uint16_t BREG40_41;
      __IO uint16_t BREG42_43;
    };
    struct {
      __IO  uint8_t BREG40;
      __IO  uint8_t BREG41;
      __IO  uint8_t BREG42;
      __IO  uint8_t BREG43;
    };
  };
  union {
    __IO uint32_t BREG44_47;
    struct {
      __IO uint16_t BREG44_45;
      __IO uint16_t BREG46_47;
    };
    struct {
      __IO  uint8_t BREG44;
      __IO  uint8_t BREG45;
      __IO  uint8_t BREG46;
      __IO  uint8_t BREG47;
    };
  };
  union {
    __IO uint32_t BREG48_4B;
    struct {
      __IO uint16_t BREG48_49;
      __IO uint16_t BREG4A_4B;
    };
    struct {
      __IO  uint8_t BREG48;
      __IO  uint8_t BREG49;
      __IO  uint8_t BREG4A;
      __IO  uint8_t BREG4B;
    };
  };
  union {
    __IO uint32_t BREG4C_4F;
    struct {
      __IO uint16_t BREG4C_4D;
      __IO uint16_t BREG4E_4F;
    };
    struct {
      __IO  uint8_t BREG4C;
      __IO  uint8_t BREG4D;
      __IO  uint8_t BREG4E;
      __IO  uint8_t BREG4F;
    };
  };
  union {
    __IO uint32_t BREG50_53;
    struct {
      __IO uint16_t BREG50_51;
      __IO uint16_t BREG52_53;
    };
    struct {
      __IO  uint8_t BREG50;
      __IO  uint8_t BREG51;
      __IO  uint8_t BREG52;
      __IO  uint8_t BREG53;
    };
  };
  union {
    __IO uint32_t BREG54_57;
    struct {
      __IO uint16_t BREG54_55;
      __IO uint16_t BREG56_57;
    };
    struct {
      __IO  uint8_t BREG54;
      __IO  uint8_t BREG55;
      __IO  uint8_t BREG56;
      __IO  uint8_t BREG57;
    };
  };
  union {
    __IO uint32_t BREG58_5B;
    struct {
      __IO uint16_t BREG58_59;
      __IO uint16_t BREG5A_5B;
    };
    struct {
      __IO  uint8_t BREG58;
      __IO  uint8_t BREG59;
      __IO  uint8_t BREG5A;
      __IO  uint8_t BREG5B;
    };
  };
  union {
    __IO uint32_t BREG5C_5F;
    struct {
      __IO uint16_t BREG5C_5D;
      __IO uint16_t BREG5E_5F;
    };
    struct {
      __IO  uint8_t BREG5C;
      __IO  uint8_t BREG5D;
      __IO  uint8_t BREG5E;
      __IO  uint8_t BREG5F;
    };
  };
  union {
    __IO uint32_t BREG60_63;
    struct {
      __IO uint16_t BREG60_61;
      __IO uint16_t BREG62_63;
    };
    struct {
      __IO  uint8_t BREG60;
      __IO  uint8_t BREG61;
      __IO  uint8_t BREG62;
      __IO  uint8_t BREG63;
    };
  };
  union {
    __IO uint32_t BREG64_67;
    struct {
      __IO uint16_t BREG64_65;
      __IO uint16_t BREG66_67;
    };
    struct {
      __IO  uint8_t BREG64;
      __IO  uint8_t BREG65;
      __IO  uint8_t BREG66;
      __IO  uint8_t BREG67;
    };
  };
  union {
    __IO uint32_t BREG68_6B;
    struct {
      __IO uint16_t BREG68_69;
      __IO uint16_t BREG6A_6B;
    };
    struct {
      __IO  uint8_t BREG68;
      __IO  uint8_t BREG69;
      __IO  uint8_t BREG6A;
      __IO  uint8_t BREG6B;
    };
  };
  union {
    __IO uint32_t BREG6C_6F;
    struct {
      __IO uint16_t BREG6C_6D;
      __IO uint16_t BREG6E_6F;
    };
    struct {
      __IO  uint8_t BREG6C;
      __IO  uint8_t BREG6D;
      __IO  uint8_t BREG6E;
      __IO  uint8_t BREG6F;
    };
  };
  union {
    __IO uint32_t BREG70_73;
    struct {
      __IO uint16_t BREG70_71;
      __IO uint16_t BREG72_73;
    };
    struct {
      __IO  uint8_t BREG70;
      __IO  uint8_t BREG71;
      __IO  uint8_t BREG72;
      __IO  uint8_t BREG73;
    };
  };
  union {
    __IO uint32_t BREG74_77;
    struct {
      __IO uint16_t BREG74_75;
      __IO uint16_t BREG76_77;
    };
    struct {
      __IO  uint8_t BREG74;
      __IO  uint8_t BREG75;
      __IO  uint8_t BREG76;
      __IO  uint8_t BREG77;
    };
  };
  union {
    __IO uint32_t BREG78_7B;
    struct {
      __IO uint16_t BREG78_79;
      __IO uint16_t BREG7A_7B;
    };
    struct {
      __IO  uint8_t BREG78;
      __IO  uint8_t BREG79;
      __IO  uint8_t BREG7A;
      __IO  uint8_t BREG7B;
    };
  };
  union {
    __IO uint32_t BREG7C_7F;
    struct {
      __IO uint16_t BREG7C_7D;
      __IO uint16_t BREG7E_7F;
    };
    struct {
      __IO  uint8_t BREG7C;
      __IO  uint8_t BREG7D;
      __IO  uint8_t BREG7E;
      __IO  uint8_t BREG7F;
    };
  };
}FM4_RTC_TypeDef;

