MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C39H0AGV2000A/mcu.h
/* Multifunction Timer unit 2 Output Compare Unit registers */
#define bFM4_MFT2_OCU_OCSA10_CST0              *((volatile unsigned char*)(0x42442300UL))
#define bFM4_MFT2_OCU_OCSA10_CST1              *((volatile unsigned char*)(0x42442304UL))
#define bFM4_MFT2_OCU_OCSA10_IOE0              *((volatile unsigned char*)(0x42442310UL))
#define bFM4_MFT2_OCU_OCSA10_IOE1              *((volatile unsigned char*)(0x42442314UL))
#define bFM4_MFT2_OCU_OCSA10_IOP0              *((volatile unsigned char*)(0x42442318UL))
#define bFM4_MFT2_OCU_OCSA10_IOP1              *((volatile unsigned char*)(0x4244231CUL))
#define bFM4_MFT2_OCU_OCSB10_OTD0              *((volatile unsigned char*)(0x42442320UL))
#define bFM4_MFT2_OCU_OCSB10_OTD1              *((volatile unsigned char*)(0x42442324UL))
#define bFM4_MFT2_OCU_OCSB10_CMOD              *((volatile unsigned char*)(0x42442330UL))
#define bFM4_MFT2_OCU_OCSB10_FM4               *((volatile unsigned char*)(0x4244233CUL))
#define bFM4_MFT2_OCU_OCSD10_OCCP0BUFE0        *((volatile unsigned char*)(0x42442340UL))
#define bFM4_MFT2_OCU_OCSD10_OCCP0BUFE1        *((volatile unsigned char*)(0x42442344UL))
#define bFM4_MFT2_OCU_OCSD10_OCCP1BUFE0        *((volatile unsigned char*)(0x42442348UL))
#define bFM4_MFT2_OCU_OCSD10_OCCP1BUFE1        *((volatile unsigned char*)(0x4244234CUL))
#define bFM4_MFT2_OCU_OCSD10_OCSE0BUFE0        *((volatile unsigned char*)(0x42442350UL))
#define bFM4_MFT2_OCU_OCSD10_OCSE0BUFE1        *((volatile unsigned char*)(0x42442354UL))
#define bFM4_MFT2_OCU_OCSD10_OCSE1BUFE0        *((volatile unsigned char*)(0x42442358UL))
#define bFM4_MFT2_OCU_OCSD10_OCSE1BUFE1        *((volatile unsigned char*)(0x4244235CUL))
#define bFM4_MFT2_OCU_OCSD10_OPBM0             *((volatile unsigned char*)(0x42442360UL))
#define bFM4_MFT2_OCU_OCSD10_OPBM1             *((volatile unsigned char*)(0x42442364UL))
#define bFM4_MFT2_OCU_OCSD10_OEBM0             *((volatile unsigned char*)(0x42442368UL))
#define bFM4_MFT2_OCU_OCSD10_OEBM1             *((volatile unsigned char*)(0x4244236CUL))
#define bFM4_MFT2_OCU_OCSD10_OFEX0             *((volatile unsigned char*)(0x42442370UL))
#define bFM4_MFT2_OCU_OCSD10_OFEX1             *((volatile unsigned char*)(0x42442374UL))
#define bFM4_MFT2_OCU_OCSA32_CST0              *((volatile unsigned char*)(0x42442380UL))
#define bFM4_MFT2_OCU_OCSA32_CST1              *((volatile unsigned char*)(0x42442384UL))
#define bFM4_MFT2_OCU_OCSA32_IOE0              *((volatile unsigned char*)(0x42442390UL))
#define bFM4_MFT2_OCU_OCSA32_IOE1              *((volatile unsigned char*)(0x42442394UL))
#define bFM4_MFT2_OCU_OCSA32_IOP0              *((volatile unsigned char*)(0x42442398UL))
#define bFM4_MFT2_OCU_OCSA32_IOP1              *((volatile unsigned char*)(0x4244239CUL))
#define bFM4_MFT2_OCU_OCSB32_OTD0              *((volatile unsigned char*)(0x424423A0UL))
#define bFM4_MFT2_OCU_OCSB32_OTD1              *((volatile unsigned char*)(0x424423A4UL))
#define bFM4_MFT2_OCU_OCSB32_CMOD              *((volatile unsigned char*)(0x424423B0UL))
#define bFM4_MFT2_OCU_OCSB32_FM4               *((volatile unsigned char*)(0x424423BCUL))
#define bFM4_MFT2_OCU_OCSD32_OCCP2BUFE0        *((volatile unsigned char*)(0x424423C0UL))
#define bFM4_MFT2_OCU_OCSD32_OCCP2BUFE1        *((volatile unsigned char*)(0x424423C4UL))
#define bFM4_MFT2_OCU_OCSD32_OCCP3BUFE0        *((volatile unsigned char*)(0x424423C8UL))
#define bFM4_MFT2_OCU_OCSD32_OCCP3BUFE1        *((volatile unsigned char*)(0x424423CCUL))
#define bFM4_MFT2_OCU_OCSD32_OCSE2BUFE0        *((volatile unsigned char*)(0x424423D0UL))
#define bFM4_MFT2_OCU_OCSD32_OCSE2BUFE1        *((volatile unsigned char*)(0x424423D4UL))
#define bFM4_MFT2_OCU_OCSD32_OCSE3BUFE0        *((volatile unsigned char*)(0x424423D8UL))
#define bFM4_MFT2_OCU_OCSD32_OCSE3BUFE1        *((volatile unsigned char*)(0x424423DCUL))
#define bFM4_MFT2_OCU_OCSD32_OPBM2             *((volatile unsigned char*)(0x424423E0UL))
#define bFM4_MFT2_OCU_OCSD32_OPBM3             *((volatile unsigned char*)(0x424423E4UL))
#define bFM4_MFT2_OCU_OCSD32_OEBM2             *((volatile unsigned char*)(0x424423E8UL))
#define bFM4_MFT2_OCU_OCSD32_OEBM3             *((volatile unsigned char*)(0x424423ECUL))
#define bFM4_MFT2_OCU_OCSD32_OFEX2             *((volatile unsigned char*)(0x424423F0UL))
#define bFM4_MFT2_OCU_OCSD32_OFEX3             *((volatile unsigned char*)(0x424423F4UL))
#define bFM4_MFT2_OCU_OCSA54_CST0              *((volatile unsigned char*)(0x42442400UL))
#define bFM4_MFT2_OCU_OCSA54_CST1              *((volatile unsigned char*)(0x42442404UL))
#define bFM4_MFT2_OCU_OCSA54_IOE0              *((volatile unsigned char*)(0x42442410UL))
#define bFM4_MFT2_OCU_OCSA54_IOE1              *((volatile unsigned char*)(0x42442414UL))
#define bFM4_MFT2_OCU_OCSA54_IOP0              *((volatile unsigned char*)(0x42442418UL))
#define bFM4_MFT2_OCU_OCSA54_IOP1              *((volatile unsigned char*)(0x4244241CUL))
#define bFM4_MFT2_OCU_OCSB54_OTD0              *((volatile unsigned char*)(0x42442420UL))
#define bFM4_MFT2_OCU_OCSB54_OTD1              *((volatile unsigned char*)(0x42442424UL))
#define bFM4_MFT2_OCU_OCSB54_CMOD              *((volatile unsigned char*)(0x42442430UL))
#define bFM4_MFT2_OCU_OCSB54_FM4               *((volatile unsigned char*)(0x4244243CUL))
#define bFM4_MFT2_OCU_OCSD54_OCCP4BUFE0        *((volatile unsigned char*)(0x42442440UL))
#define bFM4_MFT2_OCU_OCSD54_OCCP4BUFE1        *((volatile unsigned char*)(0x42442444UL))
#define bFM4_MFT2_OCU_OCSD54_OCCP5BUFE0        *((volatile unsigned char*)(0x42442448UL))
#define bFM4_MFT2_OCU_OCSD54_OCCP5BUFE1        *((volatile unsigned char*)(0x4244244CUL))
#define bFM4_MFT2_OCU_OCSD54_OCSE4BUFE0        *((volatile unsigned char*)(0x42442450UL))
#define bFM4_MFT2_OCU_OCSD54_OCSE4BUFE1        *((volatile unsigned char*)(0x42442454UL))
#define bFM4_MFT2_OCU_OCSD54_OCSE5BUFE0        *((volatile unsigned char*)(0x42442458UL))
#define bFM4_MFT2_OCU_OCSD54_OCSE5BUFE1        *((volatile unsigned char*)(0x4244245CUL))
#define bFM4_MFT2_OCU_OCSD54_OPBM4             *((volatile unsigned char*)(0x42442460UL))
#define bFM4_MFT2_OCU_OCSD54_OPBM5             *((volatile unsigned char*)(0x42442464UL))
#define bFM4_MFT2_OCU_OCSD54_OEBM4             *((volatile unsigned char*)(0x42442468UL))
#define bFM4_MFT2_OCU_OCSD54_OEBM5             *((volatile unsigned char*)(0x4244246CUL))
#define bFM4_MFT2_OCU_OCSD54_OFEX4             *((volatile unsigned char*)(0x42442470UL))
#define bFM4_MFT2_OCU_OCSD54_OFEX5             *((volatile unsigned char*)(0x42442474UL))
#define bFM4_MFT2_OCU_OCSC_MOD0                *((volatile unsigned char*)(0x424424A0UL))
#define bFM4_MFT2_OCU_OCSC_MOD1                *((volatile unsigned char*)(0x424424A4UL))
#define bFM4_MFT2_OCU_OCSC_MOD2                *((volatile unsigned char*)(0x424424A8UL))
#define bFM4_MFT2_OCU_OCSC_MOD3                *((volatile unsigned char*)(0x424424ACUL))
#define bFM4_MFT2_OCU_OCSC_MOD4                *((volatile unsigned char*)(0x424424B0UL))
#define bFM4_MFT2_OCU_OCSC_MOD5                *((volatile unsigned char*)(0x424424B4UL))
#define bFM4_MFT2_OCU_OCFS10_FSO00             *((volatile unsigned char*)(0x42442D00UL))
#define bFM4_MFT2_OCU_OCFS10_FSO01             *((volatile unsigned char*)(0x42442D04UL))
#define bFM4_MFT2_OCU_OCFS10_FSO02             *((volatile unsigned char*)(0x42442D08UL))
#define bFM4_MFT2_OCU_OCFS10_FSO03             *((volatile unsigned char*)(0x42442D0CUL))
#define bFM4_MFT2_OCU_OCFS10_FSO10             *((volatile unsigned char*)(0x42442D10UL))
#define bFM4_MFT2_OCU_OCFS10_FSO11             *((volatile unsigned char*)(0x42442D14UL))
#define bFM4_MFT2_OCU_OCFS10_FSO12             *((volatile unsigned char*)(0x42442D18UL))
#define bFM4_MFT2_OCU_OCFS10_FSO13             *((volatile unsigned char*)(0x42442D1CUL))
#define bFM4_MFT2_OCU_OCFS32_FSO00             *((volatile unsigned char*)(0x42442D20UL))
#define bFM4_MFT2_OCU_OCFS32_FSO01             *((volatile unsigned char*)(0x42442D24UL))
#define bFM4_MFT2_OCU_OCFS32_FSO02             *((volatile unsigned char*)(0x42442D28UL))
#define bFM4_MFT2_OCU_OCFS32_FSO03             *((volatile unsigned char*)(0x42442D2CUL))
#define bFM4_MFT2_OCU_OCFS32_FSO10             *((volatile unsigned char*)(0x42442D30UL))
#define bFM4_MFT2_OCU_OCFS32_FSO11             *((volatile unsigned char*)(0x42442D34UL))
#define bFM4_MFT2_OCU_OCFS32_FSO12             *((volatile unsigned char*)(0x42442D38UL))
#define bFM4_MFT2_OCU_OCFS32_FSO13             *((volatile unsigned char*)(0x42442D3CUL))
#define bFM4_MFT2_OCU_OCFS54_FSO00             *((volatile unsigned char*)(0x42442D40UL))
#define bFM4_MFT2_OCU_OCFS54_FSO01             *((volatile unsigned char*)(0x42442D44UL))
#define bFM4_MFT2_OCU_OCFS54_FSO02             *((volatile unsigned char*)(0x42442D48UL))
#define bFM4_MFT2_OCU_OCFS54_FSO03             *((volatile unsigned char*)(0x42442D4CUL))
#define bFM4_MFT2_OCU_OCFS54_FSO10             *((volatile unsigned char*)(0x42442D50UL))
#define bFM4_MFT2_OCU_OCFS54_FSO11             *((volatile unsigned char*)(0x42442D54UL))
#define bFM4_MFT2_OCU_OCFS54_FSO12             *((volatile unsigned char*)(0x42442D58UL))
#define bFM4_MFT2_OCU_OCFS54_FSO13             *((volatile unsigned char*)(0x42442D5CUL))

