MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C39H0AGV2000A/mcu.h
/* Multifunction Timer unit 2 Waveform Generator and Noise Canceler registers */
#define bFM4_MFT2_WFG_WFSA10_DCK0              *((volatile unsigned char*)(0x42443480UL))
#define bFM4_MFT2_WFG_WFSA10_DCK1              *((volatile unsigned char*)(0x42443484UL))
#define bFM4_MFT2_WFG_WFSA10_DCK2              *((volatile unsigned char*)(0x42443488UL))
#define bFM4_MFT2_WFG_WFSA10_GTEN0             *((volatile unsigned char*)(0x42443498UL))
#define bFM4_MFT2_WFG_WFSA10_GTEN1             *((volatile unsigned char*)(0x4244349CUL))
#define bFM4_MFT2_WFG_WFSA10_PSEL0             *((volatile unsigned char*)(0x424434A0UL))
#define bFM4_MFT2_WFG_WFSA10_PSEL1             *((volatile unsigned char*)(0x424434A4UL))
#define bFM4_MFT2_WFG_WFSA10_PGEN0             *((volatile unsigned char*)(0x424434A8UL))
#define bFM4_MFT2_WFG_WFSA10_PGEN1             *((volatile unsigned char*)(0x424434ACUL))
#define bFM4_MFT2_WFG_WFSA32_DCK0              *((volatile unsigned char*)(0x42443500UL))
#define bFM4_MFT2_WFG_WFSA32_DCK1              *((volatile unsigned char*)(0x42443504UL))
#define bFM4_MFT2_WFG_WFSA32_DCK2              *((volatile unsigned char*)(0x42443508UL))
#define bFM4_MFT2_WFG_WFSA32_GTEN0             *((volatile unsigned char*)(0x42443518UL))
#define bFM4_MFT2_WFG_WFSA32_GTEN1             *((volatile unsigned char*)(0x4244351CUL))
#define bFM4_MFT2_WFG_WFSA32_PSEL0             *((volatile unsigned char*)(0x42443520UL))
#define bFM4_MFT2_WFG_WFSA32_PSEL1             *((volatile unsigned char*)(0x42443524UL))
#define bFM4_MFT2_WFG_WFSA32_PGEN0             *((volatile unsigned char*)(0x42443528UL))
#define bFM4_MFT2_WFG_WFSA32_PGEN1             *((volatile unsigned char*)(0x4244352CUL))
#define bFM4_MFT2_WFG_WFSA54_DCK0              *((volatile unsigned char*)(0x42443580UL))
#define bFM4_MFT2_WFG_WFSA54_DCK1              *((volatile unsigned char*)(0x42443584UL))
#define bFM4_MFT2_WFG_WFSA54_DCK2              *((volatile unsigned char*)(0x42443588UL))
#define bFM4_MFT2_WFG_WFSA54_GTEN0             *((volatile unsigned char*)(0x42443598UL))
#define bFM4_MFT2_WFG_WFSA54_GTEN1             *((volatile unsigned char*)(0x4244359CUL))
#define bFM4_MFT2_WFG_WFSA54_PSEL0             *((volatile unsigned char*)(0x424435A0UL))
#define bFM4_MFT2_WFG_WFSA54_PSEL1             *((volatile unsigned char*)(0x424435A4UL))
#define bFM4_MFT2_WFG_WFSA54_PGEN0             *((volatile unsigned char*)(0x424435A8UL))
#define bFM4_MFT2_WFG_WFSA54_PGEN1             *((volatile unsigned char*)(0x424435ACUL))
#define bFM4_MFT2_WFG_WFIR_DTIFA               *((volatile unsigned char*)(0x42443600UL))
#define bFM4_MFT2_WFG_WFIR_DTICA               *((volatile unsigned char*)(0x42443604UL))
#define bFM4_MFT2_WFG_WFIR_DTIFB               *((volatile unsigned char*)(0x42443608UL))
#define bFM4_MFT2_WFG_WFIR_DTICB               *((volatile unsigned char*)(0x4244360CUL))
#define bFM4_MFT2_WFG_WFIR_TMIF10              *((volatile unsigned char*)(0x42443610UL))
#define bFM4_MFT2_WFG_WFIR_TMIC10              *((volatile unsigned char*)(0x42443614UL))
#define bFM4_MFT2_WFG_WFIR_TMIE10              *((volatile unsigned char*)(0x42443618UL))
#define bFM4_MFT2_WFG_WFIR_TMIS10              *((volatile unsigned char*)(0x4244361CUL))
#define bFM4_MFT2_WFG_WFIR_TMIF32              *((volatile unsigned char*)(0x42443620UL))
#define bFM4_MFT2_WFG_WFIR_TMIC32              *((volatile unsigned char*)(0x42443624UL))
#define bFM4_MFT2_WFG_WFIR_TMIE32              *((volatile unsigned char*)(0x42443628UL))
#define bFM4_MFT2_WFG_WFIR_TMIS32              *((volatile unsigned char*)(0x4244362CUL))
#define bFM4_MFT2_WFG_WFIR_TMIF54              *((volatile unsigned char*)(0x42443630UL))
#define bFM4_MFT2_WFG_WFIR_TMIC54              *((volatile unsigned char*)(0x42443634UL))
#define bFM4_MFT2_WFG_WFIR_TMIE54              *((volatile unsigned char*)(0x42443638UL))
#define bFM4_MFT2_WFG_WFIR_TMIS54              *((volatile unsigned char*)(0x4244363CUL))
#define bFM4_MFT2_WFG_NZCL_DTIEA               *((volatile unsigned char*)(0x42443680UL))
#define bFM4_MFT2_WFG_NZCL_NWS0                *((volatile unsigned char*)(0x42443684UL))
#define bFM4_MFT2_WFG_NZCL_NWS1                *((volatile unsigned char*)(0x42443688UL))
#define bFM4_MFT2_WFG_NZCL_NWS2                *((volatile unsigned char*)(0x4244368CUL))
#define bFM4_MFT2_WFG_NZCL_SDTI                *((volatile unsigned char*)(0x42443690UL))
#define bFM4_MFT2_WFG_NZCL_DTIEB               *((volatile unsigned char*)(0x42443694UL))
#define bFM4_MFT2_WFG_NZCL_DHOLD               *((volatile unsigned char*)(0x4244369CUL))
#define bFM4_MFT2_WFG_NZCL_DIMA                *((volatile unsigned char*)(0x424436A0UL))
#define bFM4_MFT2_WFG_NZCL_DIMB                *((volatile unsigned char*)(0x424436A4UL))
#define bFM4_MFT2_WFG_NZCL_WIM10               *((volatile unsigned char*)(0x424436B0UL))
#define bFM4_MFT2_WFG_NZCL_WIM32               *((volatile unsigned char*)(0x424436B4UL))
#define bFM4_MFT2_WFG_NZCL_WIM54               *((volatile unsigned char*)(0x424436B8UL))

/* Multifunction Timer unit 2 Input Capture Unit registers */
#define bFM4_MFT2_ICU_ICFS10_FSI00             *((volatile unsigned char*)(0x42442D80UL))
#define bFM4_MFT2_ICU_ICFS10_FSI01             *((volatile unsigned char*)(0x42442D84UL))
#define bFM4_MFT2_ICU_ICFS10_FSI02             *((volatile unsigned char*)(0x42442D88UL))
#define bFM4_MFT2_ICU_ICFS10_FSI03             *((volatile unsigned char*)(0x42442D8CUL))
#define bFM4_MFT2_ICU_ICFS10_FSI10             *((volatile unsigned char*)(0x42442D90UL))
#define bFM4_MFT2_ICU_ICFS10_FSI11             *((volatile unsigned char*)(0x42442D94UL))
#define bFM4_MFT2_ICU_ICFS10_FSI12             *((volatile unsigned char*)(0x42442D98UL))
#define bFM4_MFT2_ICU_ICFS10_FSI13             *((volatile unsigned char*)(0x42442D9CUL))
#define bFM4_MFT2_ICU_ICFS32_FSI00             *((volatile unsigned char*)(0x42442DA0UL))
#define bFM4_MFT2_ICU_ICFS32_FSI01             *((volatile unsigned char*)(0x42442DA4UL))
#define bFM4_MFT2_ICU_ICFS32_FSI02             *((volatile unsigned char*)(0x42442DA8UL))
#define bFM4_MFT2_ICU_ICFS32_FSI03             *((volatile unsigned char*)(0x42442DACUL))
#define bFM4_MFT2_ICU_ICFS32_FSI10             *((volatile unsigned char*)(0x42442DB0UL))
#define bFM4_MFT2_ICU_ICFS32_FSI11             *((volatile unsigned char*)(0x42442DB4UL))
#define bFM4_MFT2_ICU_ICFS32_FSI12             *((volatile unsigned char*)(0x42442DB8UL))
#define bFM4_MFT2_ICU_ICFS32_FSI13             *((volatile unsigned char*)(0x42442DBCUL))
#define bFM4_MFT2_ICU_ICSA10_EG00              *((volatile unsigned char*)(0x42443080UL))
#define bFM4_MFT2_ICU_ICSA10_EG01              *((volatile unsigned char*)(0x42443084UL))
#define bFM4_MFT2_ICU_ICSA10_EG10              *((volatile unsigned char*)(0x42443088UL))
#define bFM4_MFT2_ICU_ICSA10_EG11              *((volatile unsigned char*)(0x4244308CUL))
#define bFM4_MFT2_ICU_ICSA10_ICE0              *((volatile unsigned char*)(0x42443090UL))
#define bFM4_MFT2_ICU_ICSA10_ICE1              *((volatile unsigned char*)(0x42443094UL))
#define bFM4_MFT2_ICU_ICSA10_ICP0              *((volatile unsigned char*)(0x42443098UL))
#define bFM4_MFT2_ICU_ICSA10_ICP1              *((volatile unsigned char*)(0x4244309CUL))
#define bFM4_MFT2_ICU_ICSB10_IEI0              *((volatile unsigned char*)(0x424430A0UL))
#define bFM4_MFT2_ICU_ICSB10_IEI1              *((volatile unsigned char*)(0x424430A4UL))
#define bFM4_MFT2_ICU_ICSA32_EG00              *((volatile unsigned char*)(0x42443100UL))
#define bFM4_MFT2_ICU_ICSA32_EG01              *((volatile unsigned char*)(0x42443104UL))
#define bFM4_MFT2_ICU_ICSA32_EG10              *((volatile unsigned char*)(0x42443108UL))
#define bFM4_MFT2_ICU_ICSA32_EG11              *((volatile unsigned char*)(0x4244310CUL))
#define bFM4_MFT2_ICU_ICSA32_ICE0              *((volatile unsigned char*)(0x42443110UL))
#define bFM4_MFT2_ICU_ICSA32_ICE1              *((volatile unsigned char*)(0x42443114UL))
#define bFM4_MFT2_ICU_ICSA32_ICP0              *((volatile unsigned char*)(0x42443118UL))
#define bFM4_MFT2_ICU_ICSA32_ICP1              *((volatile unsigned char*)(0x4244311CUL))
#define bFM4_MFT2_ICU_ICSB32_IEI0              *((volatile unsigned char*)(0x42443120UL))
#define bFM4_MFT2_ICU_ICSB32_IEI1              *((volatile unsigned char*)(0x42443124UL))

