MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C39H0AGV2000A/mcu.h
/* Base Timer 1 RT registers */
#define bFM4_BT1_RT_TMCR_STRG                  *((volatile unsigned char*)(0x424A0980UL))
#define bFM4_BT1_RT_TMCR_CTEN                  *((volatile unsigned char*)(0x424A0984UL))
#define bFM4_BT1_RT_TMCR_MDSE                  *((volatile unsigned char*)(0x424A0988UL))
#define bFM4_BT1_RT_TMCR_OSEL                  *((volatile unsigned char*)(0x424A098CUL))
#define bFM4_BT1_RT_TMCR_FMD0                  *((volatile unsigned char*)(0x424A0990UL))
#define bFM4_BT1_RT_TMCR_FMD1                  *((volatile unsigned char*)(0x424A0994UL))
#define bFM4_BT1_RT_TMCR_FMD2                  *((volatile unsigned char*)(0x424A0998UL))
#define bFM4_BT1_RT_TMCR_T32                   *((volatile unsigned char*)(0x424A099CUL))
#define bFM4_BT1_RT_TMCR_EGS0                  *((volatile unsigned char*)(0x424A09A0UL))
#define bFM4_BT1_RT_TMCR_EGS1                  *((volatile unsigned char*)(0x424A09A4UL))
#define bFM4_BT1_RT_TMCR_CKS0                  *((volatile unsigned char*)(0x424A09B0UL))
#define bFM4_BT1_RT_TMCR_CKS1                  *((volatile unsigned char*)(0x424A09B4UL))
#define bFM4_BT1_RT_TMCR_CKS2                  *((volatile unsigned char*)(0x424A09B8UL))
#define bFM4_BT1_RT_STC_UDIR                   *((volatile unsigned char*)(0x424A0A00UL))
#define bFM4_BT1_RT_STC_TGIR                   *((volatile unsigned char*)(0x424A0A08UL))
#define bFM4_BT1_RT_STC_UDIE                   *((volatile unsigned char*)(0x424A0A10UL))
#define bFM4_BT1_RT_STC_TGIE                   *((volatile unsigned char*)(0x424A0A18UL))
#define bFM4_BT1_RT_TMCR2_CKS3                 *((volatile unsigned char*)(0x424A0A20UL))

/* Base Timer 1 PWC registers */
#define bFM4_BT1_PWC_TMCR_CTEN                 *((volatile unsigned char*)(0x424A0984UL))
#define bFM4_BT1_PWC_TMCR_MDSE                 *((volatile unsigned char*)(0x424A0988UL))
#define bFM4_BT1_PWC_TMCR_FMD0                 *((volatile unsigned char*)(0x424A0990UL))
#define bFM4_BT1_PWC_TMCR_FMD1                 *((volatile unsigned char*)(0x424A0994UL))
#define bFM4_BT1_PWC_TMCR_FMD2                 *((volatile unsigned char*)(0x424A0998UL))
#define bFM4_BT1_PWC_TMCR_T32                  *((volatile unsigned char*)(0x424A099CUL))
#define bFM4_BT1_PWC_TMCR_EGS0                 *((volatile unsigned char*)(0x424A09A0UL))
#define bFM4_BT1_PWC_TMCR_EGS1                 *((volatile unsigned char*)(0x424A09A4UL))
#define bFM4_BT1_PWC_TMCR_EGS2                 *((volatile unsigned char*)(0x424A09A8UL))
#define bFM4_BT1_PWC_TMCR_CKS0                 *((volatile unsigned char*)(0x424A09B0UL))
#define bFM4_BT1_PWC_TMCR_CKS1                 *((volatile unsigned char*)(0x424A09B4UL))
#define bFM4_BT1_PWC_TMCR_CKS2                 *((volatile unsigned char*)(0x424A09B8UL))
#define bFM4_BT1_PWC_STC_OVIR                  *((volatile unsigned char*)(0x424A0A00UL))
#define bFM4_BT1_PWC_STC_EDIR                  *((volatile unsigned char*)(0x424A0A08UL))
#define bFM4_BT1_PWC_STC_OVIE                  *((volatile unsigned char*)(0x424A0A10UL))
#define bFM4_BT1_PWC_STC_EDIE                  *((volatile unsigned char*)(0x424A0A18UL))
#define bFM4_BT1_PWC_STC_ERR                   *((volatile unsigned char*)(0x424A0A1CUL))
#define bFM4_BT1_PWC_TMCR2_CKS3                *((volatile unsigned char*)(0x424A0A20UL))

/* Base Timer 2 PPG registers */
#define bFM4_BT2_PPG_TMCR_STRG                 *((volatile unsigned char*)(0x424A1180UL))
#define bFM4_BT2_PPG_TMCR_CTEN                 *((volatile unsigned char*)(0x424A1184UL))
#define bFM4_BT2_PPG_TMCR_MDSE                 *((volatile unsigned char*)(0x424A1188UL))
#define bFM4_BT2_PPG_TMCR_OSEL                 *((volatile unsigned char*)(0x424A118CUL))
#define bFM4_BT2_PPG_TMCR_FMD0                 *((volatile unsigned char*)(0x424A1190UL))
#define bFM4_BT2_PPG_TMCR_FMD1                 *((volatile unsigned char*)(0x424A1194UL))
#define bFM4_BT2_PPG_TMCR_FMD2                 *((volatile unsigned char*)(0x424A1198UL))
#define bFM4_BT2_PPG_TMCR_EGS0                 *((volatile unsigned char*)(0x424A11A0UL))
#define bFM4_BT2_PPG_TMCR_EGS1                 *((volatile unsigned char*)(0x424A11A4UL))
#define bFM4_BT2_PPG_TMCR_PMSK                 *((volatile unsigned char*)(0x424A11A8UL))
#define bFM4_BT2_PPG_TMCR_RTGEN                *((volatile unsigned char*)(0x424A11ACUL))
#define bFM4_BT2_PPG_TMCR_CKS0                 *((volatile unsigned char*)(0x424A11B0UL))
#define bFM4_BT2_PPG_TMCR_CKS1                 *((volatile unsigned char*)(0x424A11B4UL))
#define bFM4_BT2_PPG_TMCR_CKS2                 *((volatile unsigned char*)(0x424A11B8UL))
#define bFM4_BT2_PPG_STC_UDIR                  *((volatile unsigned char*)(0x424A1200UL))
#define bFM4_BT2_PPG_STC_TGIR                  *((volatile unsigned char*)(0x424A1208UL))
#define bFM4_BT2_PPG_STC_UDIE                  *((volatile unsigned char*)(0x424A1210UL))
#define bFM4_BT2_PPG_STC_TGIE                  *((volatile unsigned char*)(0x424A1218UL))
#define bFM4_BT2_PPG_TMCR2_CKS3                *((volatile unsigned char*)(0x424A1220UL))

/* Base Timer 2 PWM registers */
#define bFM4_BT2_PWM_TMCR_STRG                 *((volatile unsigned char*)(0x424A1180UL))
#define bFM4_BT2_PWM_TMCR_CTEN                 *((volatile unsigned char*)(0x424A1184UL))
#define bFM4_BT2_PWM_TMCR_MDSE                 *((volatile unsigned char*)(0x424A1188UL))
#define bFM4_BT2_PWM_TMCR_OSEL                 *((volatile unsigned char*)(0x424A118CUL))
#define bFM4_BT2_PWM_TMCR_FMD0                 *((volatile unsigned char*)(0x424A1190UL))
#define bFM4_BT2_PWM_TMCR_FMD1                 *((volatile unsigned char*)(0x424A1194UL))
#define bFM4_BT2_PWM_TMCR_FMD2                 *((volatile unsigned char*)(0x424A1198UL))
#define bFM4_BT2_PWM_TMCR_EGS0                 *((volatile unsigned char*)(0x424A11A0UL))
#define bFM4_BT2_PWM_TMCR_EGS1                 *((volatile unsigned char*)(0x424A11A4UL))
#define bFM4_BT2_PWM_TMCR_PMSK                 *((volatile unsigned char*)(0x424A11A8UL))
#define bFM4_BT2_PWM_TMCR_RTGEN                *((volatile unsigned char*)(0x424A11ACUL))
#define bFM4_BT2_PWM_TMCR_CKS0                 *((volatile unsigned char*)(0x424A11B0UL))
#define bFM4_BT2_PWM_TMCR_CKS1                 *((volatile unsigned char*)(0x424A11B4UL))
#define bFM4_BT2_PWM_TMCR_CKS2                 *((volatile unsigned char*)(0x424A11B8UL))
#define bFM4_BT2_PWM_STC_UDIR                  *((volatile unsigned char*)(0x424A1200UL))
#define bFM4_BT2_PWM_STC_DTIR                  *((volatile unsigned char*)(0x424A1204UL))
#define bFM4_BT2_PWM_STC_TGIR                  *((volatile unsigned char*)(0x424A1208UL))
#define bFM4_BT2_PWM_STC_UDIE                  *((volatile unsigned char*)(0x424A1210UL))
#define bFM4_BT2_PWM_STC_DTIE                  *((volatile unsigned char*)(0x424A1214UL))
#define bFM4_BT2_PWM_STC_TGIE                  *((volatile unsigned char*)(0x424A1218UL))
#define bFM4_BT2_PWM_TMCR2_CKS3                *((volatile unsigned char*)(0x424A1220UL))

