MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C39H0AGV2000A/mcu.h
/* Base Timer 8 PWM registers */
#define bFM4_BT8_PWM_TMCR_STRG                 *((volatile unsigned char*)(0x424A8180UL))
#define bFM4_BT8_PWM_TMCR_CTEN                 *((volatile unsigned char*)(0x424A8184UL))
#define bFM4_BT8_PWM_TMCR_MDSE                 *((volatile unsigned char*)(0x424A8188UL))
#define bFM4_BT8_PWM_TMCR_OSEL                 *((volatile unsigned char*)(0x424A818CUL))
#define bFM4_BT8_PWM_TMCR_EGS0                 *((volatile unsigned char*)(0x424A81A0UL))
#define bFM4_BT8_PWM_TMCR_EGS1                 *((volatile unsigned char*)(0x424A81A4UL))
#define bFM4_BT8_PWM_TMCR_PMSK                 *((volatile unsigned char*)(0x424A81A8UL))
#define bFM4_BT8_PWM_TMCR_RTGEN                *((volatile unsigned char*)(0x424A81ACUL))
#define bFM4_BT8_PWM_TMCR_CKS0                 *((volatile unsigned char*)(0x424A81B0UL))
#define bFM4_BT8_PWM_TMCR_CKS1                 *((volatile unsigned char*)(0x424A81B4UL))
#define bFM4_BT8_PWM_TMCR_CKS2                 *((volatile unsigned char*)(0x424A81B8UL))
#define bFM4_BT8_PWM_STC_UDIR                  *((volatile unsigned char*)(0x424A8200UL))
#define bFM4_BT8_PWM_STC_DTIR                  *((volatile unsigned char*)(0x424A8204UL))
#define bFM4_BT8_PWM_STC_TGIR                  *((volatile unsigned char*)(0x424A8208UL))
#define bFM4_BT8_PWM_STC_UDIE                  *((volatile unsigned char*)(0x424A8210UL))
#define bFM4_BT8_PWM_STC_DTIE                  *((volatile unsigned char*)(0x424A8214UL))
#define bFM4_BT8_PWM_STC_TGIE                  *((volatile unsigned char*)(0x424A8218UL))
#define bFM4_BT8_PWM_TMCR2_CKS3                *((volatile unsigned char*)(0x424A8220UL))

/* Base Timer 8 RT registers */
#define bFM4_BT8_RT_TMCR_STRG                  *((volatile unsigned char*)(0x424A8180UL))
#define bFM4_BT8_RT_TMCR_CTEN                  *((volatile unsigned char*)(0x424A8184UL))
#define bFM4_BT8_RT_TMCR_MDSE                  *((volatile unsigned char*)(0x424A8188UL))
#define bFM4_BT8_RT_TMCR_OSEL                  *((volatile unsigned char*)(0x424A818CUL))
#define bFM4_BT8_RT_TMCR_T32                   *((volatile unsigned char*)(0x424A819CUL))
#define bFM4_BT8_RT_TMCR_EGS0                  *((volatile unsigned char*)(0x424A81A0UL))
#define bFM4_BT8_RT_TMCR_EGS1                  *((volatile unsigned char*)(0x424A81A4UL))
#define bFM4_BT8_RT_TMCR_CKS0                  *((volatile unsigned char*)(0x424A81B0UL))
#define bFM4_BT8_RT_TMCR_CKS1                  *((volatile unsigned char*)(0x424A81B4UL))
#define bFM4_BT8_RT_TMCR_CKS2                  *((volatile unsigned char*)(0x424A81B8UL))
#define bFM4_BT8_RT_STC_UDIR                   *((volatile unsigned char*)(0x424A8200UL))
#define bFM4_BT8_RT_STC_TGIR                   *((volatile unsigned char*)(0x424A8208UL))
#define bFM4_BT8_RT_STC_UDIE                   *((volatile unsigned char*)(0x424A8210UL))
#define bFM4_BT8_RT_STC_TGIE                   *((volatile unsigned char*)(0x424A8218UL))
#define bFM4_BT8_RT_TMCR2_CKS3                 *((volatile unsigned char*)(0x424A8220UL))

/* Base Timer 8 PWC registers */
#define bFM4_BT8_PWC_TMCR_CTEN                 *((volatile unsigned char*)(0x424A8184UL))
#define bFM4_BT8_PWC_TMCR_MDSE                 *((volatile unsigned char*)(0x424A8188UL))
#define bFM4_BT8_PWC_TMCR_T32                  *((volatile unsigned char*)(0x424A819CUL))
#define bFM4_BT8_PWC_TMCR_EGS0                 *((volatile unsigned char*)(0x424A81A0UL))
#define bFM4_BT8_PWC_TMCR_EGS1                 *((volatile unsigned char*)(0x424A81A4UL))
#define bFM4_BT8_PWC_TMCR_EGS2                 *((volatile unsigned char*)(0x424A81A8UL))
#define bFM4_BT8_PWC_TMCR_CKS0                 *((volatile unsigned char*)(0x424A81B0UL))
#define bFM4_BT8_PWC_TMCR_CKS1                 *((volatile unsigned char*)(0x424A81B4UL))
#define bFM4_BT8_PWC_TMCR_CKS2                 *((volatile unsigned char*)(0x424A81B8UL))
#define bFM4_BT8_PWC_STC_OVIR                  *((volatile unsigned char*)(0x424A8200UL))
#define bFM4_BT8_PWC_STC_EDIR                  *((volatile unsigned char*)(0x424A8208UL))
#define bFM4_BT8_PWC_STC_OVIE                  *((volatile unsigned char*)(0x424A8210UL))
#define bFM4_BT8_PWC_STC_EDIE                  *((volatile unsigned char*)(0x424A8218UL))
#define bFM4_BT8_PWC_STC_ERR                   *((volatile unsigned char*)(0x424A821CUL))
#define bFM4_BT8_PWC_TMCR2_CKS3                *((volatile unsigned char*)(0x424A8220UL))

/* Base Timer 9 PPG registers */
#define bFM4_BT9_PPG_TMCR_STRG                 *((volatile unsigned char*)(0x424A8980UL))
#define bFM4_BT9_PPG_TMCR_CTEN                 *((volatile unsigned char*)(0x424A8984UL))
#define bFM4_BT9_PPG_TMCR_MDSE                 *((volatile unsigned char*)(0x424A8988UL))
#define bFM4_BT9_PPG_TMCR_OSEL                 *((volatile unsigned char*)(0x424A898CUL))
#define bFM4_BT9_PPG_TMCR_EGS0                 *((volatile unsigned char*)(0x424A89A0UL))
#define bFM4_BT9_PPG_TMCR_EGS1                 *((volatile unsigned char*)(0x424A89A4UL))
#define bFM4_BT9_PPG_TMCR_PMSK                 *((volatile unsigned char*)(0x424A89A8UL))
#define bFM4_BT9_PPG_TMCR_RTGEN                *((volatile unsigned char*)(0x424A89ACUL))
#define bFM4_BT9_PPG_TMCR_CKS0                 *((volatile unsigned char*)(0x424A89B0UL))
#define bFM4_BT9_PPG_TMCR_CKS1                 *((volatile unsigned char*)(0x424A89B4UL))
#define bFM4_BT9_PPG_TMCR_CKS2                 *((volatile unsigned char*)(0x424A89B8UL))
#define bFM4_BT9_PPG_STC_UDIR                  *((volatile unsigned char*)(0x424A8A00UL))
#define bFM4_BT9_PPG_STC_TGIR                  *((volatile unsigned char*)(0x424A8A08UL))
#define bFM4_BT9_PPG_STC_UDIE                  *((volatile unsigned char*)(0x424A8A10UL))
#define bFM4_BT9_PPG_STC_TGIE                  *((volatile unsigned char*)(0x424A8A18UL))
#define bFM4_BT9_PPG_TMCR2_CKS3                *((volatile unsigned char*)(0x424A8A20UL))

/* Base Timer 9 PWM registers */
#define bFM4_BT9_PWM_TMCR_STRG                 *((volatile unsigned char*)(0x424A8980UL))
#define bFM4_BT9_PWM_TMCR_CTEN                 *((volatile unsigned char*)(0x424A8984UL))
#define bFM4_BT9_PWM_TMCR_MDSE                 *((volatile unsigned char*)(0x424A8988UL))
#define bFM4_BT9_PWM_TMCR_OSEL                 *((volatile unsigned char*)(0x424A898CUL))
#define bFM4_BT9_PWM_TMCR_EGS0                 *((volatile unsigned char*)(0x424A89A0UL))
#define bFM4_BT9_PWM_TMCR_EGS1                 *((volatile unsigned char*)(0x424A89A4UL))
#define bFM4_BT9_PWM_TMCR_PMSK                 *((volatile unsigned char*)(0x424A89A8UL))
#define bFM4_BT9_PWM_TMCR_RTGEN                *((volatile unsigned char*)(0x424A89ACUL))
#define bFM4_BT9_PWM_TMCR_CKS0                 *((volatile unsigned char*)(0x424A89B0UL))
#define bFM4_BT9_PWM_TMCR_CKS1                 *((volatile unsigned char*)(0x424A89B4UL))
#define bFM4_BT9_PWM_TMCR_CKS2                 *((volatile unsigned char*)(0x424A89B8UL))
#define bFM4_BT9_PWM_STC_UDIR                  *((volatile unsigned char*)(0x424A8A00UL))
#define bFM4_BT9_PWM_STC_DTIR                  *((volatile unsigned char*)(0x424A8A04UL))
#define bFM4_BT9_PWM_STC_TGIR                  *((volatile unsigned char*)(0x424A8A08UL))
#define bFM4_BT9_PWM_STC_UDIE                  *((volatile unsigned char*)(0x424A8A10UL))
#define bFM4_BT9_PWM_STC_DTIE                  *((volatile unsigned char*)(0x424A8A14UL))
#define bFM4_BT9_PWM_STC_TGIE                  *((volatile unsigned char*)(0x424A8A18UL))
#define bFM4_BT9_PWM_TMCR2_CKS3                *((volatile unsigned char*)(0x424A8A20UL))

/* Base Timer 9 RT registers */
#define bFM4_BT9_RT_TMCR_STRG                  *((volatile unsigned char*)(0x424A8980UL))
#define bFM4_BT9_RT_TMCR_CTEN                  *((volatile unsigned char*)(0x424A8984UL))
#define bFM4_BT9_RT_TMCR_MDSE                  *((volatile unsigned char*)(0x424A8988UL))
#define bFM4_BT9_RT_TMCR_OSEL                  *((volatile unsigned char*)(0x424A898CUL))
#define bFM4_BT9_RT_TMCR_T32                   *((volatile unsigned char*)(0x424A899CUL))
#define bFM4_BT9_RT_TMCR_EGS0                  *((volatile unsigned char*)(0x424A89A0UL))
#define bFM4_BT9_RT_TMCR_EGS1                  *((volatile unsigned char*)(0x424A89A4UL))
#define bFM4_BT9_RT_TMCR_CKS0                  *((volatile unsigned char*)(0x424A89B0UL))
#define bFM4_BT9_RT_TMCR_CKS1                  *((volatile unsigned char*)(0x424A89B4UL))
#define bFM4_BT9_RT_TMCR_CKS2                  *((volatile unsigned char*)(0x424A89B8UL))
#define bFM4_BT9_RT_STC_UDIR                   *((volatile unsigned char*)(0x424A8A00UL))
#define bFM4_BT9_RT_STC_TGIR                   *((volatile unsigned char*)(0x424A8A08UL))
#define bFM4_BT9_RT_STC_UDIE                   *((volatile unsigned char*)(0x424A8A10UL))
#define bFM4_BT9_RT_STC_TGIE                   *((volatile unsigned char*)(0x424A8A18UL))
#define bFM4_BT9_RT_TMCR2_CKS3                 *((volatile unsigned char*)(0x424A8A20UL))

/* Base Timer 9 PWC registers */
#define bFM4_BT9_PWC_TMCR_CTEN                 *((volatile unsigned char*)(0x424A8984UL))
#define bFM4_BT9_PWC_TMCR_MDSE                 *((volatile unsigned char*)(0x424A8988UL))
#define bFM4_BT9_PWC_TMCR_T32                  *((volatile unsigned char*)(0x424A899CUL))
#define bFM4_BT9_PWC_TMCR_EGS0                 *((volatile unsigned char*)(0x424A89A0UL))
#define bFM4_BT9_PWC_TMCR_EGS1                 *((volatile unsigned char*)(0x424A89A4UL))
#define bFM4_BT9_PWC_TMCR_EGS2                 *((volatile unsigned char*)(0x424A89A8UL))
#define bFM4_BT9_PWC_TMCR_CKS0                 *((volatile unsigned char*)(0x424A89B0UL))
#define bFM4_BT9_PWC_TMCR_CKS1                 *((volatile unsigned char*)(0x424A89B4UL))
#define bFM4_BT9_PWC_TMCR_CKS2                 *((volatile unsigned char*)(0x424A89B8UL))
#define bFM4_BT9_PWC_STC_OVIR                  *((volatile unsigned char*)(0x424A8A00UL))
#define bFM4_BT9_PWC_STC_EDIR                  *((volatile unsigned char*)(0x424A8A08UL))
#define bFM4_BT9_PWC_STC_OVIE                  *((volatile unsigned char*)(0x424A8A10UL))
#define bFM4_BT9_PWC_STC_EDIE                  *((volatile unsigned char*)(0x424A8A18UL))
#define bFM4_BT9_PWC_STC_ERR                   *((volatile unsigned char*)(0x424A8A1CUL))
#define bFM4_BT9_PWC_TMCR2_CKS3                *((volatile unsigned char*)(0x424A8A20UL))

/* Base Timer 10 PPG registers */
#define bFM4_BT10_PPG_TMCR_STRG                *((volatile unsigned char*)(0x424A9180UL))
#define bFM4_BT10_PPG_TMCR_CTEN                *((volatile unsigned char*)(0x424A9184UL))
#define bFM4_BT10_PPG_TMCR_MDSE                *((volatile unsigned char*)(0x424A9188UL))
#define bFM4_BT10_PPG_TMCR_OSEL                *((volatile unsigned char*)(0x424A918CUL))
#define bFM4_BT10_PPG_TMCR_EGS0                *((volatile unsigned char*)(0x424A91A0UL))
#define bFM4_BT10_PPG_TMCR_EGS1                *((volatile unsigned char*)(0x424A91A4UL))
#define bFM4_BT10_PPG_TMCR_PMSK                *((volatile unsigned char*)(0x424A91A8UL))
#define bFM4_BT10_PPG_TMCR_RTGEN               *((volatile unsigned char*)(0x424A91ACUL))
#define bFM4_BT10_PPG_TMCR_CKS0                *((volatile unsigned char*)(0x424A91B0UL))
#define bFM4_BT10_PPG_TMCR_CKS1                *((volatile unsigned char*)(0x424A91B4UL))
#define bFM4_BT10_PPG_TMCR_CKS2                *((volatile unsigned char*)(0x424A91B8UL))
#define bFM4_BT10_PPG_STC_UDIR                 *((volatile unsigned char*)(0x424A9200UL))
#define bFM4_BT10_PPG_STC_TGIR                 *((volatile unsigned char*)(0x424A9208UL))
#define bFM4_BT10_PPG_STC_UDIE                 *((volatile unsigned char*)(0x424A9210UL))
#define bFM4_BT10_PPG_STC_TGIE                 *((volatile unsigned char*)(0x424A9218UL))
#define bFM4_BT10_PPG_TMCR2_CKS3               *((volatile unsigned char*)(0x424A9220UL))

