MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C39H0AGV2000A/mcu.h
/* Quad position and revolution counter channel 2 registers */
#define bFM4_QPRC2_QICR_QPCMIE                 *((volatile unsigned char*)(0x424C1280UL))
#define bFM4_QPRC2_QICR_QPCMF                  *((volatile unsigned char*)(0x424C1284UL))
#define bFM4_QPRC2_QICR_QPRCMIE                *((volatile unsigned char*)(0x424C1288UL))
#define bFM4_QPRC2_QICR_QPRCMF                 *((volatile unsigned char*)(0x424C128CUL))
#define bFM4_QPRC2_QICR_OUZIE                  *((volatile unsigned char*)(0x424C1290UL))
#define bFM4_QPRC2_QICR_UFDF                   *((volatile unsigned char*)(0x424C1294UL))
#define bFM4_QPRC2_QICR_OFDF                   *((volatile unsigned char*)(0x424C1298UL))
#define bFM4_QPRC2_QICR_ZIIF                   *((volatile unsigned char*)(0x424C129CUL))
#define bFM4_QPRC2_QICR_CDCIE                  *((volatile unsigned char*)(0x424C12A0UL))
#define bFM4_QPRC2_QICR_CDCF                   *((volatile unsigned char*)(0x424C12A4UL))
#define bFM4_QPRC2_QICR_DIRPC                  *((volatile unsigned char*)(0x424C12A8UL))
#define bFM4_QPRC2_QICR_DIROU                  *((volatile unsigned char*)(0x424C12ACUL))
#define bFM4_QPRC2_QICR_QPCNRCMIE              *((volatile unsigned char*)(0x424C12B0UL))
#define bFM4_QPRC2_QICR_QPCNRCMF               *((volatile unsigned char*)(0x424C12B4UL))
#define bFM4_QPRC2_QICRL_QPCMIE                *((volatile unsigned char*)(0x424C1280UL))
#define bFM4_QPRC2_QICRL_QPCMF                 *((volatile unsigned char*)(0x424C1284UL))
#define bFM4_QPRC2_QICRL_QPRCMIE               *((volatile unsigned char*)(0x424C1288UL))
#define bFM4_QPRC2_QICRL_QPRCMF                *((volatile unsigned char*)(0x424C128CUL))
#define bFM4_QPRC2_QICRL_OUZIE                 *((volatile unsigned char*)(0x424C1290UL))
#define bFM4_QPRC2_QICRL_UFDF                  *((volatile unsigned char*)(0x424C1294UL))
#define bFM4_QPRC2_QICRL_OFDF                  *((volatile unsigned char*)(0x424C1298UL))
#define bFM4_QPRC2_QICRL_ZIIF                  *((volatile unsigned char*)(0x424C129CUL))
#define bFM4_QPRC2_QICRH_CDCIE                 *((volatile unsigned char*)(0x424C12A0UL))
#define bFM4_QPRC2_QICRH_CDCF                  *((volatile unsigned char*)(0x424C12A4UL))
#define bFM4_QPRC2_QICRH_DIRPC                 *((volatile unsigned char*)(0x424C12A8UL))
#define bFM4_QPRC2_QICRH_DIROU                 *((volatile unsigned char*)(0x424C12ACUL))
#define bFM4_QPRC2_QICRH_QPCNRCMIE             *((volatile unsigned char*)(0x424C12B0UL))
#define bFM4_QPRC2_QICRH_QPCNRCMF              *((volatile unsigned char*)(0x424C12B4UL))
#define bFM4_QPRC2_QCR_PCM0                    *((volatile unsigned char*)(0x424C1300UL))
#define bFM4_QPRC2_QCR_PCM1                    *((volatile unsigned char*)(0x424C1304UL))
#define bFM4_QPRC2_QCR_RCM0                    *((volatile unsigned char*)(0x424C1308UL))
#define bFM4_QPRC2_QCR_RCM1                    *((volatile unsigned char*)(0x424C130CUL))
#define bFM4_QPRC2_QCR_PSTP                    *((volatile unsigned char*)(0x424C1310UL))
#define bFM4_QPRC2_QCR_CGSC                    *((volatile unsigned char*)(0x424C1314UL))
#define bFM4_QPRC2_QCR_RSEL                    *((volatile unsigned char*)(0x424C1318UL))
#define bFM4_QPRC2_QCR_SWAP                    *((volatile unsigned char*)(0x424C131CUL))
#define bFM4_QPRC2_QCR_PCRM0                   *((volatile unsigned char*)(0x424C1320UL))
#define bFM4_QPRC2_QCR_PCRM1                   *((volatile unsigned char*)(0x424C1324UL))
#define bFM4_QPRC2_QCR_AES0                    *((volatile unsigned char*)(0x424C1328UL))
#define bFM4_QPRC2_QCR_AES1                    *((volatile unsigned char*)(0x424C132CUL))
#define bFM4_QPRC2_QCR_BES0                    *((volatile unsigned char*)(0x424C1330UL))
#define bFM4_QPRC2_QCR_BES1                    *((volatile unsigned char*)(0x424C1334UL))
#define bFM4_QPRC2_QCR_CGE0                    *((volatile unsigned char*)(0x424C1338UL))
#define bFM4_QPRC2_QCR_CGE1                    *((volatile unsigned char*)(0x424C133CUL))
#define bFM4_QPRC2_QCRL_PCM0                   *((volatile unsigned char*)(0x424C1300UL))
#define bFM4_QPRC2_QCRL_PCM1                   *((volatile unsigned char*)(0x424C1304UL))
#define bFM4_QPRC2_QCRL_RCM0                   *((volatile unsigned char*)(0x424C1308UL))
#define bFM4_QPRC2_QCRL_RCM1                   *((volatile unsigned char*)(0x424C130CUL))
#define bFM4_QPRC2_QCRL_PSTP                   *((volatile unsigned char*)(0x424C1310UL))
#define bFM4_QPRC2_QCRL_CGSC                   *((volatile unsigned char*)(0x424C1314UL))
#define bFM4_QPRC2_QCRL_RSEL                   *((volatile unsigned char*)(0x424C1318UL))
#define bFM4_QPRC2_QCRL_SWAP                   *((volatile unsigned char*)(0x424C131CUL))
#define bFM4_QPRC2_QCRH_PCRM0                  *((volatile unsigned char*)(0x424C1320UL))
#define bFM4_QPRC2_QCRH_PCRM1                  *((volatile unsigned char*)(0x424C1324UL))
#define bFM4_QPRC2_QCRH_AES0                   *((volatile unsigned char*)(0x424C1328UL))
#define bFM4_QPRC2_QCRH_AES1                   *((volatile unsigned char*)(0x424C132CUL))
#define bFM4_QPRC2_QCRH_BES0                   *((volatile unsigned char*)(0x424C1330UL))
#define bFM4_QPRC2_QCRH_BES1                   *((volatile unsigned char*)(0x424C1334UL))
#define bFM4_QPRC2_QCRH_CGE0                   *((volatile unsigned char*)(0x424C1338UL))
#define bFM4_QPRC2_QCRH_CGE1                   *((volatile unsigned char*)(0x424C133CUL))
#define bFM4_QPRC2_QECR_ORNGMD                 *((volatile unsigned char*)(0x424C1380UL))
#define bFM4_QPRC2_QECR_ORNGF                  *((volatile unsigned char*)(0x424C1384UL))
#define bFM4_QPRC2_QECR_ORNGIE                 *((volatile unsigned char*)(0x424C1388UL))

/* Quad position and revolution counter channel 3 registers */
#define bFM4_QPRC3_QICR_QPCMIE                 *((volatile unsigned char*)(0x424c1a80UL))
#define bFM4_QPRC3_QICR_QPCMF                  *((volatile unsigned char*)(0x424c1a84UL))
#define bFM4_QPRC3_QICR_QPRCMIE                *((volatile unsigned char*)(0x424c1a88UL))
#define bFM4_QPRC3_QICR_QPRCMF                 *((volatile unsigned char*)(0x424c1a8CUL))
#define bFM4_QPRC3_QICR_OUZIE                  *((volatile unsigned char*)(0x424c1a90UL))
#define bFM4_QPRC3_QICR_UFDF                   *((volatile unsigned char*)(0x424c1a94UL))
#define bFM4_QPRC3_QICR_OFDF                   *((volatile unsigned char*)(0x424c1a98UL))
#define bFM4_QPRC3_QICR_ZIIF                   *((volatile unsigned char*)(0x424c1a9CUL))
#define bFM4_QPRC3_QICR_CDCIE                  *((volatile unsigned char*)(0x424c1aa0UL))
#define bFM4_QPRC3_QICR_CDCF                   *((volatile unsigned char*)(0x424c1aa4UL))
#define bFM4_QPRC3_QICR_DIRPC                  *((volatile unsigned char*)(0x424c1aa8UL))
#define bFM4_QPRC3_QICR_DIROU                  *((volatile unsigned char*)(0x424c1aaCUL))
#define bFM4_QPRC3_QICR_QPCNRCMIE              *((volatile unsigned char*)(0x424c1ab0UL))
#define bFM4_QPRC3_QICR_QPCNRCMF               *((volatile unsigned char*)(0x424c1ab4UL))
#define bFM4_QPRC3_QCR_PCM0                    *((volatile unsigned char*)(0x424c1b00UL))
#define bFM4_QPRC3_QCR_PCM1                    *((volatile unsigned char*)(0x424c1b04UL))
#define bFM4_QPRC3_QCR_RCM0                    *((volatile unsigned char*)(0x424c1b08UL))
#define bFM4_QPRC3_QCR_RCM1                    *((volatile unsigned char*)(0x424c1b0CUL))
#define bFM4_QPRC3_QCR_PSTP                    *((volatile unsigned char*)(0x424c1b10UL))
#define bFM4_QPRC3_QCR_CGSC                    *((volatile unsigned char*)(0x424c1b14UL))
#define bFM4_QPRC3_QCR_RSEL                    *((volatile unsigned char*)(0x424c1b18UL))
#define bFM4_QPRC3_QCR_SWAP                    *((volatile unsigned char*)(0x424c1b1CUL))
#define bFM4_QPRC3_QCR_PCRM0                   *((volatile unsigned char*)(0x424c1b20UL))
#define bFM4_QPRC3_QCR_PCRM1                   *((volatile unsigned char*)(0x424c1b24UL))
#define bFM4_QPRC3_QCR_AES0                    *((volatile unsigned char*)(0x424c1b28UL))
#define bFM4_QPRC3_QCR_AES1                    *((volatile unsigned char*)(0x424c1b2CUL))
#define bFM4_QPRC3_QCR_BES0                    *((volatile unsigned char*)(0x424c1b30UL))
#define bFM4_QPRC3_QCR_BES1                    *((volatile unsigned char*)(0x424c1b34UL))
#define bFM4_QPRC3_QCR_CGE0                    *((volatile unsigned char*)(0x424c1b38UL))
#define bFM4_QPRC3_QCR_CGE1                    *((volatile unsigned char*)(0x424c1b3CUL))
#define bFM4_QPRC3_QECR_ORNGMD                 *((volatile unsigned char*)(0x424c1b80UL))
#define bFM4_QPRC3_QECR_ORNGF                  *((volatile unsigned char*)(0x424c1b84UL))
#define bFM4_QPRC3_QECR_ORNGIE                 *((volatile unsigned char*)(0x424c1b88UL))

/* QPRC NF channel 0 registers */
#define bFM4_QPRC0_NF_NFCTLA_AINLV             *((volatile unsigned char*)(0x424c2010UL))
#define bFM4_QPRC0_NF_NFCTLA_AINMD             *((volatile unsigned char*)(0x424c2014UL))
#define bFM4_QPRC0_NF_NFCTLB_BINLV             *((volatile unsigned char*)(0x424c2090UL))
#define bFM4_QPRC0_NF_NFCTLB_BINMD             *((volatile unsigned char*)(0x424c2094UL))
#define bFM4_QPRC0_NF_NFRCTLZ_ZINLV            *((volatile unsigned char*)(0x424c2110UL))
#define bFM4_QPRC0_NF_NFRCTLZ_ZINMD            *((volatile unsigned char*)(0x424c2114UL))

/* QPRC NF channel 1 registers */
#define bFM4_QPRC1_NF_NFCTLA_AINLV             *((volatile unsigned char*)(0x424c2210UL))
#define bFM4_QPRC1_NF_NFCTLA_AINMD             *((volatile unsigned char*)(0x424c2214UL))
#define bFM4_QPRC1_NF_NFCTLB_BINLV             *((volatile unsigned char*)(0x424c2290UL))
#define bFM4_QPRC1_NF_NFCTLB_BINMD             *((volatile unsigned char*)(0x424c2294UL))
#define bFM4_QPRC1_NF_NFRCTLZ_ZINLV            *((volatile unsigned char*)(0x424c2310UL))
#define bFM4_QPRC1_NF_NFRCTLZ_ZINMD            *((volatile unsigned char*)(0x424c2314UL))

/* QPRC NF channel 2 registers */
#define bFM4_QPRC2_NF_NFCTLA_AINLV             *((volatile unsigned char*)(0x424c2410UL))
#define bFM4_QPRC2_NF_NFCTLA_AINMD             *((volatile unsigned char*)(0x424c2414UL))
#define bFM4_QPRC2_NF_NFCTLB_BINLV             *((volatile unsigned char*)(0x424c2490UL))
#define bFM4_QPRC2_NF_NFCTLB_BINMD             *((volatile unsigned char*)(0x424c2494UL))
#define bFM4_QPRC2_NF_NFRCTLZ_ZINLV            *((volatile unsigned char*)(0x424c2510UL))
#define bFM4_QPRC2_NF_NFRCTLZ_ZINMD            *((volatile unsigned char*)(0x424c2514UL))

