MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C39H0AGV2000A/mcu.h
/* 12-bit DAC unit 0 registers */
#define bFM4_DAC0_DACR_DAE                     *((volatile unsigned char*)(0x42660000UL))
#define bFM4_DAC0_DACR_DRDY                    *((volatile unsigned char*)(0x42660004UL))
#define bFM4_DAC0_DACR_DAC10                   *((volatile unsigned char*)(0x42660010UL))
#define bFM4_DAC0_DACR_DDAS                    *((volatile unsigned char*)(0x42660014UL))
#define bFM4_DAC0_DADR_DA0                     *((volatile unsigned short*)(0x42660080UL))
#define bFM4_DAC0_DADR_DA1                     *((volatile unsigned short*)(0x42660084UL))
#define bFM4_DAC0_DADR_DA2                     *((volatile unsigned short*)(0x42660088UL))
#define bFM4_DAC0_DADR_DA3                     *((volatile unsigned short*)(0x4266008CUL))
#define bFM4_DAC0_DADR_DA4                     *((volatile unsigned short*)(0x42660090UL))
#define bFM4_DAC0_DADR_DA5                     *((volatile unsigned short*)(0x42660094UL))
#define bFM4_DAC0_DADR_DA6                     *((volatile unsigned short*)(0x42660098UL))
#define bFM4_DAC0_DADR_DA7                     *((volatile unsigned short*)(0x4266009CUL))
#define bFM4_DAC0_DADR_DA8                     *((volatile unsigned short*)(0x426600A0UL))
#define bFM4_DAC0_DADR_DA9                     *((volatile unsigned short*)(0x426600A4UL))
#define bFM4_DAC0_DADR_DA10                    *((volatile unsigned short*)(0x426600A8UL))
#define bFM4_DAC0_DADR_DA11                    *((volatile unsigned short*)(0x426600ACUL))

/* 12-bit DAC unit 1 registers */
#define bFM4_DAC1_DACR_DAE                     *((volatile unsigned char*)(0x42660100UL))
#define bFM4_DAC1_DACR_DRDY                    *((volatile unsigned char*)(0x42660104UL))
#define bFM4_DAC1_DACR_DAC10                   *((volatile unsigned char*)(0x42660110UL))
#define bFM4_DAC1_DACR_DDAS                    *((volatile unsigned char*)(0x42660114UL))
#define bFM4_DAC1_DADR_DA0                     *((volatile unsigned short*)(0x42660180UL))
#define bFM4_DAC1_DADR_DA1                     *((volatile unsigned short*)(0x42660184UL))
#define bFM4_DAC1_DADR_DA2                     *((volatile unsigned short*)(0x42660188UL))
#define bFM4_DAC1_DADR_DA3                     *((volatile unsigned short*)(0x4266018CUL))
#define bFM4_DAC1_DADR_DA4                     *((volatile unsigned short*)(0x42660190UL))
#define bFM4_DAC1_DADR_DA5                     *((volatile unsigned short*)(0x42660194UL))
#define bFM4_DAC1_DADR_DA6                     *((volatile unsigned short*)(0x42660198UL))
#define bFM4_DAC1_DADR_DA7                     *((volatile unsigned short*)(0x4266019CUL))
#define bFM4_DAC1_DADR_DA8                     *((volatile unsigned short*)(0x426601A0UL))
#define bFM4_DAC1_DADR_DA9                     *((volatile unsigned short*)(0x426601A4UL))
#define bFM4_DAC1_DADR_DA10                    *((volatile unsigned short*)(0x426601A8UL))
#define bFM4_DAC1_DADR_DA11                    *((volatile unsigned short*)(0x426601ACUL))

/* HDMI-CEC ch.0 registers */
#define bFM4_HDMICEC0_TXCTRL_TXEN              *((volatile unsigned char*)(0x42680000UL))
#define bFM4_HDMICEC0_TXCTRL_START             *((volatile unsigned char*)(0x42680008UL))
#define bFM4_HDMICEC0_TXCTRL_EOM               *((volatile unsigned char*)(0x4268000CUL))
#define bFM4_HDMICEC0_TXCTRL_ITSTEN            *((volatile unsigned char*)(0x42680010UL))
#define bFM4_HDMICEC0_TXCTRL_IBREN             *((volatile unsigned char*)(0x42680014UL))
#define bFM4_HDMICEC0_TXDATA_TXDATA0           *((volatile unsigned char*)(0x42680080UL))
#define bFM4_HDMICEC0_TXDATA_TXDATA1           *((volatile unsigned char*)(0x42680084UL))
#define bFM4_HDMICEC0_TXDATA_TXDATA2           *((volatile unsigned char*)(0x42680088UL))
#define bFM4_HDMICEC0_TXDATA_TXDATA3           *((volatile unsigned char*)(0x4268008CUL))
#define bFM4_HDMICEC0_TXDATA_TXDATA4           *((volatile unsigned char*)(0x42680090UL))
#define bFM4_HDMICEC0_TXDATA_TXDATA5           *((volatile unsigned char*)(0x42680094UL))
#define bFM4_HDMICEC0_TXDATA_TXDATA6           *((volatile unsigned char*)(0x42680098UL))
#define bFM4_HDMICEC0_TXDATA_TXDATA7           *((volatile unsigned char*)(0x4268009CUL))
#define bFM4_HDMICEC0_TXSTS_ACKSV              *((volatile unsigned char*)(0x42680100UL))
#define bFM4_HDMICEC0_TXSTS_ITST               *((volatile unsigned char*)(0x42680110UL))
#define bFM4_HDMICEC0_TXSTS_IBR                *((volatile unsigned char*)(0x42680114UL))
#define bFM4_HDMICEC0_SFREE_SFREE0             *((volatile unsigned char*)(0x42680180UL))
#define bFM4_HDMICEC0_SFREE_SFREE1             *((volatile unsigned char*)(0x42680184UL))
#define bFM4_HDMICEC0_SFREE_SFREE2             *((volatile unsigned char*)(0x42680188UL))
#define bFM4_HDMICEC0_SFREE_SFREE3             *((volatile unsigned char*)(0x4268018CUL))
#define bFM4_HDMICEC0_RCST_OVF                 *((volatile unsigned char*)(0x42680800UL))
#define bFM4_HDMICEC0_RCST_EOM                 *((volatile unsigned char*)(0x42680804UL))
#define bFM4_HDMICEC0_RCST_ACK                 *((volatile unsigned char*)(0x42680808UL))
#define bFM4_HDMICEC0_RCST_ST                  *((volatile unsigned char*)(0x4268080CUL))
#define bFM4_HDMICEC0_RCST_OVFSEL              *((volatile unsigned char*)(0x42680810UL))
#define bFM4_HDMICEC0_RCST_OVFIE               *((volatile unsigned char*)(0x42680814UL))
#define bFM4_HDMICEC0_RCST_ACKIE               *((volatile unsigned char*)(0x42680818UL))
#define bFM4_HDMICEC0_RCST_STIE                *((volatile unsigned char*)(0x4268081CUL))
#define bFM4_HDMICEC0_RCCR_EN                  *((volatile unsigned char*)(0x42680820UL))
#define bFM4_HDMICEC0_RCCR_ADRCE               *((volatile unsigned char*)(0x4268082CUL))
#define bFM4_HDMICEC0_RCCR_THSEL               *((volatile unsigned char*)(0x4268083CUL))
#define bFM4_HDMICEC0_RCCKD_CKDIV0             *((volatile unsigned short*)(0x42680B00UL))
#define bFM4_HDMICEC0_RCCKD_CKDIV1             *((volatile unsigned short*)(0x42680B04UL))
#define bFM4_HDMICEC0_RCCKD_CKDIV2             *((volatile unsigned short*)(0x42680B08UL))
#define bFM4_HDMICEC0_RCCKD_CKDIV3             *((volatile unsigned short*)(0x42680B0CUL))
#define bFM4_HDMICEC0_RCCKD_CKDIV4             *((volatile unsigned short*)(0x42680B10UL))
#define bFM4_HDMICEC0_RCCKD_CKDIV5             *((volatile unsigned short*)(0x42680B14UL))
#define bFM4_HDMICEC0_RCCKD_CKDIV6             *((volatile unsigned short*)(0x42680B18UL))
#define bFM4_HDMICEC0_RCCKD_CKDIV7             *((volatile unsigned short*)(0x42680B1CUL))
#define bFM4_HDMICEC0_RCCKD_CKDIV8             *((volatile unsigned short*)(0x42680B20UL))
#define bFM4_HDMICEC0_RCCKD_CKDIV9             *((volatile unsigned short*)(0x42680B24UL))
#define bFM4_HDMICEC0_RCCKD_CKDIV10            *((volatile unsigned short*)(0x42680B28UL))
#define bFM4_HDMICEC0_RCCKD_CKDIV11            *((volatile unsigned short*)(0x42680B2CUL))
#define bFM4_HDMICEC0_RCCKD_CKSEL              *((volatile unsigned short*)(0x42680B30UL))
#define bFM4_HDMICEC0_RCRC_RC                  *((volatile unsigned char*)(0x42680BA0UL))
#define bFM4_HDMICEC0_RCRC_RCIE                *((volatile unsigned char*)(0x42680BB0UL))
#define bFM4_HDMICEC0_RCLE_LES                 *((volatile unsigned char*)(0x42680C20UL))
#define bFM4_HDMICEC0_RCLE_LEL                 *((volatile unsigned char*)(0x42680C24UL))
#define bFM4_HDMICEC0_RCLE_EPE                 *((volatile unsigned char*)(0x42680C2CUL))
#define bFM4_HDMICEC0_RCLE_LESE                *((volatile unsigned char*)(0x42680C30UL))
#define bFM4_HDMICEC0_RCLE_LELE                *((volatile unsigned char*)(0x42680C34UL))
#define bFM4_HDMICEC0_RCLE_LESIE               *((volatile unsigned char*)(0x42680C38UL))
#define bFM4_HDMICEC0_RCLE_LELIE               *((volatile unsigned char*)(0x42680C3CUL))

