MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C39H0AGV2000A/mcu.h
/* HDMI-CEC ch.1 registers */
#define bFM4_HDMICEC1_TXCTRL_TXEN              *((volatile unsigned char*)(0x42682000UL))
#define bFM4_HDMICEC1_TXCTRL_START             *((volatile unsigned char*)(0x42682008UL))
#define bFM4_HDMICEC1_TXCTRL_EOM               *((volatile unsigned char*)(0x4268200CUL))
#define bFM4_HDMICEC1_TXCTRL_ITSTEN            *((volatile unsigned char*)(0x42682010UL))
#define bFM4_HDMICEC1_TXCTRL_IBREN             *((volatile unsigned char*)(0x42682014UL))
#define bFM4_HDMICEC1_TXDATA_TXDATA0           *((volatile unsigned char*)(0x42682080UL))
#define bFM4_HDMICEC1_TXDATA_TXDATA1           *((volatile unsigned char*)(0x42682084UL))
#define bFM4_HDMICEC1_TXDATA_TXDATA2           *((volatile unsigned char*)(0x42682088UL))
#define bFM4_HDMICEC1_TXDATA_TXDATA3           *((volatile unsigned char*)(0x4268208CUL))
#define bFM4_HDMICEC1_TXDATA_TXDATA4           *((volatile unsigned char*)(0x42682090UL))
#define bFM4_HDMICEC1_TXDATA_TXDATA5           *((volatile unsigned char*)(0x42682094UL))
#define bFM4_HDMICEC1_TXDATA_TXDATA6           *((volatile unsigned char*)(0x42682098UL))
#define bFM4_HDMICEC1_TXDATA_TXDATA7           *((volatile unsigned char*)(0x4268209CUL))
#define bFM4_HDMICEC1_TXSTS_ACKSV              *((volatile unsigned char*)(0x42682100UL))
#define bFM4_HDMICEC1_TXSTS_ITST               *((volatile unsigned char*)(0x42682110UL))
#define bFM4_HDMICEC1_TXSTS_IBR                *((volatile unsigned char*)(0x42682114UL))
#define bFM4_HDMICEC1_SFREE_SFREE0             *((volatile unsigned char*)(0x42682180UL))
#define bFM4_HDMICEC1_SFREE_SFREE1             *((volatile unsigned char*)(0x42682184UL))
#define bFM4_HDMICEC1_SFREE_SFREE2             *((volatile unsigned char*)(0x42682188UL))
#define bFM4_HDMICEC1_SFREE_SFREE3             *((volatile unsigned char*)(0x4268218CUL))
#define bFM4_HDMICEC1_RCST_OVF                 *((volatile unsigned char*)(0x42682800UL))
#define bFM4_HDMICEC1_RCST_EOM                 *((volatile unsigned char*)(0x42682804UL))
#define bFM4_HDMICEC1_RCST_ACK                 *((volatile unsigned char*)(0x42682808UL))
#define bFM4_HDMICEC1_RCST_ST                  *((volatile unsigned char*)(0x4268280CUL))
#define bFM4_HDMICEC1_RCST_OVFSEL              *((volatile unsigned char*)(0x42682810UL))
#define bFM4_HDMICEC1_RCST_OVFIE               *((volatile unsigned char*)(0x42682814UL))
#define bFM4_HDMICEC1_RCST_ACKIE               *((volatile unsigned char*)(0x42682818UL))
#define bFM4_HDMICEC1_RCST_STIE                *((volatile unsigned char*)(0x4268281CUL))
#define bFM4_HDMICEC1_RCCR_EN                  *((volatile unsigned char*)(0x42682820UL))
#define bFM4_HDMICEC1_RCCR_ADRCE               *((volatile unsigned char*)(0x4268282CUL))
#define bFM4_HDMICEC1_RCCR_THSEL               *((volatile unsigned char*)(0x4268283CUL))
#define bFM4_HDMICEC1_RCCKD_CKDIV0             *((volatile unsigned short*)(0x42682B00UL))
#define bFM4_HDMICEC1_RCCKD_CKDIV1             *((volatile unsigned short*)(0x42682B04UL))
#define bFM4_HDMICEC1_RCCKD_CKDIV2             *((volatile unsigned short*)(0x42682B08UL))
#define bFM4_HDMICEC1_RCCKD_CKDIV3             *((volatile unsigned short*)(0x42682B0CUL))
#define bFM4_HDMICEC1_RCCKD_CKDIV4             *((volatile unsigned short*)(0x42682B10UL))
#define bFM4_HDMICEC1_RCCKD_CKDIV5             *((volatile unsigned short*)(0x42682B14UL))
#define bFM4_HDMICEC1_RCCKD_CKDIV6             *((volatile unsigned short*)(0x42682B18UL))
#define bFM4_HDMICEC1_RCCKD_CKDIV7             *((volatile unsigned short*)(0x42682B1CUL))
#define bFM4_HDMICEC1_RCCKD_CKDIV8             *((volatile unsigned short*)(0x42682B20UL))
#define bFM4_HDMICEC1_RCCKD_CKDIV9             *((volatile unsigned short*)(0x42682B24UL))
#define bFM4_HDMICEC1_RCCKD_CKDIV10            *((volatile unsigned short*)(0x42682B28UL))
#define bFM4_HDMICEC1_RCCKD_CKDIV11            *((volatile unsigned short*)(0x42682B2CUL))
#define bFM4_HDMICEC1_RCCKD_CKSEL              *((volatile unsigned short*)(0x42682B30UL))
#define bFM4_HDMICEC1_RCRC_RC                  *((volatile unsigned char*)(0x42682BA0UL))
#define bFM4_HDMICEC1_RCRC_RCIE                *((volatile unsigned char*)(0x42682BB0UL))
#define bFM4_HDMICEC1_RCLE_LES                 *((volatile unsigned char*)(0x42682C20UL))
#define bFM4_HDMICEC1_RCLE_LEL                 *((volatile unsigned char*)(0x42682C24UL))
#define bFM4_HDMICEC1_RCLE_EPE                 *((volatile unsigned char*)(0x42682C2CUL))
#define bFM4_HDMICEC1_RCLE_LESE                *((volatile unsigned char*)(0x42682C30UL))
#define bFM4_HDMICEC1_RCLE_LELE                *((volatile unsigned char*)(0x42682C34UL))
#define bFM4_HDMICEC1_RCLE_LESIE               *((volatile unsigned char*)(0x42682C38UL))
#define bFM4_HDMICEC1_RCLE_LELIE               *((volatile unsigned char*)(0x42682C3CUL))

/* General purpose I/O registers */
#define bFM4_GPIO_PFR0_P0                      *((volatile unsigned char*)(0x42DE0000UL))
#define bFM4_GPIO_PFR0_P1                      *((volatile unsigned char*)(0x42DE0004UL))
#define bFM4_GPIO_PFR0_P2                      *((volatile unsigned char*)(0x42DE0008UL))
#define bFM4_GPIO_PFR0_P3                      *((volatile unsigned char*)(0x42DE000CUL))
#define bFM4_GPIO_PFR0_P4                      *((volatile unsigned char*)(0x42DE0010UL))
#define bFM4_GPIO_PFR0_P8                      *((volatile unsigned char*)(0x42DE0020UL))
#define bFM4_GPIO_PFR0_P9                      *((volatile unsigned char*)(0x42DE0024UL))
#define bFM4_GPIO_PFR0_PA                      *((volatile unsigned char*)(0x42DE0028UL))
#define bFM4_GPIO_PFR1_P0                      *((volatile unsigned char*)(0x42DE0080UL))
#define bFM4_GPIO_PFR1_P1                      *((volatile unsigned char*)(0x42DE0084UL))
#define bFM4_GPIO_PFR1_P2                      *((volatile unsigned char*)(0x42DE0088UL))
#define bFM4_GPIO_PFR1_P3                      *((volatile unsigned char*)(0x42DE008CUL))
#define bFM4_GPIO_PFR1_P4                      *((volatile unsigned char*)(0x42DE0090UL))
#define bFM4_GPIO_PFR1_P5                      *((volatile unsigned char*)(0x42DE0094UL))
#define bFM4_GPIO_PFR1_P6                      *((volatile unsigned char*)(0x42DE0098UL))
#define bFM4_GPIO_PFR1_P7                      *((volatile unsigned char*)(0x42DE009CUL))
#define bFM4_GPIO_PFR1_P8                      *((volatile unsigned char*)(0x42DE00A0UL))
#define bFM4_GPIO_PFR1_P9                      *((volatile unsigned char*)(0x42DE00A4UL))
#define bFM4_GPIO_PFR1_PA                      *((volatile unsigned char*)(0x42DE00A8UL))
#define bFM4_GPIO_PFR1_PB                      *((volatile unsigned char*)(0x42DE00ACUL))
#define bFM4_GPIO_PFR1_PC                      *((volatile unsigned char*)(0x42DE00B0UL))
#define bFM4_GPIO_PFR1_PD                      *((volatile unsigned char*)(0x42DE00B4UL))
#define bFM4_GPIO_PFR1_PE                      *((volatile unsigned char*)(0x42DE00B8UL))
#define bFM4_GPIO_PFR1_PF                      *((volatile unsigned char*)(0x42DE00BCUL))
#define bFM4_GPIO_PFR2_P0                      *((volatile unsigned char*)(0x42DE0100UL))
#define bFM4_GPIO_PFR2_P1                      *((volatile unsigned char*)(0x42DE0104UL))
#define bFM4_GPIO_PFR2_P2                      *((volatile unsigned char*)(0x42DE0108UL))
#define bFM4_GPIO_PFR2_P3                      *((volatile unsigned char*)(0x42DE010CUL))
#define bFM4_GPIO_PFR2_P4                      *((volatile unsigned char*)(0x42DE0110UL))
#define bFM4_GPIO_PFR2_P5                      *((volatile unsigned char*)(0x42DE0114UL))
#define bFM4_GPIO_PFR2_P6                      *((volatile unsigned char*)(0x42DE0118UL))
#define bFM4_GPIO_PFR2_P7                      *((volatile unsigned char*)(0x42DE011CUL))
#define bFM4_GPIO_PFR2_P8                      *((volatile unsigned char*)(0x42DE0120UL))
#define bFM4_GPIO_PFR2_P9                      *((volatile unsigned char*)(0x42DE0124UL))
#define bFM4_GPIO_PFR2_PA                      *((volatile unsigned char*)(0x42DE0128UL))
#define bFM4_GPIO_PFR3_P0                      *((volatile unsigned char*)(0x42DE0180UL))
#define bFM4_GPIO_PFR3_P1                      *((volatile unsigned char*)(0x42DE0184UL))
#define bFM4_GPIO_PFR3_P2                      *((volatile unsigned char*)(0x42DE0188UL))
#define bFM4_GPIO_PFR3_P3                      *((volatile unsigned char*)(0x42DE018CUL))
#define bFM4_GPIO_PFR3_P4                      *((volatile unsigned char*)(0x42DE0190UL))
#define bFM4_GPIO_PFR3_P5                      *((volatile unsigned char*)(0x42DE0194UL))
#define bFM4_GPIO_PFR3_P6                      *((volatile unsigned char*)(0x42DE0198UL))
#define bFM4_GPIO_PFR3_P7                      *((volatile unsigned char*)(0x42DE019CUL))
#define bFM4_GPIO_PFR3_P8                      *((volatile unsigned char*)(0x42DE01A0UL))
#define bFM4_GPIO_PFR3_P9                      *((volatile unsigned char*)(0x42DE01A4UL))
#define bFM4_GPIO_PFR3_PA                      *((volatile unsigned char*)(0x42DE01A8UL))
#define bFM4_GPIO_PFR3_PB                      *((volatile unsigned char*)(0x42DE01ACUL))
#define bFM4_GPIO_PFR3_PC                      *((volatile unsigned char*)(0x42DE01B0UL))
#define bFM4_GPIO_PFR3_PD                      *((volatile unsigned char*)(0x42DE01B4UL))
#define bFM4_GPIO_PFR3_PE                      *((volatile unsigned char*)(0x42DE01B8UL))
#define bFM4_GPIO_PFR4_P0                      *((volatile unsigned char*)(0x42DE0200UL))
#define bFM4_GPIO_PFR4_P1                      *((volatile unsigned char*)(0x42DE0204UL))
#define bFM4_GPIO_PFR4_P2                      *((volatile unsigned char*)(0x42DE0208UL))
#define bFM4_GPIO_PFR4_P3                      *((volatile unsigned char*)(0x42DE020CUL))
#define bFM4_GPIO_PFR4_P4                      *((volatile unsigned char*)(0x42DE0210UL))
#define bFM4_GPIO_PFR4_P5                      *((volatile unsigned char*)(0x42DE0214UL))
#define bFM4_GPIO_PFR4_P6                      *((volatile unsigned char*)(0x42DE0218UL))
#define bFM4_GPIO_PFR4_P7                      *((volatile unsigned char*)(0x42DE021CUL))
#define bFM4_GPIO_PFR4_P8                      *((volatile unsigned char*)(0x42DE0220UL))
#define bFM4_GPIO_PFR4_P9                      *((volatile unsigned char*)(0x42DE0224UL))
#define bFM4_GPIO_PFR4_PA                      *((volatile unsigned char*)(0x42DE0228UL))
#define bFM4_GPIO_PFR4_PB                      *((volatile unsigned char*)(0x42DE022CUL))
#define bFM4_GPIO_PFR4_PC                      *((volatile unsigned char*)(0x42DE0230UL))
#define bFM4_GPIO_PFR4_PD                      *((volatile unsigned char*)(0x42DE0234UL))
#define bFM4_GPIO_PFR4_PE                      *((volatile unsigned char*)(0x42DE0238UL))
#define bFM4_GPIO_PFR5_P0                      *((volatile unsigned char*)(0x42DE0280UL))
#define bFM4_GPIO_PFR5_P1                      *((volatile unsigned char*)(0x42DE0284UL))
#define bFM4_GPIO_PFR5_P2                      *((volatile unsigned char*)(0x42DE0288UL))
#define bFM4_GPIO_PFR5_P3                      *((volatile unsigned char*)(0x42DE028CUL))
#define bFM4_GPIO_PFR5_P4                      *((volatile unsigned char*)(0x42DE0290UL))
#define bFM4_GPIO_PFR5_P5                      *((volatile unsigned char*)(0x42DE0294UL))
#define bFM4_GPIO_PFR5_P6                      *((volatile unsigned char*)(0x42DE0298UL))
#define bFM4_GPIO_PFR5_P7                      *((volatile unsigned char*)(0x42DE029CUL))
#define bFM4_GPIO_PFR5_P8                      *((volatile unsigned char*)(0x42DE02A0UL))
#define bFM4_GPIO_PFR5_P9                      *((volatile unsigned char*)(0x42DE02A4UL))
#define bFM4_GPIO_PFR5_PA                      *((volatile unsigned char*)(0x42DE02A8UL))
#define bFM4_GPIO_PFR5_PB                      *((volatile unsigned char*)(0x42DE02ACUL))
#define bFM4_GPIO_PFR5_PC                      *((volatile unsigned char*)(0x42DE02B0UL))
#define bFM4_GPIO_PFR5_PD                      *((volatile unsigned char*)(0x42DE02B4UL))
#define bFM4_GPIO_PFR5_PE                      *((volatile unsigned char*)(0x42DE02B8UL))
#define bFM4_GPIO_PFR5_PF                      *((volatile unsigned char*)(0x42DE02BCUL))
#define bFM4_GPIO_PFR6_P0                      *((volatile unsigned char*)(0x42DE0300UL))
#define bFM4_GPIO_PFR6_P1                      *((volatile unsigned char*)(0x42DE0304UL))
#define bFM4_GPIO_PFR6_P2                      *((volatile unsigned char*)(0x42DE0308UL))
#define bFM4_GPIO_PFR6_P3                      *((volatile unsigned char*)(0x42DE030CUL))
#define bFM4_GPIO_PFR6_P4                      *((volatile unsigned char*)(0x42DE0310UL))
#define bFM4_GPIO_PFR6_P5                      *((volatile unsigned char*)(0x42DE0314UL))
#define bFM4_GPIO_PFR6_P6                      *((volatile unsigned char*)(0x42DE0318UL))
#define bFM4_GPIO_PFR6_P7                      *((volatile unsigned char*)(0x42DE031CUL))
#define bFM4_GPIO_PFR6_P8                      *((volatile unsigned char*)(0x42DE0320UL))
#define bFM4_GPIO_PFR6_P9                      *((volatile unsigned char*)(0x42DE0324UL))
#define bFM4_GPIO_PFR6_PA                      *((volatile unsigned char*)(0x42DE0328UL))
#define bFM4_GPIO_PFR6_PB                      *((volatile unsigned char*)(0x42DE032CUL))
#define bFM4_GPIO_PFR6_PC                      *((volatile unsigned char*)(0x42DE0330UL))
#define bFM4_GPIO_PFR6_PD                      *((volatile unsigned char*)(0x42DE0334UL))
#define bFM4_GPIO_PFR6_PE                      *((volatile unsigned char*)(0x42DE0338UL))
#define bFM4_GPIO_PFR7_P0                      *((volatile unsigned char*)(0x42DE0380UL))
#define bFM4_GPIO_PFR7_P1                      *((volatile unsigned char*)(0x42DE0384UL))
#define bFM4_GPIO_PFR7_P2                      *((volatile unsigned char*)(0x42DE0388UL))
#define bFM4_GPIO_PFR7_P3                      *((volatile unsigned char*)(0x42DE038CUL))
#define bFM4_GPIO_PFR7_P4                      *((volatile unsigned char*)(0x42DE0390UL))
#define bFM4_GPIO_PFR7_P5                      *((volatile unsigned char*)(0x42DE0394UL))
#define bFM4_GPIO_PFR7_P6                      *((volatile unsigned char*)(0x42DE0398UL))
#define bFM4_GPIO_PFR7_P7                      *((volatile unsigned char*)(0x42DE039CUL))
#define bFM4_GPIO_PFR7_P8                      *((volatile unsigned char*)(0x42DE03A0UL))
#define bFM4_GPIO_PFR7_P9                      *((volatile unsigned char*)(0x42DE03A4UL))
#define bFM4_GPIO_PFR7_PA                      *((volatile unsigned char*)(0x42DE03A8UL))
#define bFM4_GPIO_PFR7_PB                      *((volatile unsigned char*)(0x42DE03ACUL))
#define bFM4_GPIO_PFR7_PC                      *((volatile unsigned char*)(0x42DE03B0UL))
#define bFM4_GPIO_PFR7_PD                      *((volatile unsigned char*)(0x42DE03B4UL))
#define bFM4_GPIO_PFR7_PE                      *((volatile unsigned char*)(0x42DE03B8UL))
#define bFM4_GPIO_PFR8_P0                      *((volatile unsigned char*)(0x42DE0400UL))
#define bFM4_GPIO_PFR8_P1                      *((volatile unsigned char*)(0x42DE0404UL))
#define bFM4_GPIO_PFR8_P2                      *((volatile unsigned char*)(0x42DE0408UL))
#define bFM4_GPIO_PFR8_P3                      *((volatile unsigned char*)(0x42DE040CUL))
#define bFM4_GPIO_PFR9_P0                      *((volatile unsigned char*)(0x42DE0480UL))
#define bFM4_GPIO_PFR9_P1                      *((volatile unsigned char*)(0x42DE0484UL))
#define bFM4_GPIO_PFR9_P2                      *((volatile unsigned char*)(0x42DE0488UL))
#define bFM4_GPIO_PFR9_P3                      *((volatile unsigned char*)(0x42DE048CUL))
#define bFM4_GPIO_PFR9_P4                      *((volatile unsigned char*)(0x42DE0490UL))
#define bFM4_GPIO_PFR9_P5                      *((volatile unsigned char*)(0x42DE0494UL))
#define bFM4_GPIO_PFR9_P6                      *((volatile unsigned char*)(0x42DE0498UL))
#define bFM4_GPIO_PFR9_P7                      *((volatile unsigned char*)(0x42DE049CUL))
#define bFM4_GPIO_PFRA_P0                      *((volatile unsigned char*)(0x42DE0500UL))
#define bFM4_GPIO_PFRA_P1                      *((volatile unsigned char*)(0x42DE0504UL))
#define bFM4_GPIO_PFRA_P2                      *((volatile unsigned char*)(0x42DE0508UL))
#define bFM4_GPIO_PFRA_P3                      *((volatile unsigned char*)(0x42DE050CUL))
#define bFM4_GPIO_PFRA_P4                      *((volatile unsigned char*)(0x42DE0510UL))
#define bFM4_GPIO_PFRA_P5                      *((volatile unsigned char*)(0x42DE0514UL))
#define bFM4_GPIO_PFRA_P6                      *((volatile unsigned char*)(0x42DE0518UL))
#define bFM4_GPIO_PFRA_P7                      *((volatile unsigned char*)(0x42DE051CUL))
#define bFM4_GPIO_PFRA_P8                      *((volatile unsigned char*)(0x42DE0520UL))
#define bFM4_GPIO_PFRA_P9                      *((volatile unsigned char*)(0x42DE0524UL))
#define bFM4_GPIO_PFRA_PA                      *((volatile unsigned char*)(0x42DE0528UL))
#define bFM4_GPIO_PFRA_PB                      *((volatile unsigned char*)(0x42DE052CUL))
#define bFM4_GPIO_PFRA_PC                      *((volatile unsigned char*)(0x42DE0530UL))
#define bFM4_GPIO_PFRA_PD                      *((volatile unsigned char*)(0x42DE0534UL))
#define bFM4_GPIO_PFRA_PE                      *((volatile unsigned char*)(0x42DE0538UL))
#define bFM4_GPIO_PFRA_PF                      *((volatile unsigned char*)(0x42DE053CUL))
#define bFM4_GPIO_PFRB_P0                      *((volatile unsigned char*)(0x42DE0580UL))
#define bFM4_GPIO_PFRB_P1                      *((volatile unsigned char*)(0x42DE0584UL))
#define bFM4_GPIO_PFRB_P2                      *((volatile unsigned char*)(0x42DE0588UL))
#define bFM4_GPIO_PFRB_P3                      *((volatile unsigned char*)(0x42DE058CUL))
#define bFM4_GPIO_PFRB_P4                      *((volatile unsigned char*)(0x42DE0590UL))
#define bFM4_GPIO_PFRB_P5                      *((volatile unsigned char*)(0x42DE0594UL))
#define bFM4_GPIO_PFRB_P6                      *((volatile unsigned char*)(0x42DE0598UL))
#define bFM4_GPIO_PFRB_P7                      *((volatile unsigned char*)(0x42DE059CUL))
#define bFM4_GPIO_PFRB_P8                      *((volatile unsigned char*)(0x42DE05A0UL))
#define bFM4_GPIO_PFRB_P9                      *((volatile unsigned char*)(0x42DE05A4UL))
#define bFM4_GPIO_PFRB_PA                      *((volatile unsigned char*)(0x42DE05A8UL))
#define bFM4_GPIO_PFRB_PB                      *((volatile unsigned char*)(0x42DE05ACUL))
#define bFM4_GPIO_PFRB_PC                      *((volatile unsigned char*)(0x42DE05B0UL))
#define bFM4_GPIO_PFRB_PD                      *((volatile unsigned char*)(0x42DE05B4UL))
#define bFM4_GPIO_PFRB_PE                      *((volatile unsigned char*)(0x42DE05B8UL))
#define bFM4_GPIO_PFRB_PF                      *((volatile unsigned char*)(0x42DE05BCUL))
#define bFM4_GPIO_PFRC_P0                      *((volatile unsigned char*)(0x42DE0600UL))
#define bFM4_GPIO_PFRC_P1                      *((volatile unsigned char*)(0x42DE0604UL))
#define bFM4_GPIO_PFRC_P2                      *((volatile unsigned char*)(0x42DE0608UL))
#define bFM4_GPIO_PFRC_P3                      *((volatile unsigned char*)(0x42DE060CUL))
#define bFM4_GPIO_PFRC_P4                      *((volatile unsigned char*)(0x42DE0610UL))
#define bFM4_GPIO_PFRC_P5                      *((volatile unsigned char*)(0x42DE0614UL))
#define bFM4_GPIO_PFRC_P6                      *((volatile unsigned char*)(0x42DE0618UL))
#define bFM4_GPIO_PFRC_P7                      *((volatile unsigned char*)(0x42DE061CUL))
#define bFM4_GPIO_PFRC_P8                      *((volatile unsigned char*)(0x42DE0620UL))
#define bFM4_GPIO_PFRC_P9                      *((volatile unsigned char*)(0x42DE0624UL))
#define bFM4_GPIO_PFRC_PA                      *((volatile unsigned char*)(0x42DE0628UL))
#define bFM4_GPIO_PFRC_PB                      *((volatile unsigned char*)(0x42DE062CUL))
#define bFM4_GPIO_PFRC_PC                      *((volatile unsigned char*)(0x42DE0630UL))
#define bFM4_GPIO_PFRC_PD                      *((volatile unsigned char*)(0x42DE0634UL))
#define bFM4_GPIO_PFRC_PE                      *((volatile unsigned char*)(0x42DE0638UL))
#define bFM4_GPIO_PFRC_PF                      *((volatile unsigned char*)(0x42DE063CUL))
#define bFM4_GPIO_PFRD_P0                      *((volatile unsigned char*)(0x42DE0680UL))
#define bFM4_GPIO_PFRD_P1                      *((volatile unsigned char*)(0x42DE0684UL))
#define bFM4_GPIO_PFRD_P2                      *((volatile unsigned char*)(0x42DE0688UL))
#define bFM4_GPIO_PFRE_P0                      *((volatile unsigned char*)(0x42DE0700UL))
#define bFM4_GPIO_PFRE_P2                      *((volatile unsigned char*)(0x42DE0708UL))
#define bFM4_GPIO_PFRE_P3                      *((volatile unsigned char*)(0x42DE070CUL))
#define bFM4_GPIO_PFRF_P0                      *((volatile unsigned char*)(0x42DE0780UL))
#define bFM4_GPIO_PFRF_P1                      *((volatile unsigned char*)(0x42DE0784UL))
#define bFM4_GPIO_PFRF_P2                      *((volatile unsigned char*)(0x42DE0788UL))
#define bFM4_GPIO_PFRF_P3                      *((volatile unsigned char*)(0x42DE078CUL))
#define bFM4_GPIO_PFRF_P4                      *((volatile unsigned char*)(0x42DE0790UL))
#define bFM4_GPIO_PFRF_P5                      *((volatile unsigned char*)(0x42DE0794UL))
#define bFM4_GPIO_PFRF_P6                      *((volatile unsigned char*)(0x42DE0798UL))
#define bFM4_GPIO_PFRF_P7                      *((volatile unsigned char*)(0x42DE079CUL))
#define bFM4_GPIO_PFRF_P8                      *((volatile unsigned char*)(0x42DE07A0UL))
#define bFM4_GPIO_PFRF_P9                      *((volatile unsigned char*)(0x42DE07A4UL))
#define bFM4_GPIO_PFRF_PA                      *((volatile unsigned char*)(0x42DE07A8UL))
#define bFM4_GPIO_PFRF_PB                      *((volatile unsigned char*)(0x42DE07ACUL))
#define bFM4_GPIO_PFRF_PC                      *((volatile unsigned char*)(0x42DE07B0UL))
#define bFM4_GPIO_PCR0_P0                      *((volatile unsigned char*)(0x42DE2000UL))
#define bFM4_GPIO_PCR0_P1                      *((volatile unsigned char*)(0x42DE2004UL))
#define bFM4_GPIO_PCR0_P2                      *((volatile unsigned char*)(0x42DE2008UL))
#define bFM4_GPIO_PCR0_P3                      *((volatile unsigned char*)(0x42DE200CUL))
#define bFM4_GPIO_PCR0_P4                      *((volatile unsigned char*)(0x42DE2010UL))
#define bFM4_GPIO_PCR0_P8                      *((volatile unsigned char*)(0x42DE2020UL))
#define bFM4_GPIO_PCR0_P9                      *((volatile unsigned char*)(0x42DE2024UL))
#define bFM4_GPIO_PCR0_PA                      *((volatile unsigned char*)(0x42DE2028UL))
#define bFM4_GPIO_PCR1_P0                      *((volatile unsigned char*)(0x42DE2080UL))
#define bFM4_GPIO_PCR1_P1                      *((volatile unsigned char*)(0x42DE2084UL))
#define bFM4_GPIO_PCR1_P2                      *((volatile unsigned char*)(0x42DE2088UL))
#define bFM4_GPIO_PCR1_P3                      *((volatile unsigned char*)(0x42DE208CUL))
#define bFM4_GPIO_PCR1_P4                      *((volatile unsigned char*)(0x42DE2090UL))
#define bFM4_GPIO_PCR1_P5                      *((volatile unsigned char*)(0x42DE2094UL))
#define bFM4_GPIO_PCR1_P6                      *((volatile unsigned char*)(0x42DE2098UL))
#define bFM4_GPIO_PCR1_P7                      *((volatile unsigned char*)(0x42DE209CUL))
#define bFM4_GPIO_PCR1_P8                      *((volatile unsigned char*)(0x42DE20A0UL))
#define bFM4_GPIO_PCR1_P9                      *((volatile unsigned char*)(0x42DE20A4UL))
#define bFM4_GPIO_PCR1_PA                      *((volatile unsigned char*)(0x42DE20A8UL))
#define bFM4_GPIO_PCR1_PB                      *((volatile unsigned char*)(0x42DE20ACUL))
#define bFM4_GPIO_PCR1_PC                      *((volatile unsigned char*)(0x42DE20B0UL))
#define bFM4_GPIO_PCR1_PD                      *((volatile unsigned char*)(0x42DE20B4UL))
