MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C39H0AGV2000A/mcu.h
#define bFM4_GPIO_PCR1_PE                      *((volatile unsigned char*)(0x42DE20B8UL))
#define bFM4_GPIO_PCR1_PF                      *((volatile unsigned char*)(0x42DE20BCUL))
#define bFM4_GPIO_PCR2_P0                      *((volatile unsigned char*)(0x42DE2100UL))
#define bFM4_GPIO_PCR2_P1                      *((volatile unsigned char*)(0x42DE2104UL))
#define bFM4_GPIO_PCR2_P2                      *((volatile unsigned char*)(0x42DE2108UL))
#define bFM4_GPIO_PCR2_P3                      *((volatile unsigned char*)(0x42DE210CUL))
#define bFM4_GPIO_PCR2_P4                      *((volatile unsigned char*)(0x42DE2110UL))
#define bFM4_GPIO_PCR2_P5                      *((volatile unsigned char*)(0x42DE2114UL))
#define bFM4_GPIO_PCR2_P6                      *((volatile unsigned char*)(0x42DE2118UL))
#define bFM4_GPIO_PCR2_P7                      *((volatile unsigned char*)(0x42DE211CUL))
#define bFM4_GPIO_PCR2_P8                      *((volatile unsigned char*)(0x42DE2120UL))
#define bFM4_GPIO_PCR2_P9                      *((volatile unsigned char*)(0x42DE2124UL))
#define bFM4_GPIO_PCR2_PA                      *((volatile unsigned char*)(0x42DE2128UL))
#define bFM4_GPIO_PCR3_P0                      *((volatile unsigned char*)(0x42DE2180UL))
#define bFM4_GPIO_PCR3_P1                      *((volatile unsigned char*)(0x42DE2184UL))
#define bFM4_GPIO_PCR3_P2                      *((volatile unsigned char*)(0x42DE2188UL))
#define bFM4_GPIO_PCR3_P3                      *((volatile unsigned char*)(0x42DE218CUL))
#define bFM4_GPIO_PCR3_P4                      *((volatile unsigned char*)(0x42DE2190UL))
#define bFM4_GPIO_PCR3_P5                      *((volatile unsigned char*)(0x42DE2194UL))
#define bFM4_GPIO_PCR3_P6                      *((volatile unsigned char*)(0x42DE2198UL))
#define bFM4_GPIO_PCR3_P7                      *((volatile unsigned char*)(0x42DE219CUL))
#define bFM4_GPIO_PCR3_P8                      *((volatile unsigned char*)(0x42DE21A0UL))
#define bFM4_GPIO_PCR3_P9                      *((volatile unsigned char*)(0x42DE21A4UL))
#define bFM4_GPIO_PCR3_PA                      *((volatile unsigned char*)(0x42DE21A8UL))
#define bFM4_GPIO_PCR3_PB                      *((volatile unsigned char*)(0x42DE21ACUL))
#define bFM4_GPIO_PCR3_PC                      *((volatile unsigned char*)(0x42DE21B0UL))
#define bFM4_GPIO_PCR3_PD                      *((volatile unsigned char*)(0x42DE21B4UL))
#define bFM4_GPIO_PCR3_PE                      *((volatile unsigned char*)(0x42DE21B8UL))
#define bFM4_GPIO_PCR4_P0                      *((volatile unsigned char*)(0x42DE2200UL))
#define bFM4_GPIO_PCR4_P1                      *((volatile unsigned char*)(0x42DE2204UL))
#define bFM4_GPIO_PCR4_P2                      *((volatile unsigned char*)(0x42DE2208UL))
#define bFM4_GPIO_PCR4_P3                      *((volatile unsigned char*)(0x42DE220CUL))
#define bFM4_GPIO_PCR4_P4                      *((volatile unsigned char*)(0x42DE2210UL))
#define bFM4_GPIO_PCR4_P5                      *((volatile unsigned char*)(0x42DE2214UL))
#define bFM4_GPIO_PCR4_P6                      *((volatile unsigned char*)(0x42DE2218UL))
#define bFM4_GPIO_PCR4_P7                      *((volatile unsigned char*)(0x42DE221CUL))
#define bFM4_GPIO_PCR4_P8                      *((volatile unsigned char*)(0x42DE2220UL))
#define bFM4_GPIO_PCR4_P9                      *((volatile unsigned char*)(0x42DE2224UL))
#define bFM4_GPIO_PCR4_PA                      *((volatile unsigned char*)(0x42DE2228UL))
#define bFM4_GPIO_PCR4_PB                      *((volatile unsigned char*)(0x42DE222CUL))
#define bFM4_GPIO_PCR4_PC                      *((volatile unsigned char*)(0x42DE2230UL))
#define bFM4_GPIO_PCR4_PD                      *((volatile unsigned char*)(0x42DE2234UL))
#define bFM4_GPIO_PCR4_PE                      *((volatile unsigned char*)(0x42DE2238UL))
#define bFM4_GPIO_PCR5_P0                      *((volatile unsigned char*)(0x42DE2280UL))
#define bFM4_GPIO_PCR5_P1                      *((volatile unsigned char*)(0x42DE2284UL))
#define bFM4_GPIO_PCR5_P2                      *((volatile unsigned char*)(0x42DE2288UL))
#define bFM4_GPIO_PCR5_P3                      *((volatile unsigned char*)(0x42DE228CUL))
#define bFM4_GPIO_PCR5_P4                      *((volatile unsigned char*)(0x42DE2290UL))
#define bFM4_GPIO_PCR5_P5                      *((volatile unsigned char*)(0x42DE2294UL))
#define bFM4_GPIO_PCR5_P6                      *((volatile unsigned char*)(0x42DE2298UL))
#define bFM4_GPIO_PCR5_P7                      *((volatile unsigned char*)(0x42DE229CUL))
#define bFM4_GPIO_PCR5_P8                      *((volatile unsigned char*)(0x42DE22A0UL))
#define bFM4_GPIO_PCR5_P9                      *((volatile unsigned char*)(0x42DE22A4UL))
#define bFM4_GPIO_PCR5_PA                      *((volatile unsigned char*)(0x42DE22A8UL))
#define bFM4_GPIO_PCR5_PB                      *((volatile unsigned char*)(0x42DE22ACUL))
#define bFM4_GPIO_PCR5_PC                      *((volatile unsigned char*)(0x42DE22B0UL))
#define bFM4_GPIO_PCR5_PD                      *((volatile unsigned char*)(0x42DE22B4UL))
#define bFM4_GPIO_PCR5_PE                      *((volatile unsigned char*)(0x42DE22B8UL))
#define bFM4_GPIO_PCR5_PF                      *((volatile unsigned char*)(0x42DE22BCUL))
#define bFM4_GPIO_PCR6_P0                      *((volatile unsigned char*)(0x42DE2300UL))
#define bFM4_GPIO_PCR6_P1                      *((volatile unsigned char*)(0x42DE2304UL))
#define bFM4_GPIO_PCR6_P2                      *((volatile unsigned char*)(0x42DE2308UL))
#define bFM4_GPIO_PCR6_P3                      *((volatile unsigned char*)(0x42DE230CUL))
#define bFM4_GPIO_PCR6_P4                      *((volatile unsigned char*)(0x42DE2310UL))
#define bFM4_GPIO_PCR6_P5                      *((volatile unsigned char*)(0x42DE2314UL))
#define bFM4_GPIO_PCR6_P6                      *((volatile unsigned char*)(0x42DE2318UL))
#define bFM4_GPIO_PCR6_P7                      *((volatile unsigned char*)(0x42DE231CUL))
#define bFM4_GPIO_PCR6_P8                      *((volatile unsigned char*)(0x42DE2320UL))
#define bFM4_GPIO_PCR6_P9                      *((volatile unsigned char*)(0x42DE2324UL))
#define bFM4_GPIO_PCR6_PA                      *((volatile unsigned char*)(0x42DE2328UL))
#define bFM4_GPIO_PCR6_PB                      *((volatile unsigned char*)(0x42DE232CUL))
#define bFM4_GPIO_PCR6_PC                      *((volatile unsigned char*)(0x42DE2330UL))
#define bFM4_GPIO_PCR6_PD                      *((volatile unsigned char*)(0x42DE2334UL))
#define bFM4_GPIO_PCR6_PE                      *((volatile unsigned char*)(0x42DE2338UL))
#define bFM4_GPIO_PCR7_P0                      *((volatile unsigned char*)(0x42DE2380UL))
#define bFM4_GPIO_PCR7_P1                      *((volatile unsigned char*)(0x42DE2384UL))
#define bFM4_GPIO_PCR7_P2                      *((volatile unsigned char*)(0x42DE2388UL))
#define bFM4_GPIO_PCR7_P3                      *((volatile unsigned char*)(0x42DE238CUL))
#define bFM4_GPIO_PCR7_P4                      *((volatile unsigned char*)(0x42DE2390UL))
#define bFM4_GPIO_PCR7_P5                      *((volatile unsigned char*)(0x42DE2394UL))
#define bFM4_GPIO_PCR7_P6                      *((volatile unsigned char*)(0x42DE2398UL))
#define bFM4_GPIO_PCR7_P7                      *((volatile unsigned char*)(0x42DE239CUL))
#define bFM4_GPIO_PCR7_P8                      *((volatile unsigned char*)(0x42DE23A0UL))
#define bFM4_GPIO_PCR7_P9                      *((volatile unsigned char*)(0x42DE23A4UL))
#define bFM4_GPIO_PCR7_PA                      *((volatile unsigned char*)(0x42DE23A8UL))
#define bFM4_GPIO_PCR7_PB                      *((volatile unsigned char*)(0x42DE23ACUL))
#define bFM4_GPIO_PCR7_PC                      *((volatile unsigned char*)(0x42DE23B0UL))
#define bFM4_GPIO_PCR7_PD                      *((volatile unsigned char*)(0x42DE23B4UL))
#define bFM4_GPIO_PCR7_PE                      *((volatile unsigned char*)(0x42DE23B8UL))
#define bFM4_GPIO_PCR8_P0                      *((volatile unsigned char*)(0x42DE2400UL))
#define bFM4_GPIO_PCR8_P1                      *((volatile unsigned char*)(0x42DE2404UL))
#define bFM4_GPIO_PCR8_P2                      *((volatile unsigned char*)(0x42DE2408UL))
#define bFM4_GPIO_PCR8_P3                      *((volatile unsigned char*)(0x42DE240CUL))
#define bFM4_GPIO_PCR9_P0                      *((volatile unsigned char*)(0x42DE2480UL))
#define bFM4_GPIO_PCR9_P1                      *((volatile unsigned char*)(0x42DE2484UL))
#define bFM4_GPIO_PCR9_P2                      *((volatile unsigned char*)(0x42DE2488UL))
#define bFM4_GPIO_PCR9_P3                      *((volatile unsigned char*)(0x42DE248CUL))
#define bFM4_GPIO_PCR9_P4                      *((volatile unsigned char*)(0x42DE2490UL))
#define bFM4_GPIO_PCR9_P5                      *((volatile unsigned char*)(0x42DE2494UL))
#define bFM4_GPIO_PCR9_P6                      *((volatile unsigned char*)(0x42DE2498UL))
#define bFM4_GPIO_PCR9_P7                      *((volatile unsigned char*)(0x42DE249CUL))
#define bFM4_GPIO_PCRA_P0                      *((volatile unsigned char*)(0x42DE2500UL))
#define bFM4_GPIO_PCRA_P1                      *((volatile unsigned char*)(0x42DE2504UL))
#define bFM4_GPIO_PCRA_P2                      *((volatile unsigned char*)(0x42DE2508UL))
#define bFM4_GPIO_PCRA_P3                      *((volatile unsigned char*)(0x42DE250CUL))
#define bFM4_GPIO_PCRA_P4                      *((volatile unsigned char*)(0x42DE2510UL))
#define bFM4_GPIO_PCRA_P5                      *((volatile unsigned char*)(0x42DE2514UL))
#define bFM4_GPIO_PCRA_P6                      *((volatile unsigned char*)(0x42DE2518UL))
#define bFM4_GPIO_PCRA_P7                      *((volatile unsigned char*)(0x42DE251CUL))
#define bFM4_GPIO_PCRA_P8                      *((volatile unsigned char*)(0x42DE2520UL))
#define bFM4_GPIO_PCRA_P9                      *((volatile unsigned char*)(0x42DE2524UL))
#define bFM4_GPIO_PCRA_PA                      *((volatile unsigned char*)(0x42DE2528UL))
#define bFM4_GPIO_PCRA_PB                      *((volatile unsigned char*)(0x42DE252CUL))
#define bFM4_GPIO_PCRA_PC                      *((volatile unsigned char*)(0x42DE2530UL))
#define bFM4_GPIO_PCRA_PD                      *((volatile unsigned char*)(0x42DE2534UL))
#define bFM4_GPIO_PCRA_PE                      *((volatile unsigned char*)(0x42DE2538UL))
#define bFM4_GPIO_PCRA_PF                      *((volatile unsigned char*)(0x42DE253CUL))
#define bFM4_GPIO_PCRB_P0                      *((volatile unsigned char*)(0x42DE2580UL))
#define bFM4_GPIO_PCRB_P1                      *((volatile unsigned char*)(0x42DE2584UL))
#define bFM4_GPIO_PCRB_P2                      *((volatile unsigned char*)(0x42DE2588UL))
#define bFM4_GPIO_PCRB_P3                      *((volatile unsigned char*)(0x42DE258CUL))
#define bFM4_GPIO_PCRB_P4                      *((volatile unsigned char*)(0x42DE2590UL))
#define bFM4_GPIO_PCRB_P5                      *((volatile unsigned char*)(0x42DE2594UL))
#define bFM4_GPIO_PCRB_P6                      *((volatile unsigned char*)(0x42DE2598UL))
#define bFM4_GPIO_PCRB_P7                      *((volatile unsigned char*)(0x42DE259CUL))
#define bFM4_GPIO_PCRB_P8                      *((volatile unsigned char*)(0x42DE25A0UL))
#define bFM4_GPIO_PCRB_P9                      *((volatile unsigned char*)(0x42DE25A4UL))
#define bFM4_GPIO_PCRB_PA                      *((volatile unsigned char*)(0x42DE25A8UL))
#define bFM4_GPIO_PCRB_PB                      *((volatile unsigned char*)(0x42DE25ACUL))
#define bFM4_GPIO_PCRB_PC                      *((volatile unsigned char*)(0x42DE25B0UL))
#define bFM4_GPIO_PCRB_PD                      *((volatile unsigned char*)(0x42DE25B4UL))
#define bFM4_GPIO_PCRB_PE                      *((volatile unsigned char*)(0x42DE25B8UL))
#define bFM4_GPIO_PCRB_PF                      *((volatile unsigned char*)(0x42DE25BCUL))
#define bFM4_GPIO_PCRC_P0                      *((volatile unsigned char*)(0x42DE2600UL))
#define bFM4_GPIO_PCRC_P1                      *((volatile unsigned char*)(0x42DE2604UL))
#define bFM4_GPIO_PCRC_P2                      *((volatile unsigned char*)(0x42DE2608UL))
#define bFM4_GPIO_PCRC_P3                      *((volatile unsigned char*)(0x42DE260CUL))
#define bFM4_GPIO_PCRC_P4                      *((volatile unsigned char*)(0x42DE2610UL))
#define bFM4_GPIO_PCRC_P5                      *((volatile unsigned char*)(0x42DE2614UL))
#define bFM4_GPIO_PCRC_P6                      *((volatile unsigned char*)(0x42DE2618UL))
#define bFM4_GPIO_PCRC_P7                      *((volatile unsigned char*)(0x42DE261CUL))
#define bFM4_GPIO_PCRC_P8                      *((volatile unsigned char*)(0x42DE2620UL))
#define bFM4_GPIO_PCRC_P9                      *((volatile unsigned char*)(0x42DE2624UL))
#define bFM4_GPIO_PCRC_PA                      *((volatile unsigned char*)(0x42DE2628UL))
#define bFM4_GPIO_PCRC_PB                      *((volatile unsigned char*)(0x42DE262CUL))
#define bFM4_GPIO_PCRC_PC                      *((volatile unsigned char*)(0x42DE2630UL))
#define bFM4_GPIO_PCRC_PD                      *((volatile unsigned char*)(0x42DE2634UL))
#define bFM4_GPIO_PCRC_PE                      *((volatile unsigned char*)(0x42DE2638UL))
#define bFM4_GPIO_PCRC_PF                      *((volatile unsigned char*)(0x42DE263CUL))
#define bFM4_GPIO_PCRD_P0                      *((volatile unsigned char*)(0x42DE2680UL))
#define bFM4_GPIO_PCRD_P1                      *((volatile unsigned char*)(0x42DE2684UL))
#define bFM4_GPIO_PCRD_P2                      *((volatile unsigned char*)(0x42DE2688UL))
#define bFM4_GPIO_PCRE_P0                      *((volatile unsigned char*)(0x42DE2700UL))
#define bFM4_GPIO_PCRE_P2                      *((volatile unsigned char*)(0x42DE2708UL))
#define bFM4_GPIO_PCRE_P3                      *((volatile unsigned char*)(0x42DE270CUL))
#define bFM4_GPIO_PCRF_P0                      *((volatile unsigned char*)(0x42DE2780UL))
#define bFM4_GPIO_PCRF_P1                      *((volatile unsigned char*)(0x42DE2784UL))
#define bFM4_GPIO_PCRF_P2                      *((volatile unsigned char*)(0x42DE2788UL))
#define bFM4_GPIO_PCRF_P3                      *((volatile unsigned char*)(0x42DE278CUL))
#define bFM4_GPIO_PCRF_P4                      *((volatile unsigned char*)(0x42DE2790UL))
#define bFM4_GPIO_PCRF_P5                      *((volatile unsigned char*)(0x42DE2794UL))
#define bFM4_GPIO_PCRF_P6                      *((volatile unsigned char*)(0x42DE2798UL))
#define bFM4_GPIO_PCRF_P7                      *((volatile unsigned char*)(0x42DE279CUL))
#define bFM4_GPIO_PCRF_P8                      *((volatile unsigned char*)(0x42DE27A0UL))
#define bFM4_GPIO_PCRF_P9                      *((volatile unsigned char*)(0x42DE27A4UL))
#define bFM4_GPIO_PCRF_PA                      *((volatile unsigned char*)(0x42DE27A8UL))
#define bFM4_GPIO_PCRF_PB                      *((volatile unsigned char*)(0x42DE27ACUL))
#define bFM4_GPIO_PCRF_PC                      *((volatile unsigned char*)(0x42DE27B0UL))
#define bFM4_GPIO_DDR0_P0                      *((volatile unsigned char*)(0x42DE4000UL))
#define bFM4_GPIO_DDR0_P1                      *((volatile unsigned char*)(0x42DE4004UL))
#define bFM4_GPIO_DDR0_P2                      *((volatile unsigned char*)(0x42DE4008UL))
#define bFM4_GPIO_DDR0_P3                      *((volatile unsigned char*)(0x42DE400CUL))
#define bFM4_GPIO_DDR0_P4                      *((volatile unsigned char*)(0x42DE4010UL))
#define bFM4_GPIO_DDR0_P5                      *((volatile unsigned char*)(0x42DE4014UL))
#define bFM4_GPIO_DDR0_P6                      *((volatile unsigned char*)(0x42DE4018UL))
#define bFM4_GPIO_DDR0_P7                      *((volatile unsigned char*)(0x42DE401CUL))
#define bFM4_GPIO_DDR0_P8                      *((volatile unsigned char*)(0x42DE4020UL))
#define bFM4_GPIO_DDR0_P9                      *((volatile unsigned char*)(0x42DE4024UL))
#define bFM4_GPIO_DDR0_PA                      *((volatile unsigned char*)(0x42DE4028UL))
#define bFM4_GPIO_DDR0_PB                      *((volatile unsigned char*)(0x42DE402CUL))
#define bFM4_GPIO_DDR0_PC                      *((volatile unsigned char*)(0x42DE4030UL))
#define bFM4_GPIO_DDR0_PD                      *((volatile unsigned char*)(0x42DE4034UL))
#define bFM4_GPIO_DDR0_PE                      *((volatile unsigned char*)(0x42DE4038UL))
#define bFM4_GPIO_DDR1_P0                      *((volatile unsigned char*)(0x42DE4080UL))
#define bFM4_GPIO_DDR1_P1                      *((volatile unsigned char*)(0x42DE4084UL))
#define bFM4_GPIO_DDR1_P2                      *((volatile unsigned char*)(0x42DE4088UL))
#define bFM4_GPIO_DDR1_P3                      *((volatile unsigned char*)(0x42DE408CUL))
#define bFM4_GPIO_DDR1_P4                      *((volatile unsigned char*)(0x42DE4090UL))
#define bFM4_GPIO_DDR1_P5                      *((volatile unsigned char*)(0x42DE4094UL))
#define bFM4_GPIO_DDR1_P6                      *((volatile unsigned char*)(0x42DE4098UL))
#define bFM4_GPIO_DDR1_P7                      *((volatile unsigned char*)(0x42DE409CUL))
#define bFM4_GPIO_DDR1_P8                      *((volatile unsigned char*)(0x42DE40A0UL))
#define bFM4_GPIO_DDR1_P9                      *((volatile unsigned char*)(0x42DE40A4UL))
#define bFM4_GPIO_DDR1_PA                      *((volatile unsigned char*)(0x42DE40A8UL))
#define bFM4_GPIO_DDR1_PB                      *((volatile unsigned char*)(0x42DE40ACUL))
#define bFM4_GPIO_DDR1_PC                      *((volatile unsigned char*)(0x42DE40B0UL))
#define bFM4_GPIO_DDR1_PD                      *((volatile unsigned char*)(0x42DE40B4UL))
#define bFM4_GPIO_DDR1_PE                      *((volatile unsigned char*)(0x42DE40B8UL))
#define bFM4_GPIO_DDR1_PF                      *((volatile unsigned char*)(0x42DE40BCUL))
#define bFM4_GPIO_DDR2_P0                      *((volatile unsigned char*)(0x42DE4100UL))
#define bFM4_GPIO_DDR2_P1                      *((volatile unsigned char*)(0x42DE4104UL))
#define bFM4_GPIO_DDR2_P2                      *((volatile unsigned char*)(0x42DE4108UL))
#define bFM4_GPIO_DDR2_P3                      *((volatile unsigned char*)(0x42DE410CUL))
#define bFM4_GPIO_DDR2_P4                      *((volatile unsigned char*)(0x42DE4110UL))
#define bFM4_GPIO_DDR2_P5                      *((volatile unsigned char*)(0x42DE4114UL))
#define bFM4_GPIO_DDR2_P6                      *((volatile unsigned char*)(0x42DE4118UL))
#define bFM4_GPIO_DDR2_P7                      *((volatile unsigned char*)(0x42DE411CUL))
#define bFM4_GPIO_DDR2_P8                      *((volatile unsigned char*)(0x42DE4120UL))
#define bFM4_GPIO_DDR2_P9                      *((volatile unsigned char*)(0x42DE4124UL))
#define bFM4_GPIO_DDR2_PA                      *((volatile unsigned char*)(0x42DE4128UL))
#define bFM4_GPIO_DDR3_P0                      *((volatile unsigned char*)(0x42DE4180UL))
#define bFM4_GPIO_DDR3_P1                      *((volatile unsigned char*)(0x42DE4184UL))
#define bFM4_GPIO_DDR3_P2                      *((volatile unsigned char*)(0x42DE4188UL))
#define bFM4_GPIO_DDR3_P3                      *((volatile unsigned char*)(0x42DE418CUL))
#define bFM4_GPIO_DDR3_P4                      *((volatile unsigned char*)(0x42DE4190UL))
#define bFM4_GPIO_DDR3_P5                      *((volatile unsigned char*)(0x42DE4194UL))
#define bFM4_GPIO_DDR3_P6                      *((volatile unsigned char*)(0x42DE4198UL))
#define bFM4_GPIO_DDR3_P7                      *((volatile unsigned char*)(0x42DE419CUL))
#define bFM4_GPIO_DDR3_P8                      *((volatile unsigned char*)(0x42DE41A0UL))
#define bFM4_GPIO_DDR3_P9                      *((volatile unsigned char*)(0x42DE41A4UL))
#define bFM4_GPIO_DDR3_PA                      *((volatile unsigned char*)(0x42DE41A8UL))
#define bFM4_GPIO_DDR3_PB                      *((volatile unsigned char*)(0x42DE41ACUL))
#define bFM4_GPIO_DDR3_PC                      *((volatile unsigned char*)(0x42DE41B0UL))
#define bFM4_GPIO_DDR3_PD                      *((volatile unsigned char*)(0x42DE41B4UL))
#define bFM4_GPIO_DDR3_PE                      *((volatile unsigned char*)(0x42DE41B8UL))
#define bFM4_GPIO_DDR4_P0                      *((volatile unsigned char*)(0x42DE4200UL))
#define bFM4_GPIO_DDR4_P1                      *((volatile unsigned char*)(0x42DE4204UL))
#define bFM4_GPIO_DDR4_P2                      *((volatile unsigned char*)(0x42DE4208UL))
#define bFM4_GPIO_DDR4_P3                      *((volatile unsigned char*)(0x42DE420CUL))
#define bFM4_GPIO_DDR4_P4                      *((volatile unsigned char*)(0x42DE4210UL))
#define bFM4_GPIO_DDR4_P5                      *((volatile unsigned char*)(0x42DE4214UL))
#define bFM4_GPIO_DDR4_P6                      *((volatile unsigned char*)(0x42DE4218UL))
#define bFM4_GPIO_DDR4_P7                      *((volatile unsigned char*)(0x42DE421CUL))
#define bFM4_GPIO_DDR4_P8                      *((volatile unsigned char*)(0x42DE4220UL))
#define bFM4_GPIO_DDR4_P9                      *((volatile unsigned char*)(0x42DE4224UL))
#define bFM4_GPIO_DDR4_PA                      *((volatile unsigned char*)(0x42DE4228UL))
#define bFM4_GPIO_DDR4_PB                      *((volatile unsigned char*)(0x42DE422CUL))
#define bFM4_GPIO_DDR4_PC                      *((volatile unsigned char*)(0x42DE4230UL))
#define bFM4_GPIO_DDR4_PD                      *((volatile unsigned char*)(0x42DE4234UL))
#define bFM4_GPIO_DDR4_PE                      *((volatile unsigned char*)(0x42DE4238UL))
#define bFM4_GPIO_DDR5_P0                      *((volatile unsigned char*)(0x42DE4280UL))
#define bFM4_GPIO_DDR5_P1                      *((volatile unsigned char*)(0x42DE4284UL))
#define bFM4_GPIO_DDR5_P2                      *((volatile unsigned char*)(0x42DE4288UL))
#define bFM4_GPIO_DDR5_P3                      *((volatile unsigned char*)(0x42DE428CUL))
#define bFM4_GPIO_DDR5_P4                      *((volatile unsigned char*)(0x42DE4290UL))
#define bFM4_GPIO_DDR5_P5                      *((volatile unsigned char*)(0x42DE4294UL))
#define bFM4_GPIO_DDR5_P6                      *((volatile unsigned char*)(0x42DE4298UL))
#define bFM4_GPIO_DDR5_P7                      *((volatile unsigned char*)(0x42DE429CUL))
#define bFM4_GPIO_DDR5_P8                      *((volatile unsigned char*)(0x42DE42A0UL))
#define bFM4_GPIO_DDR5_P9                      *((volatile unsigned char*)(0x42DE42A4UL))
#define bFM4_GPIO_DDR5_PA                      *((volatile unsigned char*)(0x42DE42A8UL))
#define bFM4_GPIO_DDR5_PB                      *((volatile unsigned char*)(0x42DE42ACUL))
#define bFM4_GPIO_DDR5_PC                      *((volatile unsigned char*)(0x42DE42B0UL))
#define bFM4_GPIO_DDR5_PD                      *((volatile unsigned char*)(0x42DE42B4UL))
#define bFM4_GPIO_DDR5_PE                      *((volatile unsigned char*)(0x42DE42B8UL))
#define bFM4_GPIO_DDR5_PF                      *((volatile unsigned char*)(0x42DE42BCUL))
#define bFM4_GPIO_DDR6_P0                      *((volatile unsigned char*)(0x42DE4300UL))
#define bFM4_GPIO_DDR6_P1                      *((volatile unsigned char*)(0x42DE4304UL))
#define bFM4_GPIO_DDR6_P2                      *((volatile unsigned char*)(0x42DE4308UL))
#define bFM4_GPIO_DDR6_P3                      *((volatile unsigned char*)(0x42DE430CUL))
#define bFM4_GPIO_DDR6_P4                      *((volatile unsigned char*)(0x42DE4310UL))
#define bFM4_GPIO_DDR6_P5                      *((volatile unsigned char*)(0x42DE4314UL))
#define bFM4_GPIO_DDR6_P6                      *((volatile unsigned char*)(0x42DE4318UL))
#define bFM4_GPIO_DDR6_P7                      *((volatile unsigned char*)(0x42DE431CUL))
#define bFM4_GPIO_DDR6_P8                      *((volatile unsigned char*)(0x42DE4320UL))
#define bFM4_GPIO_DDR6_P9                      *((volatile unsigned char*)(0x42DE4324UL))
