MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C39H0AGV2000A/mcu.h
/* MFS I2C channel 3 registers */
#define bFM4_MFS3_I2C_SMR_TIE                  *((volatile unsigned char*)(0x42706008UL))
#define bFM4_MFS3_I2C_SMR_RIE                  *((volatile unsigned char*)(0x4270600CUL))
#define bFM4_MFS3_I2C_SMR_MD0                  *((volatile unsigned char*)(0x42706014UL))
#define bFM4_MFS3_I2C_SMR_MD1                  *((volatile unsigned char*)(0x42706018UL))
#define bFM4_MFS3_I2C_SMR_MD2                  *((volatile unsigned char*)(0x4270601CUL))
#define bFM4_MFS3_I2C_IBCR_INT                 *((volatile unsigned char*)(0x42706020UL))
#define bFM4_MFS3_I2C_IBCR_BER                 *((volatile unsigned char*)(0x42706024UL))
#define bFM4_MFS3_I2C_IBCR_INTE                *((volatile unsigned char*)(0x42706028UL))
#define bFM4_MFS3_I2C_IBCR_CNDE                *((volatile unsigned char*)(0x4270602CUL))
#define bFM4_MFS3_I2C_IBCR_WSEL                *((volatile unsigned char*)(0x42706030UL))
#define bFM4_MFS3_I2C_IBCR_ACKE                *((volatile unsigned char*)(0x42706034UL))
#define bFM4_MFS3_I2C_IBCR_ACT                 *((volatile unsigned char*)(0x42706038UL))
#define bFM4_MFS3_I2C_IBCR_SCC                 *((volatile unsigned char*)(0x42706038UL))
#define bFM4_MFS3_I2C_IBCR_MSS                 *((volatile unsigned char*)(0x4270603CUL))
#define bFM4_MFS3_I2C_IBSR_BB                  *((volatile unsigned char*)(0x42706080UL))
#define bFM4_MFS3_I2C_IBSR_SPC                 *((volatile unsigned char*)(0x42706084UL))
#define bFM4_MFS3_I2C_IBSR_RSC                 *((volatile unsigned char*)(0x42706088UL))
#define bFM4_MFS3_I2C_IBSR_AL                  *((volatile unsigned char*)(0x4270608CUL))
#define bFM4_MFS3_I2C_IBSR_TRX                 *((volatile unsigned char*)(0x42706090UL))
#define bFM4_MFS3_I2C_IBSR_RSA                 *((volatile unsigned char*)(0x42706094UL))
#define bFM4_MFS3_I2C_IBSR_RACK                *((volatile unsigned char*)(0x42706098UL))
#define bFM4_MFS3_I2C_IBSR_FBT                 *((volatile unsigned char*)(0x4270609CUL))
#define bFM4_MFS3_I2C_SSR_TBI                  *((volatile unsigned char*)(0x427060A0UL))
#define bFM4_MFS3_I2C_SSR_TDRE                 *((volatile unsigned char*)(0x427060A4UL))
#define bFM4_MFS3_I2C_SSR_RDRF                 *((volatile unsigned char*)(0x427060A8UL))
#define bFM4_MFS3_I2C_SSR_ORE                  *((volatile unsigned char*)(0x427060ACUL))
#define bFM4_MFS3_I2C_SSR_TBIE                 *((volatile unsigned char*)(0x427060B0UL))
#define bFM4_MFS3_I2C_SSR_DMA                  *((volatile unsigned char*)(0x427060B4UL))
#define bFM4_MFS3_I2C_SSR_TSET                 *((volatile unsigned char*)(0x427060B8UL))
#define bFM4_MFS3_I2C_SSR_REC                  *((volatile unsigned char*)(0x427060BCUL))
#define bFM4_MFS3_I2C_ISBA_SA0                 *((volatile unsigned char*)(0x42706200UL))
#define bFM4_MFS3_I2C_ISBA_SA1                 *((volatile unsigned char*)(0x42706204UL))
#define bFM4_MFS3_I2C_ISBA_SA2                 *((volatile unsigned char*)(0x42706208UL))
#define bFM4_MFS3_I2C_ISBA_SA3                 *((volatile unsigned char*)(0x4270620CUL))
#define bFM4_MFS3_I2C_ISBA_SA4                 *((volatile unsigned char*)(0x42706210UL))
#define bFM4_MFS3_I2C_ISBA_SA5                 *((volatile unsigned char*)(0x42706214UL))
#define bFM4_MFS3_I2C_ISBA_SA6                 *((volatile unsigned char*)(0x42706218UL))
#define bFM4_MFS3_I2C_ISBA_SAEN                *((volatile unsigned char*)(0x4270621CUL))
#define bFM4_MFS3_I2C_ISMK_SM0                 *((volatile unsigned char*)(0x42706220UL))
#define bFM4_MFS3_I2C_ISMK_SM1                 *((volatile unsigned char*)(0x42706224UL))
#define bFM4_MFS3_I2C_ISMK_SM2                 *((volatile unsigned char*)(0x42706228UL))
#define bFM4_MFS3_I2C_ISMK_SM3                 *((volatile unsigned char*)(0x4270622CUL))
#define bFM4_MFS3_I2C_ISMK_SM4                 *((volatile unsigned char*)(0x42706230UL))
#define bFM4_MFS3_I2C_ISMK_SM5                 *((volatile unsigned char*)(0x42706234UL))
#define bFM4_MFS3_I2C_ISMK_SM6                 *((volatile unsigned char*)(0x42706238UL))
#define bFM4_MFS3_I2C_ISMK_EN                  *((volatile unsigned char*)(0x4270623CUL))
#define bFM4_MFS3_I2C_FCR_FE1                  *((volatile unsigned char*)(0x42706280UL))
#define bFM4_MFS3_I2C_FCR_FE2                  *((volatile unsigned char*)(0x42706284UL))
#define bFM4_MFS3_I2C_FCR_FCL1                 *((volatile unsigned char*)(0x42706288UL))
#define bFM4_MFS3_I2C_FCR_FCL2                 *((volatile unsigned char*)(0x4270628CUL))
#define bFM4_MFS3_I2C_FCR_FSET                 *((volatile unsigned char*)(0x42706290UL))
#define bFM4_MFS3_I2C_FCR_FLD                  *((volatile unsigned char*)(0x42706294UL))
#define bFM4_MFS3_I2C_FCR_FLST                 *((volatile unsigned char*)(0x42706298UL))
#define bFM4_MFS3_I2C_FCR_FSEL                 *((volatile unsigned char*)(0x427062A0UL))
#define bFM4_MFS3_I2C_FCR_FTIE                 *((volatile unsigned char*)(0x427062A4UL))
#define bFM4_MFS3_I2C_FCR_FDRQ                 *((volatile unsigned char*)(0x427062A8UL))
#define bFM4_MFS3_I2C_FCR_FRIIE                *((volatile unsigned char*)(0x427062ACUL))
#define bFM4_MFS3_I2C_FCR_FLSTE                *((volatile unsigned char*)(0x427062B0UL))
#define bFM4_MFS3_I2C_FCR0_FE1                 *((volatile unsigned char*)(0x42706280UL))
#define bFM4_MFS3_I2C_FCR0_FE2                 *((volatile unsigned char*)(0x42706284UL))
#define bFM4_MFS3_I2C_FCR0_FCL1                *((volatile unsigned char*)(0x42706288UL))
#define bFM4_MFS3_I2C_FCR0_FCL2                *((volatile unsigned char*)(0x4270628CUL))
#define bFM4_MFS3_I2C_FCR0_FSET                *((volatile unsigned char*)(0x42706290UL))
#define bFM4_MFS3_I2C_FCR0_FLD                 *((volatile unsigned char*)(0x42706294UL))
#define bFM4_MFS3_I2C_FCR0_FLST                *((volatile unsigned char*)(0x42706298UL))
#define bFM4_MFS3_I2C_FCR1_FSEL                *((volatile unsigned char*)(0x427062A0UL))
#define bFM4_MFS3_I2C_FCR1_FTIE                *((volatile unsigned char*)(0x427062A4UL))
#define bFM4_MFS3_I2C_FCR1_FDRQ                *((volatile unsigned char*)(0x427062A8UL))
#define bFM4_MFS3_I2C_FCR1_FRIIE               *((volatile unsigned char*)(0x427062ACUL))
#define bFM4_MFS3_I2C_FCR1_FLSTE               *((volatile unsigned char*)(0x427062B0UL))
#define bFM4_MFS3_I2C_FBYTE_FD0                *((volatile unsigned char*)(0x42706300UL))
#define bFM4_MFS3_I2C_FBYTE_FD1                *((volatile unsigned char*)(0x42706304UL))
#define bFM4_MFS3_I2C_FBYTE_FD2                *((volatile unsigned char*)(0x42706308UL))
#define bFM4_MFS3_I2C_FBYTE_FD3                *((volatile unsigned char*)(0x4270630CUL))
#define bFM4_MFS3_I2C_FBYTE_FD4                *((volatile unsigned char*)(0x42706310UL))
#define bFM4_MFS3_I2C_FBYTE_FD5                *((volatile unsigned char*)(0x42706314UL))
#define bFM4_MFS3_I2C_FBYTE_FD6                *((volatile unsigned char*)(0x42706318UL))
#define bFM4_MFS3_I2C_FBYTE_FD7                *((volatile unsigned char*)(0x4270631CUL))
#define bFM4_MFS3_I2C_FBYTE_FD8                *((volatile unsigned char*)(0x42706320UL))
#define bFM4_MFS3_I2C_FBYTE_FD9                *((volatile unsigned char*)(0x42706324UL))
#define bFM4_MFS3_I2C_FBYTE_FD10               *((volatile unsigned char*)(0x42706328UL))
#define bFM4_MFS3_I2C_FBYTE_FD11               *((volatile unsigned char*)(0x4270632CUL))
#define bFM4_MFS3_I2C_FBYTE_FD12               *((volatile unsigned char*)(0x42706330UL))
#define bFM4_MFS3_I2C_FBYTE_FD13               *((volatile unsigned char*)(0x42706334UL))
#define bFM4_MFS3_I2C_FBYTE_FD14               *((volatile unsigned char*)(0x42706338UL))
#define bFM4_MFS3_I2C_FBYTE_FD15               *((volatile unsigned char*)(0x4270633CUL))
#define bFM4_MFS3_I2C_FBYTE1_FD0               *((volatile unsigned char*)(0x42706300UL))
#define bFM4_MFS3_I2C_FBYTE1_FD1               *((volatile unsigned char*)(0x42706304UL))
#define bFM4_MFS3_I2C_FBYTE1_FD2               *((volatile unsigned char*)(0x42706308UL))
#define bFM4_MFS3_I2C_FBYTE1_FD3               *((volatile unsigned char*)(0x4270630CUL))
#define bFM4_MFS3_I2C_FBYTE1_FD4               *((volatile unsigned char*)(0x42706310UL))
#define bFM4_MFS3_I2C_FBYTE1_FD5               *((volatile unsigned char*)(0x42706314UL))
#define bFM4_MFS3_I2C_FBYTE1_FD6               *((volatile unsigned char*)(0x42706318UL))
#define bFM4_MFS3_I2C_FBYTE1_FD7               *((volatile unsigned char*)(0x4270631CUL))
#define bFM4_MFS3_I2C_FBYTE2_FD8               *((volatile unsigned char*)(0x42706320UL))
#define bFM4_MFS3_I2C_FBYTE2_FD9               *((volatile unsigned char*)(0x42706324UL))
#define bFM4_MFS3_I2C_FBYTE2_FD10              *((volatile unsigned char*)(0x42706328UL))
#define bFM4_MFS3_I2C_FBYTE2_FD11              *((volatile unsigned char*)(0x4270632CUL))
#define bFM4_MFS3_I2C_FBYTE2_FD12              *((volatile unsigned char*)(0x42706330UL))
#define bFM4_MFS3_I2C_FBYTE2_FD13              *((volatile unsigned char*)(0x42706334UL))
#define bFM4_MFS3_I2C_FBYTE2_FD14              *((volatile unsigned char*)(0x42706338UL))
#define bFM4_MFS3_I2C_FBYTE2_FD15              *((volatile unsigned char*)(0x4270633CUL))

/* MFS UART channel 4 registers */
#define bFM4_MFS4_UART_SMR_SOE                 *((volatile unsigned char*)(0x42708000UL))
#define bFM4_MFS4_UART_SMR_BDS                 *((volatile unsigned char*)(0x42708008UL))
#define bFM4_MFS4_UART_SMR_SBL                 *((volatile unsigned char*)(0x4270800CUL))
#define bFM4_MFS4_UART_SMR_WUCR                *((volatile unsigned char*)(0x42708010UL))
#define bFM4_MFS4_UART_SMR_MD0                 *((volatile unsigned char*)(0x42708014UL))
#define bFM4_MFS4_UART_SMR_MD1                 *((volatile unsigned char*)(0x42708018UL))
#define bFM4_MFS4_UART_SMR_MD2                 *((volatile unsigned char*)(0x4270801CUL))
#define bFM4_MFS4_UART_SCR_TXE                 *((volatile unsigned char*)(0x42708020UL))
#define bFM4_MFS4_UART_SCR_RXE                 *((volatile unsigned char*)(0x42708024UL))
#define bFM4_MFS4_UART_SCR_TBIE                *((volatile unsigned char*)(0x42708028UL))
#define bFM4_MFS4_UART_SCR_TIE                 *((volatile unsigned char*)(0x4270802CUL))
#define bFM4_MFS4_UART_SCR_RIE                 *((volatile unsigned char*)(0x42708030UL))
#define bFM4_MFS4_UART_SCR_UPCL                *((volatile unsigned char*)(0x4270803CUL))
#define bFM4_MFS4_UART_ESCR_L0                 *((volatile unsigned char*)(0x42708080UL))
#define bFM4_MFS4_UART_ESCR_L1                 *((volatile unsigned char*)(0x42708084UL))
#define bFM4_MFS4_UART_ESCR_L2                 *((volatile unsigned char*)(0x42708088UL))
#define bFM4_MFS4_UART_ESCR_P                  *((volatile unsigned char*)(0x4270808CUL))
#define bFM4_MFS4_UART_ESCR_PEN                *((volatile unsigned char*)(0x42708090UL))
#define bFM4_MFS4_UART_ESCR_INV                *((volatile unsigned char*)(0x42708094UL))
#define bFM4_MFS4_UART_ESCR_ESBL               *((volatile unsigned char*)(0x42708098UL))
#define bFM4_MFS4_UART_ESCR_FLWEN              *((volatile unsigned char*)(0x4270809CUL))
#define bFM4_MFS4_UART_SSR_TBI                 *((volatile unsigned char*)(0x427080A0UL))
#define bFM4_MFS4_UART_SSR_TDRE                *((volatile unsigned char*)(0x427080A4UL))
#define bFM4_MFS4_UART_SSR_RDRF                *((volatile unsigned char*)(0x427080A8UL))
#define bFM4_MFS4_UART_SSR_ORE                 *((volatile unsigned char*)(0x427080ACUL))
#define bFM4_MFS4_UART_SSR_FRE                 *((volatile unsigned char*)(0x427080B0UL))
#define bFM4_MFS4_UART_SSR_PE                  *((volatile unsigned char*)(0x427080B4UL))
#define bFM4_MFS4_UART_SSR_REC                 *((volatile unsigned char*)(0x427080BCUL))
#define bFM4_MFS4_UART_BGR_EXT                 *((volatile unsigned char*)(0x427081BCUL))
#define bFM4_MFS4_UART_BGR1_EXT                *((volatile unsigned char*)(0x427081BCUL))
#define bFM4_MFS4_UART_FCR_FE1                 *((volatile unsigned char*)(0x42708280UL))
#define bFM4_MFS4_UART_FCR_FE2                 *((volatile unsigned char*)(0x42708284UL))
#define bFM4_MFS4_UART_FCR_FCL1                *((volatile unsigned char*)(0x42708288UL))
#define bFM4_MFS4_UART_FCR_FCL2                *((volatile unsigned char*)(0x4270828CUL))
#define bFM4_MFS4_UART_FCR_FSET                *((volatile unsigned char*)(0x42708290UL))
#define bFM4_MFS4_UART_FCR_FLD                 *((volatile unsigned char*)(0x42708294UL))
#define bFM4_MFS4_UART_FCR_FLST                *((volatile unsigned char*)(0x42708298UL))
#define bFM4_MFS4_UART_FCR_FSEL                *((volatile unsigned char*)(0x427082A0UL))
#define bFM4_MFS4_UART_FCR_FTIE                *((volatile unsigned char*)(0x427082A4UL))
#define bFM4_MFS4_UART_FCR_FDRQ                *((volatile unsigned char*)(0x427082A8UL))
#define bFM4_MFS4_UART_FCR_FRIIE               *((volatile unsigned char*)(0x427082ACUL))
#define bFM4_MFS4_UART_FCR_FLSTE               *((volatile unsigned char*)(0x427082B0UL))
#define bFM4_MFS4_UART_FCR0_FE1                *((volatile unsigned char*)(0x42708280UL))
#define bFM4_MFS4_UART_FCR0_FE2                *((volatile unsigned char*)(0x42708284UL))
#define bFM4_MFS4_UART_FCR0_FCL1               *((volatile unsigned char*)(0x42708288UL))
#define bFM4_MFS4_UART_FCR0_FCL2               *((volatile unsigned char*)(0x4270828CUL))
#define bFM4_MFS4_UART_FCR0_FSET               *((volatile unsigned char*)(0x42708290UL))
#define bFM4_MFS4_UART_FCR0_FLD                *((volatile unsigned char*)(0x42708294UL))
#define bFM4_MFS4_UART_FCR0_FLST               *((volatile unsigned char*)(0x42708298UL))
#define bFM4_MFS4_UART_FCR1_FSEL               *((volatile unsigned char*)(0x427082A0UL))
#define bFM4_MFS4_UART_FCR1_FTIE               *((volatile unsigned char*)(0x427082A4UL))
#define bFM4_MFS4_UART_FCR1_FDRQ               *((volatile unsigned char*)(0x427082A8UL))
#define bFM4_MFS4_UART_FCR1_FRIIE              *((volatile unsigned char*)(0x427082ACUL))
#define bFM4_MFS4_UART_FCR1_FLSTE              *((volatile unsigned char*)(0x427082B0UL))
#define bFM4_MFS4_UART_FBYTE_FD0               *((volatile unsigned char*)(0x42708300UL))
#define bFM4_MFS4_UART_FBYTE_FD1               *((volatile unsigned char*)(0x42708304UL))
#define bFM4_MFS4_UART_FBYTE_FD2               *((volatile unsigned char*)(0x42708308UL))
#define bFM4_MFS4_UART_FBYTE_FD3               *((volatile unsigned char*)(0x4270830CUL))
#define bFM4_MFS4_UART_FBYTE_FD4               *((volatile unsigned char*)(0x42708310UL))
#define bFM4_MFS4_UART_FBYTE_FD5               *((volatile unsigned char*)(0x42708314UL))
#define bFM4_MFS4_UART_FBYTE_FD6               *((volatile unsigned char*)(0x42708318UL))
#define bFM4_MFS4_UART_FBYTE_FD7               *((volatile unsigned char*)(0x4270831CUL))
#define bFM4_MFS4_UART_FBYTE_FD8               *((volatile unsigned char*)(0x42708320UL))
#define bFM4_MFS4_UART_FBYTE_FD9               *((volatile unsigned char*)(0x42708324UL))
#define bFM4_MFS4_UART_FBYTE_FD10              *((volatile unsigned char*)(0x42708328UL))
#define bFM4_MFS4_UART_FBYTE_FD11              *((volatile unsigned char*)(0x4270832CUL))
#define bFM4_MFS4_UART_FBYTE_FD12              *((volatile unsigned char*)(0x42708330UL))
#define bFM4_MFS4_UART_FBYTE_FD13              *((volatile unsigned char*)(0x42708334UL))
#define bFM4_MFS4_UART_FBYTE_FD14              *((volatile unsigned char*)(0x42708338UL))
#define bFM4_MFS4_UART_FBYTE_FD15              *((volatile unsigned char*)(0x4270833CUL))
#define bFM4_MFS4_UART_FBYTE1_FD0              *((volatile unsigned char*)(0x42708300UL))
#define bFM4_MFS4_UART_FBYTE1_FD1              *((volatile unsigned char*)(0x42708304UL))
#define bFM4_MFS4_UART_FBYTE1_FD2              *((volatile unsigned char*)(0x42708308UL))
#define bFM4_MFS4_UART_FBYTE1_FD3              *((volatile unsigned char*)(0x4270830CUL))
#define bFM4_MFS4_UART_FBYTE1_FD4              *((volatile unsigned char*)(0x42708310UL))
#define bFM4_MFS4_UART_FBYTE1_FD5              *((volatile unsigned char*)(0x42708314UL))
#define bFM4_MFS4_UART_FBYTE1_FD6              *((volatile unsigned char*)(0x42708318UL))
#define bFM4_MFS4_UART_FBYTE1_FD7              *((volatile unsigned char*)(0x4270831CUL))
#define bFM4_MFS4_UART_FBYTE2_FD8              *((volatile unsigned char*)(0x42708320UL))
#define bFM4_MFS4_UART_FBYTE2_FD9              *((volatile unsigned char*)(0x42708324UL))
#define bFM4_MFS4_UART_FBYTE2_FD10             *((volatile unsigned char*)(0x42708328UL))
#define bFM4_MFS4_UART_FBYTE2_FD11             *((volatile unsigned char*)(0x4270832CUL))
#define bFM4_MFS4_UART_FBYTE2_FD12             *((volatile unsigned char*)(0x42708330UL))
#define bFM4_MFS4_UART_FBYTE2_FD13             *((volatile unsigned char*)(0x42708334UL))
#define bFM4_MFS4_UART_FBYTE2_FD14             *((volatile unsigned char*)(0x42708338UL))
#define bFM4_MFS4_UART_FBYTE2_FD15             *((volatile unsigned char*)(0x4270833CUL))

