MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C39H0AGV2000A/mcu.h
/* MFS UART channel 10 registers */
#define bFM4_MFS10_UART_SMR_SOE                *((volatile unsigned char*)(0x42714000UL))
#define bFM4_MFS10_UART_SMR_BDS                *((volatile unsigned char*)(0x42714008UL))
#define bFM4_MFS10_UART_SMR_SBL                *((volatile unsigned char*)(0x4271400CUL))
#define bFM4_MFS10_UART_SMR_WUCR               *((volatile unsigned char*)(0x42714010UL))
#define bFM4_MFS10_UART_SMR_MD0                *((volatile unsigned char*)(0x42714014UL))
#define bFM4_MFS10_UART_SMR_MD1                *((volatile unsigned char*)(0x42714018UL))
#define bFM4_MFS10_UART_SMR_MD2                *((volatile unsigned char*)(0x4271401CUL))
#define bFM4_MFS10_UART_SCR_TXE                *((volatile unsigned char*)(0x42714020UL))
#define bFM4_MFS10_UART_SCR_RXE                *((volatile unsigned char*)(0x42714024UL))
#define bFM4_MFS10_UART_SCR_TBIE               *((volatile unsigned char*)(0x42714028UL))
#define bFM4_MFS10_UART_SCR_TIE                *((volatile unsigned char*)(0x4271402CUL))
#define bFM4_MFS10_UART_SCR_RIE                *((volatile unsigned char*)(0x42714030UL))
#define bFM4_MFS10_UART_SCR_UPCL               *((volatile unsigned char*)(0x4271403CUL))
#define bFM4_MFS10_UART_ESCR_L0                *((volatile unsigned char*)(0x42714080UL))
#define bFM4_MFS10_UART_ESCR_L1                *((volatile unsigned char*)(0x42714084UL))
#define bFM4_MFS10_UART_ESCR_L2                *((volatile unsigned char*)(0x42714088UL))
#define bFM4_MFS10_UART_ESCR_P                 *((volatile unsigned char*)(0x4271408CUL))
#define bFM4_MFS10_UART_ESCR_PEN               *((volatile unsigned char*)(0x42714090UL))
#define bFM4_MFS10_UART_ESCR_INV               *((volatile unsigned char*)(0x42714094UL))
#define bFM4_MFS10_UART_ESCR_ESBL              *((volatile unsigned char*)(0x42714098UL))
#define bFM4_MFS10_UART_ESCR_FLWEN             *((volatile unsigned char*)(0x4271409CUL))
#define bFM4_MFS10_UART_SSR_TBI                *((volatile unsigned char*)(0x427140A0UL))
#define bFM4_MFS10_UART_SSR_TDRE               *((volatile unsigned char*)(0x427140A4UL))
#define bFM4_MFS10_UART_SSR_RDRF               *((volatile unsigned char*)(0x427140A8UL))
#define bFM4_MFS10_UART_SSR_ORE                *((volatile unsigned char*)(0x427140ACUL))
#define bFM4_MFS10_UART_SSR_FRE                *((volatile unsigned char*)(0x427140B0UL))
#define bFM4_MFS10_UART_SSR_PE                 *((volatile unsigned char*)(0x427140B4UL))
#define bFM4_MFS10_UART_SSR_REC                *((volatile unsigned char*)(0x427140BCUL))
#define bFM4_MFS10_UART_BGR_EXT                *((volatile unsigned char*)(0x427141BCUL))
#define bFM4_MFS10_UART_BGR1_EXT               *((volatile unsigned char*)(0x427141BCUL))
#define bFM4_MFS10_UART_FCR_FE1                *((volatile unsigned char*)(0x42714280UL))
#define bFM4_MFS10_UART_FCR_FE2                *((volatile unsigned char*)(0x42714284UL))
#define bFM4_MFS10_UART_FCR_FCL1               *((volatile unsigned char*)(0x42714288UL))
#define bFM4_MFS10_UART_FCR_FCL2               *((volatile unsigned char*)(0x4271428CUL))
#define bFM4_MFS10_UART_FCR_FSET               *((volatile unsigned char*)(0x42714290UL))
#define bFM4_MFS10_UART_FCR_FLD                *((volatile unsigned char*)(0x42714294UL))
#define bFM4_MFS10_UART_FCR_FLST               *((volatile unsigned char*)(0x42714298UL))
#define bFM4_MFS10_UART_FCR_FSEL               *((volatile unsigned char*)(0x427142A0UL))
#define bFM4_MFS10_UART_FCR_FTIE               *((volatile unsigned char*)(0x427142A4UL))
#define bFM4_MFS10_UART_FCR_FDRQ               *((volatile unsigned char*)(0x427142A8UL))
#define bFM4_MFS10_UART_FCR_FRIIE              *((volatile unsigned char*)(0x427142ACUL))
#define bFM4_MFS10_UART_FCR_FLSTE              *((volatile unsigned char*)(0x427142B0UL))
#define bFM4_MFS10_UART_FCR0_FE1               *((volatile unsigned char*)(0x42714280UL))
#define bFM4_MFS10_UART_FCR0_FE2               *((volatile unsigned char*)(0x42714284UL))
#define bFM4_MFS10_UART_FCR0_FCL1              *((volatile unsigned char*)(0x42714288UL))
#define bFM4_MFS10_UART_FCR0_FCL2              *((volatile unsigned char*)(0x4271428CUL))
#define bFM4_MFS10_UART_FCR0_FSET              *((volatile unsigned char*)(0x42714290UL))
#define bFM4_MFS10_UART_FCR0_FLD               *((volatile unsigned char*)(0x42714294UL))
#define bFM4_MFS10_UART_FCR0_FLST              *((volatile unsigned char*)(0x42714298UL))
#define bFM4_MFS10_UART_FCR1_FSEL              *((volatile unsigned char*)(0x427142A0UL))
#define bFM4_MFS10_UART_FCR1_FTIE              *((volatile unsigned char*)(0x427142A4UL))
#define bFM4_MFS10_UART_FCR1_FDRQ              *((volatile unsigned char*)(0x427142A8UL))
#define bFM4_MFS10_UART_FCR1_FRIIE             *((volatile unsigned char*)(0x427142ACUL))
#define bFM4_MFS10_UART_FCR1_FLSTE             *((volatile unsigned char*)(0x427142B0UL))
#define bFM4_MFS10_UART_FBYTE_FD0              *((volatile unsigned char*)(0x42714300UL))
#define bFM4_MFS10_UART_FBYTE_FD1              *((volatile unsigned char*)(0x42714304UL))
#define bFM4_MFS10_UART_FBYTE_FD2              *((volatile unsigned char*)(0x42714308UL))
#define bFM4_MFS10_UART_FBYTE_FD3              *((volatile unsigned char*)(0x4271430CUL))
#define bFM4_MFS10_UART_FBYTE_FD4              *((volatile unsigned char*)(0x42714310UL))
#define bFM4_MFS10_UART_FBYTE_FD5              *((volatile unsigned char*)(0x42714314UL))
#define bFM4_MFS10_UART_FBYTE_FD6              *((volatile unsigned char*)(0x42714318UL))
#define bFM4_MFS10_UART_FBYTE_FD7              *((volatile unsigned char*)(0x4271431CUL))
#define bFM4_MFS10_UART_FBYTE_FD8              *((volatile unsigned char*)(0x42714320UL))
#define bFM4_MFS10_UART_FBYTE_FD9              *((volatile unsigned char*)(0x42714324UL))
#define bFM4_MFS10_UART_FBYTE_FD10             *((volatile unsigned char*)(0x42714328UL))
#define bFM4_MFS10_UART_FBYTE_FD11             *((volatile unsigned char*)(0x4271432CUL))
#define bFM4_MFS10_UART_FBYTE_FD12             *((volatile unsigned char*)(0x42714330UL))
#define bFM4_MFS10_UART_FBYTE_FD13             *((volatile unsigned char*)(0x42714334UL))
#define bFM4_MFS10_UART_FBYTE_FD14             *((volatile unsigned char*)(0x42714338UL))
#define bFM4_MFS10_UART_FBYTE_FD15             *((volatile unsigned char*)(0x4271433CUL))
#define bFM4_MFS10_UART_FBYTE1_FD0             *((volatile unsigned char*)(0x42714300UL))
#define bFM4_MFS10_UART_FBYTE1_FD1             *((volatile unsigned char*)(0x42714304UL))
#define bFM4_MFS10_UART_FBYTE1_FD2             *((volatile unsigned char*)(0x42714308UL))
#define bFM4_MFS10_UART_FBYTE1_FD3             *((volatile unsigned char*)(0x4271430CUL))
#define bFM4_MFS10_UART_FBYTE1_FD4             *((volatile unsigned char*)(0x42714310UL))
#define bFM4_MFS10_UART_FBYTE1_FD5             *((volatile unsigned char*)(0x42714314UL))
#define bFM4_MFS10_UART_FBYTE1_FD6             *((volatile unsigned char*)(0x42714318UL))
#define bFM4_MFS10_UART_FBYTE1_FD7             *((volatile unsigned char*)(0x4271431CUL))
#define bFM4_MFS10_UART_FBYTE2_FD8             *((volatile unsigned char*)(0x42714320UL))
#define bFM4_MFS10_UART_FBYTE2_FD9             *((volatile unsigned char*)(0x42714324UL))
#define bFM4_MFS10_UART_FBYTE2_FD10            *((volatile unsigned char*)(0x42714328UL))
#define bFM4_MFS10_UART_FBYTE2_FD11            *((volatile unsigned char*)(0x4271432CUL))
#define bFM4_MFS10_UART_FBYTE2_FD12            *((volatile unsigned char*)(0x42714330UL))
#define bFM4_MFS10_UART_FBYTE2_FD13            *((volatile unsigned char*)(0x42714334UL))
#define bFM4_MFS10_UART_FBYTE2_FD14            *((volatile unsigned char*)(0x42714338UL))
#define bFM4_MFS10_UART_FBYTE2_FD15            *((volatile unsigned char*)(0x4271433CUL))

