MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C39H0AGV2000A/mcu.h
/* MFS CSIO channel 10 registers */
#define bFM4_MFS10_CSIO_SMR_SOE                *((volatile unsigned char*)(0x42714000UL))
#define bFM4_MFS10_CSIO_SMR_SCKE               *((volatile unsigned char*)(0x42714004UL))
#define bFM4_MFS10_CSIO_SMR_BDS                *((volatile unsigned char*)(0x42714008UL))
#define bFM4_MFS10_CSIO_SMR_SCINV              *((volatile unsigned char*)(0x4271400CUL))
#define bFM4_MFS10_CSIO_SMR_MD0                *((volatile unsigned char*)(0x42714014UL))
#define bFM4_MFS10_CSIO_SMR_MD1                *((volatile unsigned char*)(0x42714018UL))
#define bFM4_MFS10_CSIO_SMR_MD2                *((volatile unsigned char*)(0x4271401CUL))
#define bFM4_MFS10_CSIO_SCR_TXE                *((volatile unsigned char*)(0x42714020UL))
#define bFM4_MFS10_CSIO_SCR_RXE                *((volatile unsigned char*)(0x42714024UL))
#define bFM4_MFS10_CSIO_SCR_TBIE               *((volatile unsigned char*)(0x42714028UL))
#define bFM4_MFS10_CSIO_SCR_TIE                *((volatile unsigned char*)(0x4271402CUL))
#define bFM4_MFS10_CSIO_SCR_RIE                *((volatile unsigned char*)(0x42714030UL))
#define bFM4_MFS10_CSIO_SCR_SPI                *((volatile unsigned char*)(0x42714034UL))
#define bFM4_MFS10_CSIO_SCR_MS                 *((volatile unsigned char*)(0x42714038UL))
#define bFM4_MFS10_CSIO_SCR_UPCL               *((volatile unsigned char*)(0x4271403CUL))
#define bFM4_MFS10_CSIO_ESCR_L0                *((volatile unsigned char*)(0x42714080UL))
#define bFM4_MFS10_CSIO_ESCR_L1                *((volatile unsigned char*)(0x42714084UL))
#define bFM4_MFS10_CSIO_ESCR_L2                *((volatile unsigned char*)(0x42714088UL))
#define bFM4_MFS10_CSIO_ESCR_WT0               *((volatile unsigned char*)(0x4271408CUL))
#define bFM4_MFS10_CSIO_ESCR_WT1               *((volatile unsigned char*)(0x42714090UL))
#define bFM4_MFS10_CSIO_ESCR_CSFE              *((volatile unsigned char*)(0x42714094UL))
#define bFM4_MFS10_CSIO_ESCR_L3                *((volatile unsigned char*)(0x42714098UL))
#define bFM4_MFS10_CSIO_ESCR_SOP               *((volatile unsigned char*)(0x4271409CUL))
#define bFM4_MFS10_CSIO_SSR_TBI                *((volatile unsigned char*)(0x427140A0UL))
#define bFM4_MFS10_CSIO_SSR_TDRE               *((volatile unsigned char*)(0x427140A4UL))
#define bFM4_MFS10_CSIO_SSR_RDRF               *((volatile unsigned char*)(0x427140A8UL))
#define bFM4_MFS10_CSIO_SSR_ORE                *((volatile unsigned char*)(0x427140ACUL))
#define bFM4_MFS10_CSIO_SSR_AWC                *((volatile unsigned char*)(0x427140B0UL))
#define bFM4_MFS10_CSIO_SSR_REC                *((volatile unsigned char*)(0x427140BCUL))
#define bFM4_MFS10_CSIO_FCR_FE1                *((volatile unsigned char*)(0x42714280UL))
#define bFM4_MFS10_CSIO_FCR_FE2                *((volatile unsigned char*)(0x42714284UL))
#define bFM4_MFS10_CSIO_FCR_FCL1               *((volatile unsigned char*)(0x42714288UL))
#define bFM4_MFS10_CSIO_FCR_FCL2               *((volatile unsigned char*)(0x4271428CUL))
#define bFM4_MFS10_CSIO_FCR_FSET               *((volatile unsigned char*)(0x42714290UL))
#define bFM4_MFS10_CSIO_FCR_FLD                *((volatile unsigned char*)(0x42714294UL))
#define bFM4_MFS10_CSIO_FCR_FLST               *((volatile unsigned char*)(0x42714298UL))
#define bFM4_MFS10_CSIO_FCR_FSEL               *((volatile unsigned char*)(0x427142A0UL))
#define bFM4_MFS10_CSIO_FCR_FTIE               *((volatile unsigned char*)(0x427142A4UL))
#define bFM4_MFS10_CSIO_FCR_FDRQ               *((volatile unsigned char*)(0x427142A8UL))
#define bFM4_MFS10_CSIO_FCR_FRIIE              *((volatile unsigned char*)(0x427142ACUL))
#define bFM4_MFS10_CSIO_FCR_FLSTE              *((volatile unsigned char*)(0x427142B0UL))
#define bFM4_MFS10_CSIO_FCR0_FE1               *((volatile unsigned char*)(0x42714280UL))
#define bFM4_MFS10_CSIO_FCR0_FE2               *((volatile unsigned char*)(0x42714284UL))
#define bFM4_MFS10_CSIO_FCR0_FCL1              *((volatile unsigned char*)(0x42714288UL))
#define bFM4_MFS10_CSIO_FCR0_FCL2              *((volatile unsigned char*)(0x4271428CUL))
#define bFM4_MFS10_CSIO_FCR0_FSET              *((volatile unsigned char*)(0x42714290UL))
#define bFM4_MFS10_CSIO_FCR0_FLD               *((volatile unsigned char*)(0x42714294UL))
#define bFM4_MFS10_CSIO_FCR0_FLST              *((volatile unsigned char*)(0x42714298UL))
#define bFM4_MFS10_CSIO_FCR1_FSEL              *((volatile unsigned char*)(0x427142A0UL))
#define bFM4_MFS10_CSIO_FCR1_FTIE              *((volatile unsigned char*)(0x427142A4UL))
#define bFM4_MFS10_CSIO_FCR1_FDRQ              *((volatile unsigned char*)(0x427142A8UL))
#define bFM4_MFS10_CSIO_FCR1_FRIIE             *((volatile unsigned char*)(0x427142ACUL))
#define bFM4_MFS10_CSIO_FCR1_FLSTE             *((volatile unsigned char*)(0x427142B0UL))
#define bFM4_MFS10_CSIO_FBYTE_FD0              *((volatile unsigned char*)(0x42714300UL))
#define bFM4_MFS10_CSIO_FBYTE_FD1              *((volatile unsigned char*)(0x42714304UL))
#define bFM4_MFS10_CSIO_FBYTE_FD2              *((volatile unsigned char*)(0x42714308UL))
#define bFM4_MFS10_CSIO_FBYTE_FD3              *((volatile unsigned char*)(0x4271430CUL))
#define bFM4_MFS10_CSIO_FBYTE_FD4              *((volatile unsigned char*)(0x42714310UL))
#define bFM4_MFS10_CSIO_FBYTE_FD5              *((volatile unsigned char*)(0x42714314UL))
#define bFM4_MFS10_CSIO_FBYTE_FD6              *((volatile unsigned char*)(0x42714318UL))
#define bFM4_MFS10_CSIO_FBYTE_FD7              *((volatile unsigned char*)(0x4271431CUL))
#define bFM4_MFS10_CSIO_FBYTE_FD8              *((volatile unsigned char*)(0x42714320UL))
#define bFM4_MFS10_CSIO_FBYTE_FD9              *((volatile unsigned char*)(0x42714324UL))
#define bFM4_MFS10_CSIO_FBYTE_FD10             *((volatile unsigned char*)(0x42714328UL))
#define bFM4_MFS10_CSIO_FBYTE_FD11             *((volatile unsigned char*)(0x4271432CUL))
#define bFM4_MFS10_CSIO_FBYTE_FD12             *((volatile unsigned char*)(0x42714330UL))
#define bFM4_MFS10_CSIO_FBYTE_FD13             *((volatile unsigned char*)(0x42714334UL))
#define bFM4_MFS10_CSIO_FBYTE_FD14             *((volatile unsigned char*)(0x42714338UL))
#define bFM4_MFS10_CSIO_FBYTE_FD15             *((volatile unsigned char*)(0x4271433CUL))
#define bFM4_MFS10_CSIO_FBYTE1_FD0             *((volatile unsigned char*)(0x42714300UL))
#define bFM4_MFS10_CSIO_FBYTE1_FD1             *((volatile unsigned char*)(0x42714304UL))
#define bFM4_MFS10_CSIO_FBYTE1_FD2             *((volatile unsigned char*)(0x42714308UL))
#define bFM4_MFS10_CSIO_FBYTE1_FD3             *((volatile unsigned char*)(0x4271430CUL))
#define bFM4_MFS10_CSIO_FBYTE1_FD4             *((volatile unsigned char*)(0x42714310UL))
#define bFM4_MFS10_CSIO_FBYTE1_FD5             *((volatile unsigned char*)(0x42714314UL))
#define bFM4_MFS10_CSIO_FBYTE1_FD6             *((volatile unsigned char*)(0x42714318UL))
#define bFM4_MFS10_CSIO_FBYTE1_FD7             *((volatile unsigned char*)(0x4271431CUL))
#define bFM4_MFS10_CSIO_FBYTE2_FD8             *((volatile unsigned char*)(0x42714320UL))
#define bFM4_MFS10_CSIO_FBYTE2_FD9             *((volatile unsigned char*)(0x42714324UL))
#define bFM4_MFS10_CSIO_FBYTE2_FD10            *((volatile unsigned char*)(0x42714328UL))
#define bFM4_MFS10_CSIO_FBYTE2_FD11            *((volatile unsigned char*)(0x4271432CUL))
#define bFM4_MFS10_CSIO_FBYTE2_FD12            *((volatile unsigned char*)(0x42714330UL))
#define bFM4_MFS10_CSIO_FBYTE2_FD13            *((volatile unsigned char*)(0x42714334UL))
#define bFM4_MFS10_CSIO_FBYTE2_FD14            *((volatile unsigned char*)(0x42714338UL))
#define bFM4_MFS10_CSIO_FBYTE2_FD15            *((volatile unsigned char*)(0x4271433CUL))
#define bFM4_MFS10_CSIO_SCSTR10_CSHD0          *((volatile unsigned char*)(0x42714380UL))
#define bFM4_MFS10_CSIO_SCSTR10_CSHD1          *((volatile unsigned char*)(0x42714384UL))
#define bFM4_MFS10_CSIO_SCSTR10_CSHD2          *((volatile unsigned char*)(0x42714388UL))
#define bFM4_MFS10_CSIO_SCSTR10_CSHD3          *((volatile unsigned char*)(0x4271438CUL))
#define bFM4_MFS10_CSIO_SCSTR10_CSHD4          *((volatile unsigned char*)(0x42714390UL))
#define bFM4_MFS10_CSIO_SCSTR10_CSHD5          *((volatile unsigned char*)(0x42714394UL))
#define bFM4_MFS10_CSIO_SCSTR10_CSHD6          *((volatile unsigned char*)(0x42714398UL))
#define bFM4_MFS10_CSIO_SCSTR10_CSHD7          *((volatile unsigned char*)(0x4271439CUL))
#define bFM4_MFS10_CSIO_SCSTR10_CSSU0          *((volatile unsigned char*)(0x427143A0UL))
#define bFM4_MFS10_CSIO_SCSTR10_CSSU1          *((volatile unsigned char*)(0x427143A4UL))
#define bFM4_MFS10_CSIO_SCSTR10_CSSU2          *((volatile unsigned char*)(0x427143A8UL))
#define bFM4_MFS10_CSIO_SCSTR10_CSSU3          *((volatile unsigned char*)(0x427143ACUL))
#define bFM4_MFS10_CSIO_SCSTR10_CSSU4          *((volatile unsigned char*)(0x427143B0UL))
#define bFM4_MFS10_CSIO_SCSTR10_CSSU5          *((volatile unsigned char*)(0x427143B4UL))
#define bFM4_MFS10_CSIO_SCSTR10_CSSU6          *((volatile unsigned char*)(0x427143B8UL))
#define bFM4_MFS10_CSIO_SCSTR10_CSSU7          *((volatile unsigned char*)(0x427143BCUL))
#define bFM4_MFS10_CSIO_SCSTR32_CSDS0          *((volatile unsigned char*)(0x42714400UL))
#define bFM4_MFS10_CSIO_SCSTR32_CSDS1          *((volatile unsigned char*)(0x42714404UL))
#define bFM4_MFS10_CSIO_SCSTR32_CSDS2          *((volatile unsigned char*)(0x42714408UL))
#define bFM4_MFS10_CSIO_SCSTR32_CSDS3          *((volatile unsigned char*)(0x4271440CUL))
#define bFM4_MFS10_CSIO_SCSTR32_CSDS4          *((volatile unsigned char*)(0x42714410UL))
#define bFM4_MFS10_CSIO_SCSTR32_CSDS5          *((volatile unsigned char*)(0x42714414UL))
#define bFM4_MFS10_CSIO_SCSTR32_CSDS6          *((volatile unsigned char*)(0x42714418UL))
#define bFM4_MFS10_CSIO_SCSTR32_CSDS7          *((volatile unsigned char*)(0x4271441CUL))
#define bFM4_MFS10_CSIO_SCSTR32_CSDS8          *((volatile unsigned char*)(0x42714420UL))
#define bFM4_MFS10_CSIO_SCSTR32_CSDS9          *((volatile unsigned char*)(0x42714424UL))
#define bFM4_MFS10_CSIO_SCSTR32_CSDS10         *((volatile unsigned char*)(0x42714428UL))
#define bFM4_MFS10_CSIO_SCSTR32_CSDS11         *((volatile unsigned char*)(0x4271442CUL))
#define bFM4_MFS10_CSIO_SCSTR32_CSDS12         *((volatile unsigned char*)(0x42714430UL))
#define bFM4_MFS10_CSIO_SCSTR32_CSDS13         *((volatile unsigned char*)(0x42714434UL))
#define bFM4_MFS10_CSIO_SCSTR32_CSDS14         *((volatile unsigned char*)(0x42714438UL))
#define bFM4_MFS10_CSIO_SCSTR32_CSDS15         *((volatile unsigned char*)(0x4271443CUL))
#define bFM4_MFS10_CSIO_SACSR_TMRE             *((volatile unsigned char*)(0x42714480UL))
#define bFM4_MFS10_CSIO_SACSR_TDIV0            *((volatile unsigned char*)(0x42714484UL))
#define bFM4_MFS10_CSIO_SACSR_TDIV1            *((volatile unsigned char*)(0x42714488UL))
#define bFM4_MFS10_CSIO_SACSR_TDIV2            *((volatile unsigned char*)(0x4271448CUL))
#define bFM4_MFS10_CSIO_SACSR_TDIV3            *((volatile unsigned char*)(0x42714490UL))
#define bFM4_MFS10_CSIO_SACSR_TSYNE            *((volatile unsigned char*)(0x42714498UL))
#define bFM4_MFS10_CSIO_SACSR_TINTE            *((volatile unsigned char*)(0x4271449CUL))
#define bFM4_MFS10_CSIO_SACSR_TINT             *((volatile unsigned char*)(0x427144A0UL))
#define bFM4_MFS10_CSIO_SACSR_CSE              *((volatile unsigned char*)(0x427144ACUL))
#define bFM4_MFS10_CSIO_SACSR_CSEIE            *((volatile unsigned char*)(0x427144B0UL))
#define bFM4_MFS10_CSIO_SACSR_TBEEN            *((volatile unsigned char*)(0x427144B4UL))
#define bFM4_MFS10_CSIO_STMR_TM0               *((volatile unsigned char*)(0x42714500UL))
#define bFM4_MFS10_CSIO_STMR_TM1               *((volatile unsigned char*)(0x42714504UL))
#define bFM4_MFS10_CSIO_STMR_TM2               *((volatile unsigned char*)(0x42714508UL))
#define bFM4_MFS10_CSIO_STMR_TM3               *((volatile unsigned char*)(0x4271450CUL))
#define bFM4_MFS10_CSIO_STMR_TM4               *((volatile unsigned char*)(0x42714510UL))
#define bFM4_MFS10_CSIO_STMR_TM5               *((volatile unsigned char*)(0x42714514UL))
#define bFM4_MFS10_CSIO_STMR_TM6               *((volatile unsigned char*)(0x42714518UL))
#define bFM4_MFS10_CSIO_STMR_TM7               *((volatile unsigned char*)(0x4271451CUL))
#define bFM4_MFS10_CSIO_STMR_TM8               *((volatile unsigned char*)(0x42714520UL))
#define bFM4_MFS10_CSIO_STMR_TM9               *((volatile unsigned char*)(0x42714524UL))
#define bFM4_MFS10_CSIO_STMR_TM10              *((volatile unsigned char*)(0x42714528UL))
#define bFM4_MFS10_CSIO_STMR_TM11              *((volatile unsigned char*)(0x4271452CUL))
#define bFM4_MFS10_CSIO_STMR_TM12              *((volatile unsigned char*)(0x42714530UL))
#define bFM4_MFS10_CSIO_STMR_TM13              *((volatile unsigned char*)(0x42714534UL))
#define bFM4_MFS10_CSIO_STMR_TM14              *((volatile unsigned char*)(0x42714538UL))
#define bFM4_MFS10_CSIO_STMR_TM15              *((volatile unsigned char*)(0x4271453CUL))
#define bFM4_MFS10_CSIO_STMCR_TC0              *((volatile unsigned char*)(0x42714580UL))
#define bFM4_MFS10_CSIO_STMCR_TC1              *((volatile unsigned char*)(0x42714584UL))
#define bFM4_MFS10_CSIO_STMCR_TC2              *((volatile unsigned char*)(0x42714588UL))
#define bFM4_MFS10_CSIO_STMCR_TC3              *((volatile unsigned char*)(0x4271458CUL))
#define bFM4_MFS10_CSIO_STMCR_TC4              *((volatile unsigned char*)(0x42714590UL))
#define bFM4_MFS10_CSIO_STMCR_TC5              *((volatile unsigned char*)(0x42714594UL))
#define bFM4_MFS10_CSIO_STMCR_TC6              *((volatile unsigned char*)(0x42714598UL))
#define bFM4_MFS10_CSIO_STMCR_TC7              *((volatile unsigned char*)(0x4271459CUL))
#define bFM4_MFS10_CSIO_STMCR_TC8              *((volatile unsigned char*)(0x427145A0UL))
#define bFM4_MFS10_CSIO_STMCR_TC9              *((volatile unsigned char*)(0x427145A4UL))
#define bFM4_MFS10_CSIO_STMCR_TC10             *((volatile unsigned char*)(0x427145A8UL))
#define bFM4_MFS10_CSIO_STMCR_TC11             *((volatile unsigned char*)(0x427145ACUL))
#define bFM4_MFS10_CSIO_STMCR_TC12             *((volatile unsigned char*)(0x427145B0UL))
#define bFM4_MFS10_CSIO_STMCR_TC13             *((volatile unsigned char*)(0x427145B4UL))
#define bFM4_MFS10_CSIO_STMCR_TC14             *((volatile unsigned char*)(0x427145B8UL))
#define bFM4_MFS10_CSIO_STMCR_TC15             *((volatile unsigned char*)(0x427145BCUL))
#define bFM4_MFS10_CSIO_SCSCR_CSOE             *((volatile unsigned char*)(0x42714600UL))
#define bFM4_MFS10_CSIO_SCSCR_CSEN0            *((volatile unsigned char*)(0x42714604UL))
#define bFM4_MFS10_CSIO_SCSCR_CSEN1            *((volatile unsigned char*)(0x42714608UL))
#define bFM4_MFS10_CSIO_SCSCR_CSEN2            *((volatile unsigned char*)(0x4271460CUL))
#define bFM4_MFS10_CSIO_SCSCR_CSEN3            *((volatile unsigned char*)(0x42714610UL))
#define bFM4_MFS10_CSIO_SCSCR_CSLVL            *((volatile unsigned char*)(0x42714614UL))
#define bFM4_MFS10_CSIO_SCSCR_CDIV0            *((volatile unsigned char*)(0x42714618UL))
#define bFM4_MFS10_CSIO_SCSCR_CDIV1            *((volatile unsigned char*)(0x4271461CUL))
#define bFM4_MFS10_CSIO_SCSCR_CDIV2            *((volatile unsigned char*)(0x42714620UL))
#define bFM4_MFS10_CSIO_SCSCR_SCAM             *((volatile unsigned char*)(0x42714624UL))
#define bFM4_MFS10_CSIO_SCSCR_SCD0             *((volatile unsigned char*)(0x42714628UL))
#define bFM4_MFS10_CSIO_SCSCR_SCD1             *((volatile unsigned char*)(0x4271462CUL))
#define bFM4_MFS10_CSIO_SCSCR_SED0             *((volatile unsigned char*)(0x42714630UL))
#define bFM4_MFS10_CSIO_SCSCR_SED1             *((volatile unsigned char*)(0x42714634UL))
#define bFM4_MFS10_CSIO_SCSCR_SST0             *((volatile unsigned char*)(0x42714638UL))
#define bFM4_MFS10_CSIO_SCSCR_SST1             *((volatile unsigned char*)(0x4271463CUL))
#define bFM4_MFS10_CSIO_SCSFR0_CS1L0           *((volatile unsigned char*)(0x42714680UL))
#define bFM4_MFS10_CSIO_SCSFR0_CS1L1           *((volatile unsigned char*)(0x42714684UL))
#define bFM4_MFS10_CSIO_SCSFR0_CS1L2           *((volatile unsigned char*)(0x42714688UL))
#define bFM4_MFS10_CSIO_SCSFR0_CS1L3           *((volatile unsigned char*)(0x4271468CUL))
#define bFM4_MFS10_CSIO_SCSFR0_CS1L4           *((volatile unsigned char*)(0x42714690UL))
#define bFM4_MFS10_CSIO_SCSFR0_CS1SPI          *((volatile unsigned char*)(0x42714694UL))
#define bFM4_MFS10_CSIO_SCSFR0_CS1SCINV        *((volatile unsigned char*)(0x42714698UL))
#define bFM4_MFS10_CSIO_SCSFR0_CS1CSLVL        *((volatile unsigned char*)(0x4271469CUL))
#define bFM4_MFS10_CSIO_SCSFR1_CS2L0           *((volatile unsigned char*)(0x427146A0UL))
#define bFM4_MFS10_CSIO_SCSFR1_CS2L1           *((volatile unsigned char*)(0x427146A4UL))
#define bFM4_MFS10_CSIO_SCSFR1_CS2L2           *((volatile unsigned char*)(0x427146A8UL))
#define bFM4_MFS10_CSIO_SCSFR1_CS2L3           *((volatile unsigned char*)(0x427146ACUL))
#define bFM4_MFS10_CSIO_SCSFR1_CS2L4           *((volatile unsigned char*)(0x427146B0UL))
#define bFM4_MFS10_CSIO_SCSFR1_CS2SPI          *((volatile unsigned char*)(0x427146B4UL))
#define bFM4_MFS10_CSIO_SCSFR1_CS2SCINV        *((volatile unsigned char*)(0x427146B8UL))
#define bFM4_MFS10_CSIO_SCSFR1_CS2CSLVL        *((volatile unsigned char*)(0x427146BCUL))
#define bFM4_MFS10_CSIO_SCSFR2_CS3L0           *((volatile unsigned char*)(0x42714700UL))
#define bFM4_MFS10_CSIO_SCSFR2_CS3L1           *((volatile unsigned char*)(0x42714704UL))
#define bFM4_MFS10_CSIO_SCSFR2_CS3L2           *((volatile unsigned char*)(0x42714708UL))
#define bFM4_MFS10_CSIO_SCSFR2_CS3L3           *((volatile unsigned char*)(0x4271470CUL))
#define bFM4_MFS10_CSIO_SCSFR2_CS3L4           *((volatile unsigned char*)(0x42714710UL))
#define bFM4_MFS10_CSIO_SCSFR2_CS3SPI          *((volatile unsigned char*)(0x42714714UL))
#define bFM4_MFS10_CSIO_SCSFR2_CS3SCINV        *((volatile unsigned char*)(0x42714718UL))
#define bFM4_MFS10_CSIO_SCSFR2_CS3CSLVL        *((volatile unsigned char*)(0x4271471CUL))

