MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2C39H0AGV2000A/mcu.h
/* MFS CSIO channel 15 registers */
#define bFM4_MFS15_CSIO_SMR_SOE                *((volatile unsigned char*)(0x4271E000UL))
#define bFM4_MFS15_CSIO_SMR_SCKE               *((volatile unsigned char*)(0x4271E004UL))
#define bFM4_MFS15_CSIO_SMR_BDS                *((volatile unsigned char*)(0x4271E008UL))
#define bFM4_MFS15_CSIO_SMR_SCINV              *((volatile unsigned char*)(0x4271E00CUL))
#define bFM4_MFS15_CSIO_SMR_MD0                *((volatile unsigned char*)(0x4271E014UL))
#define bFM4_MFS15_CSIO_SMR_MD1                *((volatile unsigned char*)(0x4271E018UL))
#define bFM4_MFS15_CSIO_SMR_MD2                *((volatile unsigned char*)(0x4271E01CUL))
#define bFM4_MFS15_CSIO_SCR_TXE                *((volatile unsigned char*)(0x4271E020UL))
#define bFM4_MFS15_CSIO_SCR_RXE                *((volatile unsigned char*)(0x4271E024UL))
#define bFM4_MFS15_CSIO_SCR_TBIE               *((volatile unsigned char*)(0x4271E028UL))
#define bFM4_MFS15_CSIO_SCR_TIE                *((volatile unsigned char*)(0x4271E02CUL))
#define bFM4_MFS15_CSIO_SCR_RIE                *((volatile unsigned char*)(0x4271E030UL))
#define bFM4_MFS15_CSIO_SCR_SPI                *((volatile unsigned char*)(0x4271E034UL))
#define bFM4_MFS15_CSIO_SCR_MS                 *((volatile unsigned char*)(0x4271E038UL))
#define bFM4_MFS15_CSIO_SCR_UPCL               *((volatile unsigned char*)(0x4271E03CUL))
#define bFM4_MFS15_CSIO_ESCR_L0                *((volatile unsigned char*)(0x4271E080UL))
#define bFM4_MFS15_CSIO_ESCR_L1                *((volatile unsigned char*)(0x4271E084UL))
#define bFM4_MFS15_CSIO_ESCR_L2                *((volatile unsigned char*)(0x4271E088UL))
#define bFM4_MFS15_CSIO_ESCR_WT0               *((volatile unsigned char*)(0x4271E08CUL))
#define bFM4_MFS15_CSIO_ESCR_WT1               *((volatile unsigned char*)(0x4271E090UL))
#define bFM4_MFS15_CSIO_ESCR_CSFE              *((volatile unsigned char*)(0x4271E094UL))
#define bFM4_MFS15_CSIO_ESCR_L3                *((volatile unsigned char*)(0x4271E098UL))
#define bFM4_MFS15_CSIO_ESCR_SOP               *((volatile unsigned char*)(0x4271E09CUL))
#define bFM4_MFS15_CSIO_SSR_TBI                *((volatile unsigned char*)(0x4271E0A0UL))
#define bFM4_MFS15_CSIO_SSR_TDRE               *((volatile unsigned char*)(0x4271E0A4UL))
#define bFM4_MFS15_CSIO_SSR_RDRF               *((volatile unsigned char*)(0x4271E0A8UL))
#define bFM4_MFS15_CSIO_SSR_ORE                *((volatile unsigned char*)(0x4271E0ACUL))
#define bFM4_MFS15_CSIO_SSR_AWC                *((volatile unsigned char*)(0x4271E0B0UL))
#define bFM4_MFS15_CSIO_SSR_REC                *((volatile unsigned char*)(0x4271E0BCUL))
#define bFM4_MFS15_CSIO_FCR_FE1                *((volatile unsigned char*)(0x4271E280UL))
#define bFM4_MFS15_CSIO_FCR_FE2                *((volatile unsigned char*)(0x4271E284UL))
#define bFM4_MFS15_CSIO_FCR_FCL1               *((volatile unsigned char*)(0x4271E288UL))
#define bFM4_MFS15_CSIO_FCR_FCL2               *((volatile unsigned char*)(0x4271E28CUL))
#define bFM4_MFS15_CSIO_FCR_FSET               *((volatile unsigned char*)(0x4271E290UL))
#define bFM4_MFS15_CSIO_FCR_FLD                *((volatile unsigned char*)(0x4271E294UL))
#define bFM4_MFS15_CSIO_FCR_FLST               *((volatile unsigned char*)(0x4271E298UL))
#define bFM4_MFS15_CSIO_FCR_FSEL               *((volatile unsigned char*)(0x4271E2A0UL))
#define bFM4_MFS15_CSIO_FCR_FTIE               *((volatile unsigned char*)(0x4271E2A4UL))
#define bFM4_MFS15_CSIO_FCR_FDRQ               *((volatile unsigned char*)(0x4271E2A8UL))
#define bFM4_MFS15_CSIO_FCR_FRIIE              *((volatile unsigned char*)(0x4271E2ACUL))
#define bFM4_MFS15_CSIO_FCR_FLSTE              *((volatile unsigned char*)(0x4271E2B0UL))
#define bFM4_MFS15_CSIO_FCR0_FE1               *((volatile unsigned char*)(0x4271E280UL))
#define bFM4_MFS15_CSIO_FCR0_FE2               *((volatile unsigned char*)(0x4271E284UL))
#define bFM4_MFS15_CSIO_FCR0_FCL1              *((volatile unsigned char*)(0x4271E288UL))
#define bFM4_MFS15_CSIO_FCR0_FCL2              *((volatile unsigned char*)(0x4271E28CUL))
#define bFM4_MFS15_CSIO_FCR0_FSET              *((volatile unsigned char*)(0x4271E290UL))
#define bFM4_MFS15_CSIO_FCR0_FLD               *((volatile unsigned char*)(0x4271E294UL))
#define bFM4_MFS15_CSIO_FCR0_FLST              *((volatile unsigned char*)(0x4271E298UL))
#define bFM4_MFS15_CSIO_FCR1_FSEL              *((volatile unsigned char*)(0x4271E2A0UL))
#define bFM4_MFS15_CSIO_FCR1_FTIE              *((volatile unsigned char*)(0x4271E2A4UL))
#define bFM4_MFS15_CSIO_FCR1_FDRQ              *((volatile unsigned char*)(0x4271E2A8UL))
#define bFM4_MFS15_CSIO_FCR1_FRIIE             *((volatile unsigned char*)(0x4271E2ACUL))
#define bFM4_MFS15_CSIO_FCR1_FLSTE             *((volatile unsigned char*)(0x4271E2B0UL))
#define bFM4_MFS15_CSIO_FBYTE_FD0              *((volatile unsigned char*)(0x4271E300UL))
#define bFM4_MFS15_CSIO_FBYTE_FD1              *((volatile unsigned char*)(0x4271E304UL))
#define bFM4_MFS15_CSIO_FBYTE_FD2              *((volatile unsigned char*)(0x4271E308UL))
#define bFM4_MFS15_CSIO_FBYTE_FD3              *((volatile unsigned char*)(0x4271E30CUL))
#define bFM4_MFS15_CSIO_FBYTE_FD4              *((volatile unsigned char*)(0x4271E310UL))
#define bFM4_MFS15_CSIO_FBYTE_FD5              *((volatile unsigned char*)(0x4271E314UL))
#define bFM4_MFS15_CSIO_FBYTE_FD6              *((volatile unsigned char*)(0x4271E318UL))
#define bFM4_MFS15_CSIO_FBYTE_FD7              *((volatile unsigned char*)(0x4271E31CUL))
#define bFM4_MFS15_CSIO_FBYTE_FD8              *((volatile unsigned char*)(0x4271E320UL))
#define bFM4_MFS15_CSIO_FBYTE_FD9              *((volatile unsigned char*)(0x4271E324UL))
#define bFM4_MFS15_CSIO_FBYTE_FD10             *((volatile unsigned char*)(0x4271E328UL))
#define bFM4_MFS15_CSIO_FBYTE_FD11             *((volatile unsigned char*)(0x4271E32CUL))
#define bFM4_MFS15_CSIO_FBYTE_FD12             *((volatile unsigned char*)(0x4271E330UL))
#define bFM4_MFS15_CSIO_FBYTE_FD13             *((volatile unsigned char*)(0x4271E334UL))
#define bFM4_MFS15_CSIO_FBYTE_FD14             *((volatile unsigned char*)(0x4271E338UL))
#define bFM4_MFS15_CSIO_FBYTE_FD15             *((volatile unsigned char*)(0x4271E33CUL))
#define bFM4_MFS15_CSIO_FBYTE1_FD0             *((volatile unsigned char*)(0x4271E300UL))
#define bFM4_MFS15_CSIO_FBYTE1_FD1             *((volatile unsigned char*)(0x4271E304UL))
#define bFM4_MFS15_CSIO_FBYTE1_FD2             *((volatile unsigned char*)(0x4271E308UL))
#define bFM4_MFS15_CSIO_FBYTE1_FD3             *((volatile unsigned char*)(0x4271E30CUL))
#define bFM4_MFS15_CSIO_FBYTE1_FD4             *((volatile unsigned char*)(0x4271E310UL))
#define bFM4_MFS15_CSIO_FBYTE1_FD5             *((volatile unsigned char*)(0x4271E314UL))
#define bFM4_MFS15_CSIO_FBYTE1_FD6             *((volatile unsigned char*)(0x4271E318UL))
#define bFM4_MFS15_CSIO_FBYTE1_FD7             *((volatile unsigned char*)(0x4271E31CUL))
#define bFM4_MFS15_CSIO_FBYTE2_FD8             *((volatile unsigned char*)(0x4271E320UL))
#define bFM4_MFS15_CSIO_FBYTE2_FD9             *((volatile unsigned char*)(0x4271E324UL))
#define bFM4_MFS15_CSIO_FBYTE2_FD10            *((volatile unsigned char*)(0x4271E328UL))
#define bFM4_MFS15_CSIO_FBYTE2_FD11            *((volatile unsigned char*)(0x4271E32CUL))
#define bFM4_MFS15_CSIO_FBYTE2_FD12            *((volatile unsigned char*)(0x4271E330UL))
#define bFM4_MFS15_CSIO_FBYTE2_FD13            *((volatile unsigned char*)(0x4271E334UL))
#define bFM4_MFS15_CSIO_FBYTE2_FD14            *((volatile unsigned char*)(0x4271E338UL))
#define bFM4_MFS15_CSIO_FBYTE2_FD15            *((volatile unsigned char*)(0x4271E33CUL))
#define bFM4_MFS15_CSIO_SCSTR10_CSHD0          *((volatile unsigned char*)(0x4271E380UL))
#define bFM4_MFS15_CSIO_SCSTR10_CSHD1          *((volatile unsigned char*)(0x4271E384UL))
#define bFM4_MFS15_CSIO_SCSTR10_CSHD2          *((volatile unsigned char*)(0x4271E388UL))
#define bFM4_MFS15_CSIO_SCSTR10_CSHD3          *((volatile unsigned char*)(0x4271E38CUL))
#define bFM4_MFS15_CSIO_SCSTR10_CSHD4          *((volatile unsigned char*)(0x4271E390UL))
#define bFM4_MFS15_CSIO_SCSTR10_CSHD5          *((volatile unsigned char*)(0x4271E394UL))
#define bFM4_MFS15_CSIO_SCSTR10_CSHD6          *((volatile unsigned char*)(0x4271E398UL))
#define bFM4_MFS15_CSIO_SCSTR10_CSHD7          *((volatile unsigned char*)(0x4271E39CUL))
#define bFM4_MFS15_CSIO_SCSTR10_CSSU0          *((volatile unsigned char*)(0x4271E3A0UL))
#define bFM4_MFS15_CSIO_SCSTR10_CSSU1          *((volatile unsigned char*)(0x4271E3A4UL))
#define bFM4_MFS15_CSIO_SCSTR10_CSSU2          *((volatile unsigned char*)(0x4271E3A8UL))
#define bFM4_MFS15_CSIO_SCSTR10_CSSU3          *((volatile unsigned char*)(0x4271E3ACUL))
#define bFM4_MFS15_CSIO_SCSTR10_CSSU4          *((volatile unsigned char*)(0x4271E3B0UL))
#define bFM4_MFS15_CSIO_SCSTR10_CSSU5          *((volatile unsigned char*)(0x4271E3B4UL))
#define bFM4_MFS15_CSIO_SCSTR10_CSSU6          *((volatile unsigned char*)(0x4271E3B8UL))
#define bFM4_MFS15_CSIO_SCSTR10_CSSU7          *((volatile unsigned char*)(0x4271E3BCUL))
#define bFM4_MFS15_CSIO_SCSTR32_CSDS0          *((volatile unsigned char*)(0x4271E400UL))
#define bFM4_MFS15_CSIO_SCSTR32_CSDS1          *((volatile unsigned char*)(0x4271E404UL))
#define bFM4_MFS15_CSIO_SCSTR32_CSDS2          *((volatile unsigned char*)(0x4271E408UL))
#define bFM4_MFS15_CSIO_SCSTR32_CSDS3          *((volatile unsigned char*)(0x4271E40CUL))
#define bFM4_MFS15_CSIO_SCSTR32_CSDS4          *((volatile unsigned char*)(0x4271E410UL))
#define bFM4_MFS15_CSIO_SCSTR32_CSDS5          *((volatile unsigned char*)(0x4271E414UL))
#define bFM4_MFS15_CSIO_SCSTR32_CSDS6          *((volatile unsigned char*)(0x4271E418UL))
#define bFM4_MFS15_CSIO_SCSTR32_CSDS7          *((volatile unsigned char*)(0x4271E41CUL))
#define bFM4_MFS15_CSIO_SCSTR32_CSDS8          *((volatile unsigned char*)(0x4271E420UL))
#define bFM4_MFS15_CSIO_SCSTR32_CSDS9          *((volatile unsigned char*)(0x4271E424UL))
#define bFM4_MFS15_CSIO_SCSTR32_CSDS10         *((volatile unsigned char*)(0x4271E428UL))
#define bFM4_MFS15_CSIO_SCSTR32_CSDS11         *((volatile unsigned char*)(0x4271E42CUL))
#define bFM4_MFS15_CSIO_SCSTR32_CSDS12         *((volatile unsigned char*)(0x4271E430UL))
#define bFM4_MFS15_CSIO_SCSTR32_CSDS13         *((volatile unsigned char*)(0x4271E434UL))
#define bFM4_MFS15_CSIO_SCSTR32_CSDS14         *((volatile unsigned char*)(0x4271E438UL))
#define bFM4_MFS15_CSIO_SCSTR32_CSDS15         *((volatile unsigned char*)(0x4271E43CUL))
#define bFM4_MFS15_CSIO_SACSR_TMRE             *((volatile unsigned char*)(0x4271E480UL))
#define bFM4_MFS15_CSIO_SACSR_TDIV0            *((volatile unsigned char*)(0x4271E484UL))
#define bFM4_MFS15_CSIO_SACSR_TDIV1            *((volatile unsigned char*)(0x4271E488UL))
#define bFM4_MFS15_CSIO_SACSR_TDIV2            *((volatile unsigned char*)(0x4271E48CUL))
#define bFM4_MFS15_CSIO_SACSR_TDIV3            *((volatile unsigned char*)(0x4271E490UL))
#define bFM4_MFS15_CSIO_SACSR_TSYNE            *((volatile unsigned char*)(0x4271E498UL))
#define bFM4_MFS15_CSIO_SACSR_TINTE            *((volatile unsigned char*)(0x4271E49CUL))
#define bFM4_MFS15_CSIO_SACSR_TINT             *((volatile unsigned char*)(0x4271E4A0UL))
#define bFM4_MFS15_CSIO_SACSR_CSE              *((volatile unsigned char*)(0x4271E4ACUL))
#define bFM4_MFS15_CSIO_SACSR_CSEIE            *((volatile unsigned char*)(0x4271E4B0UL))
#define bFM4_MFS15_CSIO_SACSR_TBEEN            *((volatile unsigned char*)(0x4271E4B4UL))
#define bFM4_MFS15_CSIO_STMR_TM0               *((volatile unsigned char*)(0x4271E500UL))
#define bFM4_MFS15_CSIO_STMR_TM1               *((volatile unsigned char*)(0x4271E504UL))
#define bFM4_MFS15_CSIO_STMR_TM2               *((volatile unsigned char*)(0x4271E508UL))
#define bFM4_MFS15_CSIO_STMR_TM3               *((volatile unsigned char*)(0x4271E50CUL))
#define bFM4_MFS15_CSIO_STMR_TM4               *((volatile unsigned char*)(0x4271E510UL))
#define bFM4_MFS15_CSIO_STMR_TM5               *((volatile unsigned char*)(0x4271E514UL))
#define bFM4_MFS15_CSIO_STMR_TM6               *((volatile unsigned char*)(0x4271E518UL))
#define bFM4_MFS15_CSIO_STMR_TM7               *((volatile unsigned char*)(0x4271E51CUL))
#define bFM4_MFS15_CSIO_STMR_TM8               *((volatile unsigned char*)(0x4271E520UL))
#define bFM4_MFS15_CSIO_STMR_TM9               *((volatile unsigned char*)(0x4271E524UL))
#define bFM4_MFS15_CSIO_STMR_TM10              *((volatile unsigned char*)(0x4271E528UL))
#define bFM4_MFS15_CSIO_STMR_TM11              *((volatile unsigned char*)(0x4271E52CUL))
#define bFM4_MFS15_CSIO_STMR_TM12              *((volatile unsigned char*)(0x4271E530UL))
#define bFM4_MFS15_CSIO_STMR_TM13              *((volatile unsigned char*)(0x4271E534UL))
#define bFM4_MFS15_CSIO_STMR_TM14              *((volatile unsigned char*)(0x4271E538UL))
#define bFM4_MFS15_CSIO_STMR_TM15              *((volatile unsigned char*)(0x4271E53CUL))
#define bFM4_MFS15_CSIO_STMCR_TC0              *((volatile unsigned char*)(0x4271E580UL))
#define bFM4_MFS15_CSIO_STMCR_TC1              *((volatile unsigned char*)(0x4271E584UL))
#define bFM4_MFS15_CSIO_STMCR_TC2              *((volatile unsigned char*)(0x4271E588UL))
#define bFM4_MFS15_CSIO_STMCR_TC3              *((volatile unsigned char*)(0x4271E58CUL))
#define bFM4_MFS15_CSIO_STMCR_TC4              *((volatile unsigned char*)(0x4271E590UL))
#define bFM4_MFS15_CSIO_STMCR_TC5              *((volatile unsigned char*)(0x4271E594UL))
#define bFM4_MFS15_CSIO_STMCR_TC6              *((volatile unsigned char*)(0x4271E598UL))
#define bFM4_MFS15_CSIO_STMCR_TC7              *((volatile unsigned char*)(0x4271E59CUL))
#define bFM4_MFS15_CSIO_STMCR_TC8              *((volatile unsigned char*)(0x4271E5A0UL))
#define bFM4_MFS15_CSIO_STMCR_TC9              *((volatile unsigned char*)(0x4271E5A4UL))
#define bFM4_MFS15_CSIO_STMCR_TC10             *((volatile unsigned char*)(0x4271E5A8UL))
#define bFM4_MFS15_CSIO_STMCR_TC11             *((volatile unsigned char*)(0x4271E5ACUL))
#define bFM4_MFS15_CSIO_STMCR_TC12             *((volatile unsigned char*)(0x4271E5B0UL))
#define bFM4_MFS15_CSIO_STMCR_TC13             *((volatile unsigned char*)(0x4271E5B4UL))
#define bFM4_MFS15_CSIO_STMCR_TC14             *((volatile unsigned char*)(0x4271E5B8UL))
#define bFM4_MFS15_CSIO_STMCR_TC15             *((volatile unsigned char*)(0x4271E5BCUL))
#define bFM4_MFS15_CSIO_SCSCR_CSOE             *((volatile unsigned char*)(0x4271E600UL))
#define bFM4_MFS15_CSIO_SCSCR_CSEN0            *((volatile unsigned char*)(0x4271E604UL))
#define bFM4_MFS15_CSIO_SCSCR_CSEN1            *((volatile unsigned char*)(0x4271E608UL))
#define bFM4_MFS15_CSIO_SCSCR_CSEN2            *((volatile unsigned char*)(0x4271E60CUL))
#define bFM4_MFS15_CSIO_SCSCR_CSEN3            *((volatile unsigned char*)(0x4271E610UL))
#define bFM4_MFS15_CSIO_SCSCR_CSLVL            *((volatile unsigned char*)(0x4271E614UL))
#define bFM4_MFS15_CSIO_SCSCR_CDIV0            *((volatile unsigned char*)(0x4271E618UL))
#define bFM4_MFS15_CSIO_SCSCR_CDIV1            *((volatile unsigned char*)(0x4271E61CUL))
#define bFM4_MFS15_CSIO_SCSCR_CDIV2            *((volatile unsigned char*)(0x4271E620UL))
#define bFM4_MFS15_CSIO_SCSCR_SCAM             *((volatile unsigned char*)(0x4271E624UL))
#define bFM4_MFS15_CSIO_SCSCR_SCD0             *((volatile unsigned char*)(0x4271E628UL))
#define bFM4_MFS15_CSIO_SCSCR_SCD1             *((volatile unsigned char*)(0x4271E62CUL))
#define bFM4_MFS15_CSIO_SCSCR_SED0             *((volatile unsigned char*)(0x4271E630UL))
#define bFM4_MFS15_CSIO_SCSCR_SED1             *((volatile unsigned char*)(0x4271E634UL))
#define bFM4_MFS15_CSIO_SCSCR_SST0             *((volatile unsigned char*)(0x4271E638UL))
#define bFM4_MFS15_CSIO_SCSCR_SST1             *((volatile unsigned char*)(0x4271E63CUL))
#define bFM4_MFS15_CSIO_SCSFR0_CS1L0           *((volatile unsigned char*)(0x4271E680UL))
#define bFM4_MFS15_CSIO_SCSFR0_CS1L1           *((volatile unsigned char*)(0x4271E684UL))
#define bFM4_MFS15_CSIO_SCSFR0_CS1L2           *((volatile unsigned char*)(0x4271E688UL))
#define bFM4_MFS15_CSIO_SCSFR0_CS1L3           *((volatile unsigned char*)(0x4271E68CUL))
#define bFM4_MFS15_CSIO_SCSFR0_CS1L4           *((volatile unsigned char*)(0x4271E690UL))
#define bFM4_MFS15_CSIO_SCSFR0_CS1SPI          *((volatile unsigned char*)(0x4271E694UL))
#define bFM4_MFS15_CSIO_SCSFR0_CS1SCINV        *((volatile unsigned char*)(0x4271E698UL))
#define bFM4_MFS15_CSIO_SCSFR0_CS1CSLVL        *((volatile unsigned char*)(0x4271E69CUL))
#define bFM4_MFS15_CSIO_SCSFR1_CS2L0           *((volatile unsigned char*)(0x4271E6A0UL))
#define bFM4_MFS15_CSIO_SCSFR1_CS2L1           *((volatile unsigned char*)(0x4271E6A4UL))
#define bFM4_MFS15_CSIO_SCSFR1_CS2L2           *((volatile unsigned char*)(0x4271E6A8UL))
#define bFM4_MFS15_CSIO_SCSFR1_CS2L3           *((volatile unsigned char*)(0x4271E6ACUL))
#define bFM4_MFS15_CSIO_SCSFR1_CS2L4           *((volatile unsigned char*)(0x4271E6B0UL))
#define bFM4_MFS15_CSIO_SCSFR1_CS2SPI          *((volatile unsigned char*)(0x4271E6B4UL))
#define bFM4_MFS15_CSIO_SCSFR1_CS2SCINV        *((volatile unsigned char*)(0x4271E6B8UL))
#define bFM4_MFS15_CSIO_SCSFR1_CS2CSLVL        *((volatile unsigned char*)(0x4271E6BCUL))
#define bFM4_MFS15_CSIO_SCSFR2_CS3L0           *((volatile unsigned char*)(0x4271E700UL))
#define bFM4_MFS15_CSIO_SCSFR2_CS3L1           *((volatile unsigned char*)(0x4271E704UL))
#define bFM4_MFS15_CSIO_SCSFR2_CS3L2           *((volatile unsigned char*)(0x4271E708UL))
#define bFM4_MFS15_CSIO_SCSFR2_CS3L3           *((volatile unsigned char*)(0x4271E70CUL))
#define bFM4_MFS15_CSIO_SCSFR2_CS3L4           *((volatile unsigned char*)(0x4271E710UL))
#define bFM4_MFS15_CSIO_SCSFR2_CS3SPI          *((volatile unsigned char*)(0x4271E714UL))
#define bFM4_MFS15_CSIO_SCSFR2_CS3SCINV        *((volatile unsigned char*)(0x4271E718UL))
#define bFM4_MFS15_CSIO_SCSFR2_CS3CSLVL        *((volatile unsigned char*)(0x4271E71CUL))

